[
  {
    "paragraph_index": 0,
    "raw_text": "Hermione Granger was born to Mr and Mrs Granger, both dentists, on 19 September 1979. She was their only child and daughter.[29] The couple chose 'a nice, unusual' first name for her because they wanted to establish how educated and intelligent they were, while also knowing that she would be unique and special.[30] Mr and Mrs Granger were 'a bit bemused' by the oddities displayed by their daughter, but they were proud and accepting of her nonetheless. The couple gave Hermione a bedroom on the first-floor of their house,[31] and they lived happily for many years."
  },
  {
    "paragraph_index": 1,
    "raw_text": "Upon turning eleven, Hermione was happily surprised to learn that she was a witch and was therefore invited to attend Hogwarts. She eagerly accepted and took to studying magic even before she began her first year at Hogwarts in the September of 1991, learning all the set spell books by heart and even managing to perform 'a few spells' at home successfully. In addition to the texts set by the school, Hermione brought with her several other books for reference and to further her understanding of the wizarding world,[3] to the point that she had looked at books and had more knowledge of the wizarding world than some of her pure-blood and half-blood classmates."
  },
  {
    "paragraph_index": 2,
    "raw_text": "Hermione enjoyed her years as a pupil at Hogwarts and took assignments, classes, and school rules very seriously. She was often described as brilliant, to the point of being said to be 'the brightest witch of her age'. Her favourite subject was initially Charms, and later Arithmancy. Given her keen mind, some students — such as Terry Boot — wondered why Hermione was Sorted into Gryffindor rather than Ravenclaw, and she admitted that the Sorting Hat did consider putting her in Ravenclaw. It is likely that the Sorting Hat ultimately put her in Gryffindor after stalling for about 4 minutes because Hermione chose to be in it, just like Harry chose to not be in Slytherin; this is reinforced by how on the train earlier she stated that 'Gryffindor... sounds by far the best.'"
  },
  {
    "paragraph_index": 3,
    "raw_text": "She later proved her rightful place in Gryffindor with her steadfast bravery and loyalty to her friends, Hogwarts, and Dumbledore's Army. After being Sorted into Gryffindor, Hermione shared a dormitory with Lavender Brown, Parvati Patil, Fay Dunbar and an unnamed ginger-haired girl.[32]"
  },
  {
    "paragraph_index": 4,
    "raw_text": "In spite of always wanting to follow the school rules, after Hermione became friends with Harry and Ron, she would disobey the rules along with them in order to successfully complete their group affairs. For example, she went with Ron and Harry into the third-floor corridor in their first year, which students were temporarily forbidden from entering, in order to save the Philosopher's Stone; she assisted in creating the Polyjuice Potion in their second year; and although Harry was the one who taught Dumbledore's Army in their fifth year, she was the one who came up with the idea."
  },
  {
    "paragraph_index": 5,
    "raw_text": "Hermione was a couple of weeks away from turning twelve when she boarded the Hogwarts Express in 1991, where she met Harry Potter and Ron Weasley while helping Neville Longbottom find his pet toad, Trevor. Hermione demonstrated knowledge and talent with magic beyond most of those her age, despite having only recently discovered that she was a witch. She wished to be a Gryffindor or a Ravenclaw, and her wish was granted considering she did get sorted into Gryffindor."
  },
  {
    "paragraph_index": 6,
    "raw_text": "Hermione soon proved to be the best in all her classes, eager to please the professors and to help others learn, albeit in a bossy way that made it difficult for her to make friends. Although she was a know-it-all, Hermione did often help Neville Longbottom, who struggled in most classes other than Herbology.[3]"
  },
  {
    "paragraph_index": 7,
    "raw_text": "Hermione strictly followed all school rules and tried to prevent other students from breaking rules and getting into trouble. On one night, she followed Harry and Ron as they were leaving Gryffindor Tower to duel Draco Malfoy. They were chased by Argus Filch, acting on a tipoff by Malfoy, into the third-floor corridor — forbidden to students — where they came face-to-face with Fluffy, a three-headed dog belonging to Hagrid. Later on, she argued that her spying was to their benefit when she pointed out the dog had been standing on a trapdoor, which neither Harry nor Ron had noticed.[3]"
  },
  {
    "paragraph_index": 8,
    "raw_text": "The friendship between Harry, Ron and Hermione was solidified when, on Hallowe'en in 1991, the three were forced to confront a mountain troll, which had been secretly let into the school by Professor Quirinus Quirrell. Unaware that a troll was on the loose in the school, Hermione had spent that day crying in the girls' bathroom after overhearing Ron making unkind comments about her."
  },
  {
    "paragraph_index": 9,
    "raw_text": "The troll made its way into the bathroom she was in, and Harry and Ron came to her rescue, saving her. When Professors Minerva McGonagall, Severus Snape and Quirinus Quirrell arrived at the scene, Hermione covered for the boys, claiming she was fighting the troll because she had thought that she could manage, having read a great deal about them and that Ron and Harry had merely come to help her escape. From then on, the three students were best friends and spent large amounts of time together.[3]"
  },
  {
    "paragraph_index": 10,
    "raw_text": "The incident with the troll was by no means her only adventure in that first year. During the first Quidditch match, Hermione set Professor Snape's robes on fire when she thought he was jinxing Harry's broom. In the spring of 1992, Hagrid, now a friend of Hermione's through Harry, managed to procure a Dragon egg, the unlicensed possession of which was illegal. The three children secretly helped Hagrid care for the beast, which he'd named Norbert. When the dragon was discovered, she and Harry smuggled it out of the school to some friends of Ron's elder brother, Charlie Weasley, who worked as a dragon-tamer."
  },
  {
    "paragraph_index": 11,
    "raw_text": "On their way back to the dormitories they were caught by Argus Filch, who escorted them to Professor Minerva McGonagall. Along with Neville Longbottom and Draco Malfoy, they received detention and had fifty points deducted each from their respective houses.[3]"
  },
  {
    "paragraph_index": 12,
    "raw_text": "After their run-in with Fluffy, Harry deduced that whatever Hagrid had retrieved from Gringotts was beneath the trapdoor. Hagrid let it slip that '... What's under that trapdoor is strictly between Dumbledore and Nicholas Flamel'. After much research turned up nothing, Harry was given a Dumbledore Chocolate Frog Card by Neville, which mentions Dumbledore's work in Alchemy with Flamel. This led Hermione to look at a large book on Alchemy which she had borrowed from the library for 'a bit of light reading'. After consulting the book, she realised that Fluffy was guarding the Philosopher's Stone.[3]"
  },
  {
    "paragraph_index": 13,
    "raw_text": "Fearing that Lord Voldemort would return if he stole the stone, and believing that Snape was acting as a double agent and attempting to steal it, Harry decided to steal it first. When he told Hermione that he could go on alone, she rebuffed him. After the trio passed Fluffy, it was Hermione who freed Ron from a patch of Devil's Snare he had dropped into by conjuring Bluebell Flames. She later got herself and Harry through a challenge involving a potion riddle in order to obtain the right potion between many of them. Hermione used her logic to figure out the riddle and let Harry go forward without her, as there was only enough potion for one person.[3]"
  },
  {
    "paragraph_index": 14,
    "raw_text": "Later, at the Farewell Feast in the Great Hall, Hermione, Harry, Ron, and Neville were all awarded extra House points for bravery and heroism, allowing Gryffindor to win the House Cup. Hermione earned fifty points for Gryffindor by correctly solving Professor Snape's potion riddle.[3]"
  },
  {
    "paragraph_index": 15,
    "raw_text": "Before she started her second year, Hermione wrote several letters to Harry at Privet Drive, all of which were intercepted by Dobby, as the house-elf wanted Harry to believe that his friends had forgotten him in order to prevent his return to Hogwarts. She and her parents also accompanied Harry and the Weasley family to Diagon Alley to shop for school supplies.[4]"
  },
  {
    "paragraph_index": 16,
    "raw_text": "It was during her second school year that Hermione first encountered the prejudice and hatred surrounding her blood status, when Draco Malfoy called her a 'filthy little Mudblood' after she told him off for insulting the Gryffindor Quidditch team. Hermione had never heard the highly offensive term but looking around at everyone around her, it was an obvious fact. Fred and George Weasley lunged at him, and Ron even tried to hex him, but it backfired, as his wand had been damaged. To help Hermione feel better about the incident, Hagrid urged her not to think about it, pointing out that she was a talented witch, regardless of what bigoted people said about her Muggle-born status.[4]"
  },
  {
    "paragraph_index": 17,
    "raw_text": "Harry and Ron were surprised, and Ron annoyed, by Hermione's obvious crush on Gilderoy Lockhart, who became that year's Defence Against the Dark Arts professor. She scored full marks on the first quiz in his class, which consisted entirely of questions pertaining to Lockhart's books, including a question regarding his favourite colour (lilac) that most of the class had answered incorrectly. In fact, she went as far as to doodle hearts on her DADA assignments, not knowing until later that he was, in reality, a self-obsessed fraud.[4]"
  },
  {
    "paragraph_index": 18,
    "raw_text": "On Hallowe'en 1992 Hermione attended Nearly Headless Nick's Deathday Party with Harry and Ron. Whilst heading back upstairs, she followed Harry in a detour, after he claimed to be hearing voices. They discovered the caretaker's cat, Mrs Norris, petrified and the walls vandalised. Hermione began spending all her free time in the Hogwarts Library after she saw the writing on the corridor walls, which had said that the Chamber of Secrets had been re-opened. Despite hoping to read about the legend, she could not, as all the books had been previously checked out.[4]"
  },
  {
    "paragraph_index": 19,
    "raw_text": "Hermione shocked everyone when she actually interrupted Professor Binns during a History of Magic class, asking about the Chamber of Secrets. This was the only known time when a student had asked the boring professor a question, and the class was interested in what he had to say. Professor Binns had stated that Salazar Slytherin had hidden a chamber which consisted of a horrible monster. It had been unleashed before once by an 'Heir of Slytherin', petrifying many Muggle-born and had also killed a Ravenclaw girl, named Myrtle Warren, who began haunting the girls' lavatory and became known as Moaning Myrtle. Slytherin, a pure-blood loyalist, was against Muggle-born children being allowed to attend Hogwarts, but he was outnumbered by the other founders and Muggle-borns like Hermione were permitted as students. Slytherin fled the school, but rumours spread that he had built a hidden chamber; it was said that the school had been searched many times, but no such chamber had been found.[4]"
  },
  {
    "paragraph_index": 20,
    "raw_text": "When Harry proposed the theory that Draco Malfoy was the Heir of Slytherin, Hermione and Ron agreed. Hermione suggested that they brew Polyjuice Potion, and temporarily transform themselves into Slytherin students in an attempt to find out the truth. She went even further by daring to check Moste Potente Potions out of the library using a note from Professor Lockhart — who had no idea what the book was — in the desire to research the potion. The book was in the Restricted Section and therefore unavailable to younger students without permission from a teacher. She hoped that they would be able to obtain a viable confession from Malfoy, if he was unaware he was being interrogated. She brewed the potion in Moaning Myrtle's bathroom, as no one used it due to Myrtle herself being highly irritating. She also risked serious consequences when she stole potion ingredients from Professor Snape's personal cupboards that were needed for the difficult potion, which took a month to brew.[4]"
  },
  {
    "paragraph_index": 21,
    "raw_text": "Unfortunately, Hermione was unable to join Harry and Ron in the ruse with Polyjuice Potion because the hair she obtained from Slytherin Millicent Bulstrode during their scuffle in the Duelling Club was actually the hair of Bulstrode's cat. Hermione grew fur and a tail and remained in the Hospital Wing for weeks as she did not transform back when the normal duration of effectiveness — one hour — was up. Harry and Ron, however, were able to use the potion she brewed to transform into Gregory Goyle and Vincent Crabbe, respectively. They entered the Slytherin common room, and through conversation with Draco Malfoy, realised that he was not the Heir of Slytherin, and was not involved in the opening of the Chamber after all.[4] Meanwhile, Hermione continued to complete her school work from her bed in the Hospital Wing while she recovered.[33]"
  },
  {
    "paragraph_index": 22,
    "raw_text": "Months after her recovery from the Polyjuice complication, Hermione suffered another accident. Drawing the connection between Harry hearing voices in the walls and him being a Parselmouth, she came to the conclusion that the creature attacking students must be a Basilisk, and rushed to the library to conduct further research. On her way back from the library, she warned the first person she saw, Penelope Clearwater, and advised her to look around corners with a mirror before going anywhere. It saved both their lives, because they were both petrified when they spotted the Basilisk's eyes through the mirror instead of dying immediately as they would have done if they'd looked straight into its eyes.[4]"
  },
  {
    "paragraph_index": 23,
    "raw_text": "Though she was petrified for the rest of the school year, Hermione was still able to assist Harry and Ron, for she had torn out the page on Basilisks and scribbled on it 'pipes', referencing the manner in which the creature had moved around the school undetected. Harry and Ron found it clenched in her hand when they were finally allowed to visit her in the Hospital Wing. Using this note and other information they had gathered, Harry and Ron were able to successfully put an end to Lord Voldemort's plans to resurrect his body through his memory stored in an old school diary.[4]"
  },
  {
    "paragraph_index": 24,
    "raw_text": "Hermione was later cured with a Mandrake Restorative Draught created by Professor Sprout. Upon arriving at the Great Hall, she was immediately greeted by Nearly Headless Nick. After hugging Harry she exchanged an awkward greeting with Ron. Hermione was disappointed to learn that, as a special treat for the school, Professor Dumbledore cancelled the students' end of year exams, but she was intensely proud that her friends had solved the mystery.[4] That summer, Hermione went on holiday to France with her parents.[34]"
  },
  {
    "paragraph_index": 25,
    "raw_text": "Just before she began the 1993-1994 school year, while visiting Diagon Alley with Harry and the Weasley family, Hermione met and adopted a ginger part-Kneazle cat named Crookshanks from the Magical Menagerie. However, her new bond with her cat caused friction with Ron and his pet rat Scabbers, as Crookshanks was always trying to catch the rat. Also at the beginning of this school year, Hermione obtained a Time-Turner from Professor McGonagall so she could double up on classes, though this was kept secret from everyone, even Harry and Ron."
  },
  {
    "paragraph_index": 26,
    "raw_text": "When Harry received a Firebolt for Christmas with no note, Hermione reported it to Professor McGonagall, thinking it was sent by Sirius Black, whom everyone believed to be a dangerous murderer who was after Harry. His broom was taken away to be inspected, which caused a temporary rift between the two friends. There was a further social strain for Hermione when Ron accused Crookshanks of eating Scabbers, who had disappeared."
  },
  {
    "paragraph_index": 27,
    "raw_text": "Hermione poured herself into defending Buckbeak, the hippogriff on trial before the Committee for the Disposal of Dangerous Creatures for attacking Draco Malfoy during a Care of Magical Creatures class. Once the trio reconciled, after Hagrid told Harry and Ron how disappointed he was when they selfishly put the Firebolt and Scabbers over their friendship with Hermione, they apologised. Their initial attempt to save Buckbeak failed, as Lucius Malfoy frightened the Committee into deciding that the creature would be executed. Hermione was extremely upset by this news and grew furious to the point of slapping Draco Malfoy when he dared to mock Hagrid for his tears and being upset over Buckbeak's fate."
  },
  {
    "paragraph_index": 28,
    "raw_text": "That year, Hermione was among the students who found Remus Lupin to be the best Defence Against the Dark Arts teacher they have ever had. She cleverly deduced that Professor Lupin was a werewolf, based on his Boggart taking the form of a full moon, the timing of his unexplained absences from class, and Professor Snape changing a lesson he took over to the subject of werewolves even though it wasn't due on the syllabus for weeks. However, she didn't expose Lupin, presumably because she believed he was a good teacher and didn't agree with the prejudice many hold against werewolves."
  },
  {
    "paragraph_index": 29,
    "raw_text": "Divination, on the other hand, turned out to be a subject Hermione had no respect or interest in. She considered it a 'woolly subject' and mocked it to Harry and Ron. She also considered it less interesting then the subject of Ancient Runes. She also believed that Divination was an imprecise branch of magic, an opinion she and Professor McGonagall shared.[34] She soon dropped the subject after Professor Sybill Trelawney told her that she did not possess the Second Sight."
  },
  {
    "paragraph_index": 30,
    "raw_text": "On the day of Buckbeak's execution, the trio ventured down to console Hagrid. While in his cabin, Hermione discovered Scabbers, Ron's lost rat. Hagrid urged them to leave and they witnessed from a distance what they believed to be Buckbeak's execution. Before they could return to their dormitory, Scabbers bit Ron and fled. While chasing after the rat, they were attacked by a black dog, which pulled Ron by the leg into a tunnel beneath the Whomping Willow, which then attacked them."
  },
  {
    "paragraph_index": 31,
    "raw_text": "Afterward, Hermione and Harry hurried after them eventually arriving in the Shrieking Shack, where Sirius Black, whose Animagus form was the black dog, confronted them. They were soon joined by Professor Lupin who was acting strangely, and Hermione told Harry and Ron of her belief that he was a werewolf, which he then confirmed. It was revealed that Sirius had been framed for the betrayal of James and Lily Potter, and that the true traitor was Peter Pettigrew, who had been hiding from the world as Ron's pet rat. Hermione also cast Expelliarmus on Snape when he discovered them, knocking him out, at which she was horrified."
  },
  {
    "paragraph_index": 32,
    "raw_text": "Once it had been decided that Pettigrew would be turned over to the authorities rather than murdered, the motley group left the Shrieking Shack. When the full moon appeared, chaos ensued as Lupin transformed into a werewolf as, due to the chaotic turn of events, he hadn't taken the Wolfsbane Potion that Professor Snape produced for him monthly in order for him to retain his humanity. In the chaos, Pettigrew attacked Ron and escaped, and Sirius had to transform into his dog form in order to protect Harry, Ron, and Hermione from the werewolf. After Lupin was eventually distracted by a howl from the Forbidden Forest, Hermione and Harry rushed to Sirius' aid when they heard him moaning, but hundreds of Dementors descended on them, come to recapture Sirius who quickly fainted, and Harry told Hermione to think of something happy and attempt to cast a Patronus as he was trying to himself, but she was unable to cast one."
  },
  {
    "paragraph_index": 33,
    "raw_text": "As Harry conjured an incorporeal Patronus, Hermione passed out, leaving Harry to fight the Dementors alone. Harry held them off for a while but was eventually overwhelmed. The Dementors were about to perform the Dementor's Kiss on Harry, Hermione, and Sirius when a mysterious figure in the distance cast a very powerful Patronus Charm to repel the Dementors. Unable to see properly in the resulting blinding light, Harry thought he glimpsed his father just before he, too, lost consciousness."
  },
  {
    "paragraph_index": 34,
    "raw_text": "Harry and Hermione awoke in the Hospital Wing after being rescued by Severus Snape, who conjured stretchers for Hermione, Harry and Sirius. After realising that Sirius' soul was to be destroyed by the Dementor's Kiss and receiving vague, though instructive and useful, instructions from Dumbledore, Hermione used her Time-Turner to return herself and Harry to a time earlier in the evening. It was a very difficult task and Harry had to be constantly reminded by Hermione to stay concealed as being seen could cause irreparable damage to their timelines. Hermione agreed with Harry that it was difficult to watch their problems again, but she strictly said that they could do nothing about it, as bad things happened to wizards who tried to meddle with their past and future lives."
  },
  {
    "paragraph_index": 35,
    "raw_text": "The two did, however, successfully use the opportunity to rescue Sirius and also Buckbeak, as it was hinted by Dumbledore that more than one innocent life could be spared that night.[34] Whilst waiting, she discussed their saviour with Harry, and when Harry realised that it was not his father he saw but himself having travelled back in time, she claimed that none but a powerful wizard could have conjured a Patronus to drive away that many Dementors. As evidenced by her assertion that time-travelling was extremely dangerous, Hermione took great personal risk to save Sirius and Buckbeak. At the end of the year Hermione returned her Time-Turner, claiming it caused too much trouble and that she would drop a few subjects instead, which was a very big surprise to everyone."
  },
  {
    "paragraph_index": 36,
    "raw_text": "Before her fourth year at Hogwarts, Hermione spent much of the summer holidays at The Burrow with Harry and Ron, sharing a room with Ginny Weasley. With the other Weasleys (excluding Molly Weasley), they attended the 1994 Quidditch World Cup in August. After the game, the communal campsite was set upon by Death Eaters. Hermione, Harry, and Ron fled into the woods and witnessed the casting of Morsmordre. Initially caught up in the chaos surrounding the effort to catch the caster, she took exception to the accusations levelled against Harry, and the many wizards' treatment of the house-elf Winky who had also been at the scene."
  },
  {
    "paragraph_index": 37,
    "raw_text": "Once at Hogwarts, it was revealed to the students that former Auror Alastor Moody (who was, in fact, a polyjuiced Barty Crouch Jnr) was to be the new Defence Against the Dark Arts professor, Lupin having left at the end of the previous year due to Snape outing his werewolf status. Moody was a hands-on professor who believed in a practical approach when it came to defence. One of his earliest lessons was on the Unforgivable Curses. Hermione and her fellow classmates witnessed the curse's effects on a spider."
  },
  {
    "paragraph_index": 38,
    "raw_text": "Hermione began a crusade for the liberation of house-elves by beginning the Society for the Promotion of Elfish Welfare, or what she and the group called S.P.E.W, (or, as Ronald Weasley called it, 'spew') having been appalled by Bartemius Crouch's abusive treatment of his house-elf Winky. This did not earn her any popularity, as most believed that house-elves enjoy their work; indeed, even the house-elves did not like her campaigning."
  },
  {
    "paragraph_index": 39,
    "raw_text": "Harry, Ron, and Neville only reluctantly joined S.P.E.W., mostly in order to prevent Hermione from nagging them about it. Hagrid as well as Fred and George Weasley refused to join on the grounds that it would upset the house-elves. Despite this, Fred did tell Hermione how to get into the Hogwarts kitchens. One morning she (along with Harry and Ron) visited the kitchens, where she spoke to Dobby and Winky. Dobby was pleased to see Harry and his friends and proceeded to tell them his struggles as a freed elf."
  },
  {
    "paragraph_index": 40,
    "raw_text": "While the trio were within the kitchen it was revealed that Winky was so saddened by the lose of her previous job that she had taken to drinking Butterbeer, as a means to get drunk and numb her pain. Hermione considered Dobby to be a good example of a free elf and tried to comfort Winky about being sacked by Crouch. This did little good, however, as Winky soon became upset by Hermione's claims that house-elves deserved to have holidays and wages. Winky was not the only elf bothered by this, as the other elves stated that proper house-elves would never need such things and to want them is considered very shameful."
  },
  {
    "paragraph_index": 41,
    "raw_text": "After the events surrounding Harry's name coming out of the Goblet of Fire, Hermione was the only student who believed Harry's innocence. In fact, she 'accepted his story without question'. Even Ron was suspicious that Harry had cheated in order to gain more glory, creating a rift between the two for some time. Hermione helped Harry prepare for the first task of the Triwizard Tournament by helping him learn useful spells. Some of the spells were Stupefy, Impedimenta, Accio, the Shield Charm, and the Four-Point Spell. She also tried to get Harry and Ron to talk to one another multiple times."
  },
  {
    "paragraph_index": 42,
    "raw_text": "Hermione unknowingly attracted the interest of Durmstrang Triwizard Champion and Bulgarian International Seeker, Viktor Krum. He was attracted to her due to her intelligence, unconventional beauty, and the manner in which she declined to hound him for autographs, unlike other girls. Krum began following Hermione to the library and other places around Hogwarts, including the library. This was something that Hermione found very irritating, as she couldn't work when surrounded by giggling girls, who had taken it upon themselves to follow Krum throughout the castle and the school grounds. Krum even bizarrely asked Harry if it was all right for him to pursue Hermione. He eventually asked her to attend the Yule Ball with him, and she accepted, not telling anyone but Ginny Weasley that she was his date."
  },
  {
    "paragraph_index": 43,
    "raw_text": "Thus, when the pair arrived, many were stunned and jealous. Hermione wore robes of a 'floaty, periwinkle-blue material', and her hair in an 'elegant knot at the back of her head'.[35] The attention to her appearance was unusual, and she received many positive remarks on it. Even Draco Malfoy and Pansy Parkinson had nothing negative to say. Hermione commented that she had used Sleekeazy's Hair Potion, but that it was too much work to use it every day."
  },
  {
    "paragraph_index": 44,
    "raw_text": "Upon seeing Hermione with Krum, Ron was overcome with jealousy. Hermione had hoped for Ron to ask her, but his invitation was insensitive and at the last minute due to him not being able to find anyone else. The two rowed about it in the common room after the ball, in which she revealed that he should have asked her properly and not 'as a last resort', but Ron misunderstood the point. After that, the two were seemingly more polite to each other, although more distant for a time and Ron continued to show dislike and distrust towards Krum."
  },
  {
    "paragraph_index": 45,
    "raw_text": "Hermione was chosen as a 'kidnap victim' for Krum during the Tournament's second task, something that she subsequently endured teasing over. She was taken to the bottom of the Black Lake to await rescue from Krum, who donned a half-shark Transfiguration. While in the Black Lake Harry was conflicted and wanted to retrieve her as much as he wanted to retrieve Ron. He stated that 'she was his friend too'. Krum managed to rescue her and carried her to the surface, where he revealed to her later that he 'never felt this way about any other girl' and asked her to visit him in Bulgaria over the summer.[35]"
  },
  {
    "paragraph_index": 46,
    "raw_text": "Krum was jealous of Hermione's relationship with Harry Potter, thinking that there may have been something romantic between them that went beyond just plain friendship. The jealousy was founded based on the lies in the Daily Prophet and Harry was quick to inform Krum of these lies."
  },
  {
    "paragraph_index": 47,
    "raw_text": "Rita Skeeter, a journalist for the Daily Prophet and unregistered Animagus, was hiding in beetle form in Hermione's hair during her conversation with Viktor. Hermione had previously reprimanded Skeeter for printing horrible lies about Harry and Rubeus Hagrid. This angered the journalist, who wrote a scathing article on 'the devious Miss Granger', claiming that she was toying with both Harry and Krum's affections and that she had developed a taste for famous wizards."
  },
  {
    "paragraph_index": 48,
    "raw_text": "Skeeter even went so far to claim that Hermione was possibly brewing love potions. In the words of Ron, Skeeter was making Hermione out to be a 'Scarlet Woman', a phrase which made Hermione laugh. She called Hermione 'plain' in the article, in spite of previously reporting Hermione as Harry's 'stunningly pretty... girlfriend' by likely twisting and sensationalising the words of Colin Creevey and thus using this as the basis for the article."
  },
  {
    "paragraph_index": 49,
    "raw_text": "Although Hermione found the lies ridiculous, some people believed them and started sending Hermione hate mail, including one filled with Bubotuber Pus, and even Molly Weasley treated her coldly until Harry corrected her. Hermione vowed to get revenge on Skeeter for her libel, and wondered how she was getting her information, as several things Skeeter knew had only been discussed in private conversations. This led her to come to the realisation that Skeeter was an illegal unregistered Animagus, who took the form of a beetle to secretly witness confidential exchanges."
  },
  {
    "paragraph_index": 50,
    "raw_text": "The students were shocked when Harry returned at the end of the third and final task with Cedric Diggory's dead body. Hermione was relieved to see Harry when he was brought to the infirmary by Professor Dumbledore. She was upset with Minister for Magic Cornelius Fudge when he refused to believe Harry and Dumbledore about the truth of Voldemort's return. During her time with Harry in the Hospital Wing, she noticed Skeeter on a windowsill, attempting to eavesdrop, and captured her in the process. Hermione did not go against Harry's story when she finally heard it, sticking by her best friend."
  },
  {
    "paragraph_index": 51,
    "raw_text": "On the ride home on the Hogwarts Express, Hermione happily revealed to Harry and Ron that she uncovered Skeeter's status as an unregistered Animagus and had trapped her in a jar. She as an unregistered beetle Animagus that used her tiny size to come onto school grounds and listen to private conversations. She was not allowed onto school grounds and Hermione caught her on a windowsill in the hospital wing. Hermione also noticed the markings around Rita's antennae were exactly like the foul glasses she wore. She kept Skeeter from writing for a year by threatening to expose her to the authorities."
  },
  {
    "paragraph_index": 52,
    "raw_text": "She single-handed drove Skeeter into poverty, gaining revenge for the pain caused to Harry and her other friends. However, with the return of Lord Voldemort and the murder of Cedric Diggory at the end of the school year,[35] there were much more serious challenges ahead for Hermione and her friends. Hermione along with her friends and school mates attended the Memorial Feast for Cedric."
  },
  {
    "paragraph_index": 53,
    "raw_text": "Following the death of Cedric Diggory, the Ministry of Magic refused to accept Harry and Dumbledore's claims that Lord Voldemort had returned, and the Daily Prophet labelled them either liars or nutters. However, Hermione and Ron believed Harry and defended him against the criticism of doubtful classmates. Though occasionally Harry vented his frustration at them, the two stuck by him. The trio also wanted to become members of the reconvened Order of the Phoenix but were not allowed to because they were underage. Hermione helped exterminate 12 Grimmauld Place, which served as headquarters for the Order, and was immensely relieved when Harry was acquitted of the charge of having used underage magic in the presence of a muggle, after him and Dudley Dursley were attacked by a Dementor in Little Whinging."
  },
  {
    "paragraph_index": 54,
    "raw_text": "Before returning to Hogwarts, she and Ron learned that they had been appointed prefects for Gryffindor house, to the secret consternation of Harry, who couldn't believe Ron had been chosen over him. She took her position very seriously. Once the school year began, Hermione resumed some of her activism on behalf of house-elves, though she was not as intense about S.P.E.W. as she had been the previous year."
  },
  {
    "paragraph_index": 55,
    "raw_text": "She learned how to knit socks and hats for the house-elves and hid them in Gryffindor Tower, disguising them with crumpled rubbish in an attempt to trick the house-elves into accidentally freeing themselves. The elves found this attempt insulting, and they stopped cleaning the Tower at all. Dobby was the only one who enjoyed the gifts, took everything Hermione had made, and cleaned the Tower by himself, a fact which Hermione didn't know."
  },
  {
    "paragraph_index": 56,
    "raw_text": "Hermione was challenged in more ways than one that year when she met Luna Lovegood, whose belief in many things without logical grounds baffled Hermione. However, the two became friends after accepting one another's differences.[32]"
  },
  {
    "paragraph_index": 57,
    "raw_text": "Meanwhile, it was not long before Hermione realised that the Ministry of Magic had decided to interfere at Hogwarts. Dolores Umbridge, a cruel, falsely sweet Ministry employee with a personality like 'poisoned honey', was appointed as the new professor of Defence Against the Dark Arts and Hermione, like Harry and Ron, disliked Umbridge for many reasons, one of which being that she refused to teach students practical defence, focusing only on theory, despite their OWLs being later that year."
  },
  {
    "paragraph_index": 58,
    "raw_text": "With this being the case, Hermione decided that Hogwarts needed a competent teacher and, together with Harry and Ron, founded Dumbledore's Army, a secret organisation in which students would gather after classes and be taught practical defensive spells. She suggested that Harry be the teacher; though he originally thought the idea ridiculous, he consented to teach the class. The name was suggested by Ginny, who recalled the conversation they'd had about Fudge's greatest fear being that Dumbledore would form an army of students if the Ministry did not intervene at Hogwarts."
  },
  {
    "paragraph_index": 59,
    "raw_text": "One of the many advanced spells Hermione learned was the Patronus Charm; hers took the corporeal form of an otter.[23] Hermione became one of the few people brave enough to call Voldemort by his actual name. However, Hermione made the mistake of arranging the first meeting to take place in the Hog's Head, as opposed to the Three Broomsticks, which Sirius, appearing in the Gryffindor Common Room fire, said would have made it a lot harder for anyone to overhear. Willy Widdershins, who was in the Hog's Head, went to Umbridge, who instituted Educational Decree Number Twenty-Four to forbid any type of students groups from being formed under her watchful eye."
  },
  {
    "paragraph_index": 60,
    "raw_text": "Halfway through the year at Hogwarts, Harry had a vision of Voldemort's snake, Nagini, biting Mr Weasley during his task for the Order of the Phoenix. Mr Weasley was carried into St Mungo's Hospital, where Mrs Weasley screamed at him for trying to stitch his wound instead of healing it with magic."
  },
  {
    "paragraph_index": 61,
    "raw_text": "Hermione was one of the few who visited him and stayed at Number Twelve, Grimmauld Place for a couple of weeks until Mr Weasley was nursed back to health. Hermione had managed to convince her parents by telling them that skiing wasn't really her thing and that people who were serious about their exams stayed at Hogwarts and studied."
  },
  {
    "paragraph_index": 62,
    "raw_text": "The D.A. brought Harry into greater contact with Cho Chang. After a meeting, Harry kissed Cho, and when he returned to the Gryffindor Common Room Hermione immediately guessed, asking if Cho had cornered him after the meeting. When Harry told them that Cho has been crying, she explained to Harry and Ron that Cho was having a hard time since Cedric Diggory, who she used to go out with, was killed by Lord Voldemort. Hermione later gave Harry advice on Cho and girls in general."
  },
  {
    "paragraph_index": 63,
    "raw_text": "In an effort to combat the lies being told about Harry, Hermione arranged for an interview during a Hogsmeade visit with Rita Skeeter to be printed in The Quibbler telling his side of the story, blackmailing Skeeter into penning it in a sympathetic tone. Despite being banned — or maybe because it was banned — it became the magazine's best-selling issue of all time.[32]"
  },
  {
    "paragraph_index": 64,
    "raw_text": "It was Hermione's brilliant spell-work that ensured the security of Dumbledore's Army. She created coins enchanted with the Protean Charm, an advanced spell, as a method of communication, and jinxed the club's attendance sheet to give any tattler a horrendous rash on the face, which would spell out 'SNEAK' in painful boils. This is exactly what happened to Marietta Edgecombe, a reluctant member of the D.A., having been brought to the meetings by Cho. Shortly before Easter, Marietta finally caved under the pressure from her ministry mother who worked in the the Floo Network Office and betrayed the D.A. to Umbridge. When Harry learned that they could not find a counter-curse to heal her face, he swelled with pride at Hermione's jinxing ability."
  },
  {
    "paragraph_index": 65,
    "raw_text": "Dobby the house-elf learned of this turn of events and rushed to the Room of Requirement to warn Harry and the D.A. They immediately scattered, and most members escaped, but Harry was caught by Umbridge and several Slytherin students who were members of the Inquisitorial Squad. A search of the room uncovered the parchment that each member of the D.A. had signed, headed Dumbledore's Army. Finally having 'proof' that Dumbledore was building an army to challenge the Ministry, Umbridge immediately contacted Cornelius Fudge. Dumbledore fled the school and Umbridge became Headmistress. Hermione was not exposed at that time, but later she was brought to Umbridge's office by the some members of the Inquisitorial Squad."
  },
  {
    "paragraph_index": 66,
    "raw_text": "Late in the fall of that year, Hagrid, who had been missing for the entirety of the school year, returned to Hogwarts. Hermione, Harry, and Ron ventured down to see him immediately even though it was after curfew. Hermione was aghast at the injuries Hagrid had sustained and greatly curious as to his story. Hagrid told the trio about his mission with Madame Maxime to try and recruit the giants in the fight against Voldemort. They were almost caught when Umbridge called on Hagrid that night, but hid under the Invisibilty Cloak."
  },
  {
    "paragraph_index": 67,
    "raw_text": "Months later, Hermione and Harry learned why Hagrid was perpetually bruised and cut; he had brought his giant half-brother Grawp back to Hogwarts, as he was getting severely bullied, and was trying to teach him human ways. After Grawp, who had the mental age of a human toddler, picked her up, Hermione forcefully told him to put him down. He subsequently became enamoured with Hermione, calling her 'Hermy'. It was one of the few words he could pronounce."
  },
  {
    "paragraph_index": 68,
    "raw_text": "Just after their class took their O.W.L.s, Harry had a vision of his godfather being tortured by Voldemort in the Department of Mysteries. Hermione was worried that it was a trap and convinced Harry to try to contact Sirius before doing anything rash. To that end, she accompanied Harry in an act of solidarity as he sneaked into Umbridge's office to use the Floo Network, with the assistance of Ron, Ginny, and Luna Lovegood, but they were ultimately caught. When Umbridge threatened to use the Cruciatus Curse on Harry during questioning, Hermione interceded. She came up with a lie that she and her fellow D.A. members had been building a weapon for Dumbledore, thus stopping Umbridge's sadistic interrogation and attempted torture of Harry."
  },
  {
    "paragraph_index": 69,
    "raw_text": "Hermione successfully lured Umbridge into the Forbidden Forest by saying that's where the weapon was hidden, where Umbridge was carried away by a herd of centaurs. She had predicted that the centaurs would let her and Harry go, since they did not insult the centaurs and were young enough to be considered 'foals'. However, the centaurs were already enraged by Umbridge and were further angered when Hermione admitted that she had hoped that they would drive Umbridge off, being insulted that they were thought of to do the bidding of humans. The centaurs were about to carry the two students off as well, but Grawp stumbled onto the scene and a fight broke out between the giant and the herd. This allowed Hermione and Harry to escape and meet up with Ron, Ginny, Luna, and Neville, who had escaped from the Inquisitorial Squad."
  },
  {
    "paragraph_index": 70,
    "raw_text": "After a brief argument between Harry and Neville over whether or not the others were going to travel with Harry to London, an understanding was reached. The six students flew on Thestrals (which the majority, Hermione included, could not even see) to the Ministry of Magic to try to save Sirius from Voldemort and his Death Eaters."
  },
  {
    "paragraph_index": 71,
    "raw_text": "Hermione's fear turned out to be justified, as Harry's vision was a ruse planted in his brain by Voldemort designed to lure him to the Ministry to obtain a prophecy Voldemort sought. As soon as Harry did this, the six D.A. members were surrounded by Death Eaters, and a battle ensued. Hermione stunned Nott when he grabbed Harry, thus freeing him and causing Nott to be injured by the collapsing shelves of prophecies. She later stunned another Death Eater and Silenced Antonin Dolohov before he could alert the other Death Eaters to the group's location. She was critically injured by the curse Dolohov subsequently struck her with, but made a full recovery.[32]"
  },
  {
    "paragraph_index": 72,
    "raw_text": "Hermione achieved high academic prestige when she obtained ten O.W.L.s, in Charms, Defence Against the Dark Arts, Transfiguration, Care of Magical Creatures, Arithmancy, History of Magic, Herbology, Astronomy, Potions, and Ancient Runes. She received 'Outstanding' marks on each of them, except Defence Against the Dark Arts in which she received an 'Exceeds Expectations'. In total she achieved 10 O.W.L.s. Ron found it amusing that she actually seemed disappointed by this.[36]"
  },
  {
    "paragraph_index": 73,
    "raw_text": "By the time they arrived in Hogwarts, Hermione's romantic feelings for Ron had become obvious. According to Harry the two seemed on their way to a romantic relationship. Hermione and Ron's relationship suffered greatly in their sixth year, when Ron became envious of both Hermione and Harry, who were invited to be members of the Slug Club, a group of students favoured by Potions professor Horace Slughorn, while he was ignored. Hermione strongly disapproved of Harry using the textbook of the 'Half-Blood Prince' to get ahead in Potions unfairly, though she did not turn him in and indirectly found a clue about the book owner. She was particularly alarmed by the increasingly Dark nature of the magic in the book, such as the spell Sectumsempra."
  },
  {
    "paragraph_index": 74,
    "raw_text": "However, during an argument with his sister, Ginny mocked Ron about his inexperience with the opposite gender and told him that Hermione had kissed Viktor Krum during their earlier romance. Ron subsequently began treating Hermione coldly, much to her bewilderment. She was upset when he and Lavender started flirting. When she found out about Ron's relationship with Lavender, she conjured a flock of wild birds to attack Ron for his insensitivity regarding her feelings. He became even angrier with her when she believed that Harry slipped Ron Felix Felicis to assist in his Quidditch-playing abilities; despite having believed it initially himself, he accused her of having no faith in him when it was discovered that he had not been slipped the potion at all."
  },
  {
    "paragraph_index": 75,
    "raw_text": "After this, Hermione attended Slughorn's Christmas party with Cormac McLaggen to get back at Ron, but it did not go well due to the former's impoliteness. Afterwards, Ron (who was relieved that Hermione and McLaggen's date did not go well) attempted to speak to Hermione, but she ignored him, still upset and angry over his previous treatment of her.[36] This behaviour presisted for quite sometime."
  },
  {
    "paragraph_index": 76,
    "raw_text": "The two reconciled after Ron was hospitalised due to consuming poisoned mead, an event that left Hermione shaken and frightened. After the incident she remained unusually quiet and subdued. Whilst sitting at Ron's bedside, Ron subconsciously muttered Hermione's name. By this time, Ron was visibly disillusioned with his relationship with Lavender, who had become possessive of him and called him by the annoying nickname 'Won-Won'. He was also pleased whenever Hermione visited him in the hospital wing."
  },
  {
    "paragraph_index": 77,
    "raw_text": "He began avoiding Lavender, who soon became suspicious of his relationship with Hermione, ultimately leading to an argument about her. After Lavender saw Ron and Hermione come down alone from the boys' dormitories (Harry was present also, but under the invisibility cloak), she had a fight with Ron and broke up with him. When Ron told Harry and Hermione about breaking up with Lavender, Harry could have sworn he saw Hermione smirk."
  },
  {
    "paragraph_index": 78,
    "raw_text": "Afterwards, Hermione and Ron were more comfortable together, and their relationship improved considerably, although a romantic relationship remained out of their reach. Hermione comforted Ron after he failed his Apparition test because he Splinched half an eyebrow, while he teased her about the instructor's praise for her flawless performance. That year, Hermione also quickly mastered nonverbal magic, the first in her class to do so."
  },
  {
    "paragraph_index": 79,
    "raw_text": "Throughout the year, Hermione and Ron were both sceptical of Harry's theory that Draco Malfoy had been branded with the Dark Mark and was up to something. Moreover, she was confident that Malfoy couldn't have brought any Dark objects into Hogwarts without alerting Filch. These claims were heard by Draco himself, who used these details and Hermione's previous plan of communication to accomplish his own."
  },
  {
    "paragraph_index": 80,
    "raw_text": "Near the end of the school year, Harry's suspicions would be proven right. Malfoy let Death Eaters into the school by means of a pair of vanishing cabinets. One cabinet resided in Borgin and Burkes and the other in the Room of Hidden Things (as it had been presumed broken, but Malfoy managed to fix it). This infiltration of Death Eaters resulted in the Battle of the Astronomy Tower. Hermione fought in the battle and remained unscathed thanks to some Felix Felicis.[36] This was a gift from Harry, who had won it in a Potions competition and had a preconceived notion of what was going to happen. He told Hermione, Ron, and Ginny to drink it beforehand in case his worries proved true."
  },
  {
    "paragraph_index": 81,
    "raw_text": "Throughout the school year, Hermione and Ron had been informed of the content of Harry's private lessons with Dumbledore. Through these lessons Harry, and in turn Hermione and Ron, learned about the existence of Lord Voldemort's Horcruxes. During the funeral of Albus Dumbledore, who had been killed by Snape in the Battle of the Astronomy Tower, Hermione was comforted by Ron and cried on his shoulder. Afterwards, Harry told them about his desire to drop out of Hogwarts to hunt Horcruxes, which were the key to defeating Lord Voldemort. Despite his protests, Hermione and Ron promised to forgo their seventh year of school in order to assist Harry. Before leaving the school, Hermione was able to Summon books about Horcruxes so as to learn how to destroy the items. She found them in Dumbledore's office, where the late headmaster had kept them after the subject had been banned at Hogwarts."
  },
  {
    "paragraph_index": 82,
    "raw_text": "Hermione began planning for her journey with Harry and Ron immediately. Concerned for the safety of her family, she altered her parents' memories to make them think they were Wendell and Monica Wilkins and sent them to hide in Australia, no longer aware of their original identities, the existence of their daughter, or anything she had told them about Harry. She also withdrew all of her savings at her building society account, in event of a need for Muggle money.[10]."
  },
  {
    "paragraph_index": 83,
    "raw_text": "Hermione then joined the Order of the Phoenix in the operation to remove Harry from 4 Privet Drive before his 17th birthday, taking Polyjuice Potion to become one of the 'seven Potters'. Hermione flew on a Thestral with Kingsley Shacklebolt. The two fought off at least five Death Eaters, possibly killing one, injuring two, and were pursued by Lord Voldemort himself at one point. In time, they arrived safely at The Burrow, where Hermione was immensely relieved to see Harry alive and ran to him and hugged him tight, but she was greatly worried when Ron did not show up on time. When he landed, she ran and nuzzled him in relief. She was saddened by the news of Alastor Moody and Hedwig's murders and disturbed by Harry's vision of Garrick Ollivander being tortured."
  },
  {
    "paragraph_index": 84,
    "raw_text": "Later on, the Minister for Magic, Rufus Scrimgeour, interrupted Harry's birthday celebrations to execute Albus Dumbledore's will and bequeath some of his belongings to the three friends. Hermione received The Tales of Beedle the Bard, a book of children's stories written in runes. Even before Hermione understood the priceless quality of the gift, she was moved to tears by Dumbledore's great act of friendship. During the reading of Dumbledore's will, she also displayed her incredible store of general knowledge when she mentioned that 'Snitches have flesh memories', surprising both Ron and Harry, who had both believed her to know little to nothing of Quidditch."
  },
  {
    "paragraph_index": 85,
    "raw_text": "At Bill Weasley and Fleur Delacour's wedding on 1 August 1997, Hermione wore a 'floaty, lilac-coloured dress with matching high heels' and made her hair 'sleek and shiny'. She was amused by Fred and George's stories about their late uncle Bilius and shared a friendly exchange with Viktor Krum, to the frustration of Ron. She was happily surprised when Ron quickly asked her to dance, and when Krum asked a disguised Harry whether the two were together, Harry replied 'Er... sort of.'[10]"
  },
  {
    "paragraph_index": 86,
    "raw_text": "The wedding was interrupted by Kingsley Shacklebolt's Patronus who told the guests of the fall of the Ministry of Magic. Hermione was prepared to make a quick escape, immediately Disapparating herself, Harry, and Ron away from the danger. Hermione also showed great foresight and magical talent when she revealed a small beaded purse on which she had placed an Undetectable Extension Charm. Within it she had packed, amongst other things, clothing, a tent, healing supplies, Harry's Invisibility Cloak, and several useful books. They arrived on the Muggle street, Tottenham Court Road, where Hermione suggested they enter a café, as a means to get out of the open."
  },
  {
    "paragraph_index": 87,
    "raw_text": "However, minutes later Hermione unknowingly triggered the Taboo jinx that was placed on Voldemort's name, and the trio were thus tracked down by Antonin Dolohov and Thorfinn Rowle. After a brief but violent skirmish, the Death Eaters were subdued, and Hermione modified their memories to throw them off the scent and to maintain Ron's cover story that he was sick with spattergroit and bedridden at home. At Harry's suggestion the three then made their way safely to 12 Grimmauld Place, as they could not hide anywhere within the wizarding world.[10]"
  },
  {
    "paragraph_index": 88,
    "raw_text": "After learning from Mundungus Fletcher that Dolores Umbridge had Tom Riddle's mother's locket - one of the seven Horcruxes - in her possession, the trio formed a plan to infiltrate the Ministry and reclaim the locket. Hermione imbibed Polyjuice Potion and transformed to look like Mafalda Hopkirk, a prominent Ministry official. She was forced to sit through the trials of Alderton and Mary Cattermole, innocent Muggle-borns, right alongside Umbridge and Death Eater Yaxley. Hermione tricked Umbridge into telling her about the locket, which she claimed was a Selwyn family heirloom."
  },
  {
    "paragraph_index": 89,
    "raw_text": "When Harry attacked Umbridge in a rage, their cover was blown, but she and Harry managed to free the Muggle-born prisoners and encouraged them to flee the country while Voldemort was in power. Hermione took the locket from Umbridge, replacing it with a copy using the Geminio spell. They met up with Ron again and fled the Ministry, but Yaxley grabbed onto Hermione's arm while they were Disapparating. This meant that he was unwittingly brought inside the enchantment making Grimmauld Place undetectable, and forced Hermione to use a Revulsion Jinx to free herself from him, and then to take the trio away from Grimmauld Place.[10]"
  },
  {
    "paragraph_index": 90,
    "raw_text": "The locket caused great pain among the three friends due to the negative energy within. They began arguing over petty issues such as cooking, and growing moodier. The negative energy from the locket caused Ron to accuse Harry of poor leadership. They fought physically, resulting in Hermione having to stop them before they could start casting spells by casting a Shield Charm between them. Ron also accused Hermione of choosing Harry over him, causing him to be jealous and feel left out by his two friends' growing friendship. He declared he was leaving and stormed out of the tent."
  },
  {
    "paragraph_index": 91,
    "raw_text": "By the time she got rid of the shield charm, all Hermione could do was scream for him to come back, without success. Hermione then cried over Ron for more than a week after his departure, although she tried to hide it from Harry. Both were deeply saddened and hurt by their friend's departure, Hermione more than Harry, as she cried over Ron's departure for weeks. With Ron gone, Hermione and Harry's evenings were spent in mostly silence, while they contemplated Ron's abandonment and the places Voldemort's remaining Horcruxes might be hidden."
  },
  {
    "paragraph_index": 92,
    "raw_text": "Hermione and Harry soon decided to go to Godric's Hollow, to see the graves of Harry's parents and to speak to historian Bathilda Bagshot. They believed Bathilda might be holding onto Godric Gryffindor's Sword for Harry, as they thought Dumbledore might have left it with her as an old family friend, knowing it was the only method the trio knew for destroying a Horcrux. Hermione comforted Harry in the graveyard when they found the Potters' graves; she nuzzled her head in to the crook between his head and shoulders and conjured roses for the graves. On their way out of the graveyard they came into contact with what appeared to be Bathilda."
  },
  {
    "paragraph_index": 93,
    "raw_text": "The pair then went to Bathilda's house; whilst in the house they were separated. Harry witnessed a giant snake pouring from the neck of Bathilda's body and was attacked by Nagini upstairs. Nagini had been waiting for them in the guise of the old woman, whose corpse had been animated like an Inferius by Voldemort. Hermione rushed to Harry's aid and proceeded to save his life by casting a Blasting Cure, which ricocheted around the room. The two of them barely escaped before Lord Voldemort himself arrived at the cabin in an attempt to capture Harry."
  },
  {
    "paragraph_index": 94,
    "raw_text": "Hermione Apparated to the Forest of Dean, while Harry was overcome with pain and visions of Voldemort's attack on his parents and him in 1981. She used a Severing Charm to remove the locket from Harry and healed the bite Nagini had given him with dittany. Harry's wand had also been broken in the foray, most likely by the Blasting Curse Hermione cast at Nagini. Hermione was very upset a the thought that it was her curse that broke Harry's wand. Harry was heartbroken, but not angry with her, knowing that it was an accident and that Hermione had saved his life and therefore could not hold it against her.[10]"
  },
  {
    "paragraph_index": 95,
    "raw_text": "Ron reunited with Harry and Hermione in the Forest of Dean, after Ron heard them talking through the Deluminator Dumbledore had left him. Ron destroyed the locket Horcrux with Godric Gryffindor's Sword, which had been left by an unknown assistant in a pool in the Forest, saving Harry's life and thus receiving forgiveness from Harry for leaving. Before he destroyed it, however, the locket revealed some of Ron's deepest fears, including that Hermione preferred Harry to him. Hermione, however, was unaware of this, as she had been in the tent while this occurred."
  },
  {
    "paragraph_index": 96,
    "raw_text": "Upon seeing Ron, she screamed at Ron despite Harry trying to tell her that Ron just saved his life, and punched him until Harry cast a shield charm between them with Hermione's wand. She was furious with Ron for days for his abandonment, but gradually warmed up to him again."
  },
  {
    "paragraph_index": 97,
    "raw_text": "The trio then travelled together to Xenophilius Lovegood's home to ask him about the strange symbol in The Tales of Beedle the Bard, which Xenophilius had worn on a chain around his neck at Bill and Fleur's wedding. They had thought it to be the sign of the Dark wizard Gellert Grindelwald after Krum recognised it at the wedding (Grindelwald being a former Durmstrang student), but Xenophilius informed them it was the symbol of the Deathly Hallows. Shortly after making this discovery, Harry realised that Luna wasn't at home, despite it being the Christmas holidays, and had been away for a long time. Xenophilius revealed to them that Luna had been taken prisoner by Death Eaters and that he planned to betray them in order to get her back."
  },
  {
    "paragraph_index": 98,
    "raw_text": "However, in attempting to capture them, Xenophilius made the Erumpent horn in his living room (which he had insisted was a Snorkack horn, much to Hermione's annoyance) explode, giving the trio the chance to hide just as Death Eaters Selwyn and Travers arrived. They threatened to kill Luna if they found that Xenophilius had lied about Harry Potter's presence in his home. In a remarkable show of mental and magical dexterity, Hermione concocted the trio's escape while safeguarding Ron's feigned illness and allowing the Death Eaters to glimpse Harry, so that they would not carry out their threat to kill Luna.[10]"
  },
  {
    "paragraph_index": 99,
    "raw_text": "In the spring of 1998, Harry accidentally triggered the Taboo jinx and Hermione, Harry, and Ron were tracked down and captured by a group of Snatchers, which included the werewolf Fenrir Greyback. Greyback had developed cannibalistic tendencies when out of werewolf form and was eager to bite Hermione. After a brief and violent interrogation by the Snatchers, the captives were brought to Malfoy Manor and turned over to Bellatrix Lestrange. Bellatrix immediately panicked at the sight of Godric Gryffindor's Sword and incapacitated the Snatchers with ease, as she was too quick for them. She then ordered them moved to the courtyard where she would deal with them later."
  },
  {
    "paragraph_index": 100,
    "raw_text": "Bellatrix gave away that what she believed to be the sword and another Horcrux were hidden in her vault at Gringotts in her panic. She proceeded to isolate Hermione and then brutally torture her with the Cruciatus Curse repeatedly along with taking a dagger and cutting the word Mudblood into her arm as interrogation methods. Ron (who had tried to take her place unsuccessfully) was reduced to sobs from hearing Hermione scream in pain. However, Hermione came up with a fake story that the sword was merely a copy of the real thing; a lie that Harry persuaded the imprisoned goblin Griphook to go along with."
  },
  {
    "paragraph_index": 101,
    "raw_text": "Hermione was soon tortured into unconsciousness. With Hermione's moans and screams of pain echoing throughout the manor, Harry and Ron saw no possible hope left. Suddenly, Dobby came to the rescue of the prisoners in the dungeon, with audible crack as he apparated. Harry and Ron fought off Peter Pettigrew, who had been sent to investigate the noise. Harry snarled at him that Pettigrew owed him for Harry's sparing of his life with Lupin and Sirius, and the momentary relaxing of Pettigrew as a result caused him to be choked to death by his own silver hand (created by Voldemort) for showing Harry mercy."
  },
  {
    "paragraph_index": 102,
    "raw_text": "They raced upstairs and were forced to drop their wands when Bellatrix held a silver knife to Hermione's throat. Bellatrix cut through some skin, leaving a thin cut on the front of Hermione's neck. Right when Bellatrix was about to slit her throat, Dobby returned and sent the chandelier crashing to the floor, knocking Bellatrix over and enabling Harry to grab their wands from Draco and Disapparate with Hermione, Ron, Griphook, and Dobby to Shell Cottage, where Bill and Fleur Weasley took up residence after their marriage. Unfortunately, Dobby was killed during this escape, by a knife Bellatrix threw."
  },
  {
    "paragraph_index": 103,
    "raw_text": "Hermione, Harry, and Ron stayed at Shell Cottage for some time, whilst Fleur helped Hermione recover from her trauma. Ron didn't leave Hermione's bedside throughout this time. The trio formed a plan to break into the Lestrange Vault at Gringotts to retrieve the Horcrux Helga Hufflepuff's Cup, with the reluctant assistance of Griphook. The goblin only agreed to help them in exchange for Gryffindor's Sword; although lothe to lose it, Hermione was strongly against deceiving or double-crossing Griphook, who was startled by the care she and Harry had shown for house-elves, since most wizards do not think highly of non-human beings. The trio reluctantly agreed to Griphook's terms."
  },
  {
    "paragraph_index": 104,
    "raw_text": "Once more, Hermione used Polyjuice Potion, containing Bellatrix's hair. She was also forced to use Bellatrix's wand, as her wand had been confiscated by Snatchers. She very much disliked this, as the wand in question had caused so much suffering, such as contributing to Sirius' murder. She stated that the wand felt wrong and Harry speculated that it was because Hermione had not won the wand's intelligence."
  },
  {
    "paragraph_index": 105,
    "raw_text": "It was determined that Hermione was 'too polite' to really impersonate Bellatrix, as she did not treat those around her like scum. Despite this, the group managed to get into the vault, mainly because of Harry's use of the Imperius Curse. After many harrowing challenges, and Griphook betraying them out of a belief that they would not have kept to their agreement, Hermione, Ron, and Harry escaped on the back of the half-blind dragon that was guarding the vault, with another Horcrux in their possession.[10]"
  },
  {
    "paragraph_index": 106,
    "raw_text": "The trio finally returned to Hogwarts on 2 May 1998, with the assistance of Aberforth Dumbledore, after Harry had a vision that the remaining Horcrux they had not identified (but suspected was something formerly belonging to Rowena Ravenclaw) was hidden at the school. They were reunited with their friends in the reformed Dumbledore's Army, who declared their wish to fight the encroaching Death Eater army. Whilst Harry and Luna went to Ravenclaw Tower, Hermione and Ron retrieved Basilisk fangs from the Chamber of Secrets in order to use them to destroy Horcruxes, and Hermione destroyed Hufflepuff's Cup."
  },
  {
    "paragraph_index": 107,
    "raw_text": "Soon after reuniting with Harry, Ron expressed concern for the house-elves in the Hogwarts kitchens, prompting Hermione to kiss him for the very first time. Ron responded with great enthusiasm, but they quickly broke apart when Harry reminded them of their objective."
  },
  {
    "paragraph_index": 108,
    "raw_text": "The trio then entered the Room of Requirement in search for Rowena Ravenclaw's Diadem, but were ambushed by Draco Malfoy, Gregory Goyle, and Vincent Crabbe. Hermione dodged a Killing Curse and managed to stun Goyle, and then she and Ron dragged him out of the room on a broomstick as it went up in flames due to Crabbe's cursed Fiendfyre, which also destroyed the Horcrux. Harry rescued Draco, but Crabbe was killed by his creation."
  },
  {
    "paragraph_index": 109,
    "raw_text": "Harry, Hermione and Ron then witnessed the death of Fred Weasley, which devastated them all. Despite their grief, the trio continued with the effort to track down Nagini, the last Horcrux (that they knew of). On their way, Hermione incapacitated two Death Eaters who were pursuing her, Harry and Ron, and blasted Fenrir Greyback away from an injured Lavender Brown. Lavender unfortunately still tragically died afterwards from her injuries."
  },
  {
    "paragraph_index": 110,
    "raw_text": "The trio was swarmed by Dementors and all had difficulty summoning their Patronuses because of the horror of their recent experiences, but Luna, Ernie Macmillan, and Seamus Finnigan came to their assistance. Under Harry's Invisibility Cloak, the three made their way to the Shrieking Shack, where they witnessed Voldemort have Nagini kill Severus Snape, as he had (ultimately incorrectly) assumed that the Elder Wand's loyalty lay with Snape."
  },
  {
    "paragraph_index": 111,
    "raw_text": "During the brief pause in fighting, when Voldemort issued an ultimatum to Harry, Hermione comforted Ginny Weasley over Fred's death. When Voldemort and his army approached with a supposedly dead Harry, Hermione screamed in horror and denial."
  },
  {
    "paragraph_index": 112,
    "raw_text": "The Battle of Hogwarts soon resumed, and Hermione fought Bellatrix Lestrange alongside Ginny and Luna, despite being hindered by using Bellatrix's own wand against her. When Bellatrix nearly killed Ginny, Molly Weasley took over the fight and killed Bellatrix. Hermione witnessed Harry's final defeat of Lord Voldemort, and she and Ron reached him first, overjoyed. Hermione survived the battle relatively unscathed, only suffering minor injuries and burns she received from entering the Lestranges' Vault shortly before the battle.[10]"
  },
  {
    "paragraph_index": 113,
    "raw_text": "At some point, Hermione found her parents in Australia and restored their memories. In 1998, Hermione went back to Hogwarts to attain her N.E.W.T.s.[37]"
  },
  {
    "paragraph_index": 114,
    "raw_text": "During the trial of Dolores Umbridge shortly after the war, Umbridge managed to escape and ally with some Death Eaters (Corban Yaxley, the Carrows, and Walden Macnair). Together, they planned a plot involving Time-Turners to bring back the dictatorship that had existed in the British Ministry of Magic from 1997–1998. They were stopped, however, by Hermione, Harry Potter and Ronald Weasley.[38]"
  },
  {
    "paragraph_index": 115,
    "raw_text": "At some point between 2010 and 2011, Hermione travelled to Diagon Alley, where she accidentally bumped into a Hogwarts student, causing both of them to drop their belongings. After the two apologised to each other, Hermione noticed that the spine on one of the student's books was broken, watching as they used the Mending Charm to fix it. Hermione asked if the student was enjoying their time at Hogwarts, which the student confirmed, although they admitted feeling somewhat overwhelmed on account of being Muggle-born. Hermione, herself a Muggle-born witch, reassured the student that they didn't have to learn everything in their first year, before asking them what their favourite class was."
  },
  {
    "paragraph_index": 116,
    "raw_text": "Upon hearing their answer, she explained that Study of Ancient Runes was one of her favourite classes, to which the student, who hadn't previously recognised Hermione, revealed that they had just purchased a copy of The Tales of Beedle the Bard newly translated from Ancient Runes by Hermione Granger, noting that the picture of the author looked just like her. Hermione explained that she was indeed the author of the book and thanked them for buying a copy, asking them to send her an owl when they had finished in order to hear their thoughts on it. Hermione then wished the student luck in their studies, asking them to say hello to Neville Longbottom and Rubeus Hagrid for her as well.[33]"
  },
  {
    "paragraph_index": 117,
    "raw_text": "On 19 September, her birthday of a certain year, Hermione went back to Hogwarts in reminiscence. While at Hogwarts she visited the Library, as it was one of her favorite locations within the school. During her school days she spent extensive amounts of time within its walls. While in the library she encountered the same student. She noticed the book they were holding and told her story that involved it.[39]"
  },
  {
    "paragraph_index": 118,
    "raw_text": "Hermione also came to Hogwarts's aid when the school fell under attack by Dementors and other Dark creatures, and joined the big battle at the end. When it was over, she discussed the possible cause of the attacks with Harry, Ron and the Hogwarts staff, noting that the other creatures couldn't have been swayed by the Dementors to join the attacks, since they were not easily affected by them as humans would be.[40]"
  },
  {
    "paragraph_index": 119,
    "raw_text": "When Ron Weasley asked Hermione to help him sell joke products and compete against his brother George, who had already invited Harry, she couldn't say no, and so she came to Zonko's Joke Shop when they were having a sale there, though she didn't really care for pranks and found that she was not good at promoting the products with passion. She was having a conversation with Harry in the shop when they met the Muggle-born student, who was surprised to see Hermione was the important guest that Ron claimed to have invited, seeing as she didn't seem to be the kind of person that was interested in joke products. Hermione agreed and talked about her feelings with them, and gave them some tokens to buy products with to save herself from doing her promotion speech.[41]"
  },
  {
    "paragraph_index": 120,
    "raw_text": "By 2017, Hermione and Ron were married with two children: Rose and Hugo Granger-Weasley. She had several nieces and nephews through her marriage to Ron. Hermione was also the godmother of Harry and Ginny Potter's eldest child, James Sirius.[42]"
  },
  {
    "paragraph_index": 121,
    "raw_text": "Hermione attained a high position in the Ministry of Magic, first through the Department for the Regulation and Control of Magical Creatures. There, she continued her work with S.P.E.W., working for the rights of underprivileged non-humans such as house-elves. She tried to get his house elf Gaby to take temporary possession of the Bewildering Bloom after Yubert Thorne was imprisoned, and to send scarves and other items to house elves at Hogwarts through a student friend of hers.[43]She then went on to become Deputy Head[12] of the Department of Magical Law Enforcement, and assisted the Minister for Magic Kingsley Shacklebolt in eradicating the old laws biased in favour of pure-bloods. Along with Harry and Ron, she helped to revolutionise the Ministry and reform the wizarding world. At some point, Hermione, Harry, and Ron were all featured on Chocolate Frog Cards for their accomplishments.[44]"
  },
  {
    "paragraph_index": 122,
    "raw_text": "Hermione also eventually translated The Tales of Beedle the Bard from the original, which had been written in runes and which Albus Dumbledore bequeathed to her in his will in 1997. Her new translation was published in 2008 and included notes on each tale written by Dumbledore before his death; these notes were lent to Hermione by her former professor, Hogwarts Headmistress Minerva McGonagall.[45]"
  },
  {
    "paragraph_index": 123,
    "raw_text": "Both Hermione and Ron attended the 2014 Quidditch World Cup and sat in VIP Box Two. Rita Skeeter noted that Ron had become catatonic at the appearance of the Bulgarian Veela and Hermione had to elbow him in the ribs."
  },
  {
    "paragraph_index": 124,
    "raw_text": "On 1 September 2017, Hermione and Ron brought their children to King's Cross Station to see Rose off for her first year at Hogwarts School of Witchcraft and Wizardry, and met Harry, Ginny, and their three children there."
  },
  {
    "paragraph_index": 125,
    "raw_text": "At some point between 2019 and 2020, Hermione was elected as Minister for Magic.[46] In the summer of 2020, Hermione had to visit Harry to ask him to complete his paperwork and the other tasks he was yet to do. She talked about her concerns for recent activity similar to ones which happened when Voldemort was alive. Harry reminded her that he did just find a Time-Turner and he would get round to the rest of the tasks in his own time. They agreed that the Time-Turner should be destroyed and Hermione hid it away."
  },
  {
    "paragraph_index": 126,
    "raw_text": "A few months later, Hermione was returning to her office when she was stopped by Ron, who was really Albus Potter transfigured to look like Ron. Albus was trying to stall her while Scorpius Malfoy and Delphi stole the Time-Turner. Hermione found Ron annoying although he stalled her long enough for the others to find the Time-Turner and they left."
  },
  {
    "paragraph_index": 127,
    "raw_text": "Hermione had found out about Harry's nightmares and how his scar was hurting again and she called a meeting. However, no one thought it was a threat."
  },
  {
    "paragraph_index": 128,
    "raw_text": "Hermione's life was changed by Albus and Scorpius when they meddled with time. In one alternate reality, she did not marry Ron and became the Defence Against the Dark Arts teacher at Hogwarts. In another alternate reality where Harry died, Hermione was in hiding as a member of what remained of Dumbledore's Army with Ron and Severus Snape. When Scorpius turned up with information about the original timeline where they won, Hermione agreed to help put time right again by time-travelling to the moment Scorpius changed time and use a Shield Charm to stop him. Hermione was the one to use the charm first, but when they returned to the present, it was still changed. They were attacked by Dementors and Hermione and Ron professed their love for each other and sacrificed their souls to the Dementors to give Scorpius time to escape."
  },
  {
    "paragraph_index": 129,
    "raw_text": "When time was right again, Hermione visited Hogwarts to attend a meeting with Professor McGonagall. Hermione, along with Ron, Harry, Ginny and Draco were very forgiving of what Albus and Scorpius did, but McGonagall reminded them of great dangers that happened, and could still have been, because they meddled with time."
  },
  {
    "paragraph_index": 130,
    "raw_text": "When Albus and Scorpius were kidnapped by Delphi and made to travel in time again to 31 October 1981, Hermione travelled in time again with Ron, Harry, Ginny and Draco Malfoy to save them. Hermione helped transfigure Harry to look like Voldemort to trick Delphi who hopes to save him, and then later helped Harry duel Delphi. She and Draco then apprehended her and took her back to the present where she was sent to Azkaban."
  },
  {
    "paragraph_index": 131,
    "raw_text": "During the Calamity, Hermione acted as one of the apparent leading members of the newly-created Statute of Secrecy Task Force and would introduce members who had proven to be qualified to Professions after complimenting on their impressive combination of determination and ability. She would also help the members personally, instructing those who pursued a professorship on the Proficiency Charm after returning from a sojourn overseas while giving Aurors a retrospective regarding her experiences in the Second Wizarding War to help them in fighting Death Eaters.[13]"
  },
  {
    "paragraph_index": 132,
    "raw_text": "Hermione sent a Calamity Investigator working for the Task Force to reverse the accidental shrinking of several tea shops in Dagenham by George Weasley as a result of testing one of his new joke products, a Tea Snug, a task which they quickly completed. Hermione later gave an impromptu talk about the Calamity at the Leaky Cauldron, which was attended by the same Calamity Investigator. From this talk, the Calamity Investigator learned about the ineffability of the Calamity, from which they figured out a new way to improve their Trace Charm.[13]"
  },
  {
    "paragraph_index": 133,
    "raw_text": "Hermione later learned that the same Calamity Investigator had discovered a large number of fire-breathing chickens beneath an inn in Brondby, Denmark, and brought them back to the Ministry, as they had recently become a noted wizarding delicacy. Hermione thanked the Calamity Investigator by securing them higher-energy meals at wizarding bed and breakfast inns. She later hosted a practical class on localised casting of the Sunlight Charm, which was attended by the same Calamity Investigator. As part of the class, Hermione demonstrated that the volume of light produced could be modulated with specific wrist motions, which the Calamity Investigator used to improve their use of the Greenhouse Charm. Hermione also presented the same Calamity Investigator with the then-newly-created Green Wand award for their painstaking gathering of greenhouse ingredients every day.[13]"
  },
  {
    "paragraph_index": 134,
    "raw_text": "In the spring of 2021, The Unforgivable threatened Harry Potter and Hermione after the two began wrenching control of Calamity surges away from the cabal. The two feared that their children would be targeted, but Harry insisted on continuing to fight against the Unforgivable. Harry redirected a Calamity surge and controlled it using memories of the Marauders. When Minerva McGonagall was uncharacteristically late in reporting to the SOS Task Force, Constance Pickering, Harry Potter, and Hermione Granger feared she had been attacked. By April, it became apparent that while Minerva was unharmed, Ginny had been attacked and Ron had been abducted.[47]"
  },
  {
    "paragraph_index": 135,
    "raw_text": "Following their attack on Harry's wife and Hermione's husband, the Unforgivable unleashed a surge of Dragon Adversaries. While this was disastrous, it allowed Harry to tap into somebody's memory of being forced to abduct Ron.[48] Shortly after, the Unforgivable unleashed a surge of Foundables related to Weasleys' Wizard Wheezes where Ron worked. While the Unforgivable succeeded in intimidating Harry and Hermione, Harry even enlisted the help of MACUSA in the hopes of finding his best friend, this attack only made Hermione even more determined to bring the cabal to justice.[49] The Unforgivable began a campaign of harassment and manipulation to secure their position preceding negotiations for Ron's returns, including implanting false memories in Molly Weasley of Ron crying and begging her to tell Harry and Hermione to listen to the Unforgivable so that he could return home. Molly instead instructed Hermione to 'give them Hell'.[50]"
  },
  {
    "paragraph_index": 136,
    "raw_text": "By the end of April, the Unforgivable had delivered their list of demands via notes dispatched within Foundables. In exchange for Ron's safe return, they not only wanted full command of the Calamity but for London Five victim Kit Gerrard and the defector informant Flavius Flint to be delivered to them. Hermione decided that she and Constance should use Polyjuice Potion to take the places of Gerrard and Flint as a means to infiltrate the Unforgivable, with Harry delivering them in exchange for Ron. It seemed the Unforgivable were aware of this deception, as well as where the Ministry's defences were weakest, however."
  },
  {
    "paragraph_index": 137,
    "raw_text": "Whilst duelling against members of the cabal, Constance was hit with a Blasting Curse but luckily came away with only mild burns. While Ron was recovering, albeit unconscious, the real Flavius and Kit were taken. When Constance returned from having her injuries healed at St Mungo's, she reported that Ron had woken up and his memories had been completely Obliviated, to the point where he could not even recognise his wife.[48] Hermione wondered if everything, including rescuing Ron, had been part of the cabal's plans all along. She and Harry considered the possibility of a mole in the Ministry or a Legilimens among the Unforgivable's ranks.[50]"
  },
  {
    "paragraph_index": 138,
    "raw_text": "In May 2021, Calamity surges surrounding baby magical creatures created the impression that the Unforgivable were involved in illegal poaching and trading of rare beasts. Fragments of a note apparently from Grim Fawley contained co-ordinates to a location in Cape Town, to where Harry Potter led a team of Aurors in order to stop a potential auction, and to find members of the cabal. Unfortunately, no auction took place, adding weight to the theory of a mole in the Ministry. The return of mountain troll and Acromantula fragments caused Ron Weasley to remember events from his past, though he still could not remember the names of people close to him.[51] Following this, Hermione resorted to drugging various Ministry members with Truth Serum then erasing their memories of being interrogated by her. This method outed Gareth Greengrass as not only the mole but a high ranking member of the Unforgivable.[52]"
  },
  {
    "paragraph_index": 139,
    "raw_text": "Hermione hoped that the detention of Gareth Greengrass would put a stop to the appearance of Adversaries, however instead the SOS Taskforce was inundated with an unprecedented surge of all known Feared Adversaries over the course of a week (14–21 July 2021). Hermione speculated that perhaps Greengrass was capable of manipulating the Calamity without a wand, though Constance thought it might be that Greengrass was not the one responsible. Hermione also claimed that 'anyone who could bring Darkness like this into the world must be capable of powerful magic'.[53]"
  },
  {
    "paragraph_index": 140,
    "raw_text": "Following his detention, Gareth Greengrass repeatedly proclaimed innocence and his colleagues in the Department of Mysteries called for his release, even going so far as to accuse Harry and Hermione of using the Imperius Curse to obtain a false confession. As testimony procured under Veritaserum was inadmissible and there was no paper trail or actual evidence of Greengrass's involvement with the Unforgivable, Hermione turned her attention to helping Ron recover his memories of the 1992–1993 school year. During this time, an Auror discovered that Gareth's strange habit of delivering Interdepartmental Memos via owl was part of a ruse. Gareth's owl was a Transfigured potions cabinet containing Polyjuice Potion. When tested, those who imbibed the potions turned into Hermione and the editor-in-chief of the Daily Prophet, linking Gareth Greengrass to the abductions of Ginny and Ron. A complication arose, however, when it became apparent one of the Polyjuice Potions had been tampered with during the month that Gareth was detained. Hermione concluded that this was part of an escape attempt and alerted Harry.[54]"
  },
  {
    "paragraph_index": 141,
    "raw_text": "Gareth Greengrass was eventually caught out and taken into custody in an official capacity, but remained tight-lipped until Harry rose the issue of Gareth's daughter. It was discovered that Cereus Greengrass suffered a blood malediction. Gareth and Harry formed an Unbreakable Vow, sealed by Constance Pickering, whereby Harry would find a cure for Gareth's daughter and in turn Gareth would help Harry uncover the identities of the Unforgivable. Harry visited St Mungo's and placed a large donation, securing special care for Cereus. By the time he returned, however, Gareth Greengrass was dead. During these events, Hermione contemplated the likelihood of Gareth hiding information in their conversations, and concluded that Penelope Fawley might be trapped in an image much like Kit Gerrard had been. She went to check a photograph of Grim and Penelope that was on Gareth's desk, only to find it had gone missing. A mysterious male figure was implicated but not identified.[55]"
  }
]