[
  {
    "text": "Severus Snape, born to an abusive Muggle father and a neglectful witch mother, grew up unloved and alone. His pain fostered a bitter heart, turning him into a man who hid his scars behind cruelty, haunted by the shadows of a childhood starved of care.",
    "source_paragraph_index": 0
  },
  {
    "text": "Severus Snape embraced his mother's bloodline, calling himself the 'Half-Blood Prince.' His lonely childhood, filled with neglect and pain, forged a man who cloaked his wounds in bitterness, forever haunted by the love he never knew.",
    "source_paragraph_index": 0
  },
  {
    "text": "Severus Snape's childhood was shadowed by neglect in the bleak alleys of Spinner's End. Amidst broken streets and fading light, he longed for escape, dreaming of Hogwarts as his only refuge. Despite the despair, the memory of Holiday Blancmange brought fleeting comfort, a taste of sweetness amid the darkness.",
    "source_paragraph_index": 1
  },
  {
    "text": "At Spinner's End, Severus Snape's ragged clothes and unwashed face mirrored a life of neglect. Surrounded by fighting parents and broken surroundings, he yearned for the warmth of Hogwarts. Yet, even in hardship, a simple childhood joy—Holiday Blancmange—remained a precious memory to hold onto.",
    "source_paragraph_index": 1
  },
  {
    "text": "Severus Snape watched Lily Evans with fascination, sensing her hidden magic. His heart yearned for her friendship, and soon they bonded, a fragile hope blooming in his lonely world. Lily saw only friendship, but Severus’s admiration burned quietly, a tender ache amid his unspoken longing.",
    "source_paragraph_index": 2
  },
  {
    "text": "Severus Snape’s eyes darkened with contempt whenever Petunia Evans mocked his modest life. His feelings for Lily made her sister’s disdain sting worse, fueling a quiet bitterness. In his heart, love and resentment intertwined, shaping a boy haunted by unfulfilled hope and silent rejection.",
    "source_paragraph_index": 2
  },
  {
    "text": "Severus Snape struggled to connect, his awkwardness shadowing every attempt to be liked. Even when he longed to impress Lily and Petunia, his social skills betrayed him, leaving him feeling isolated and misunderstood. His heart yearned for acceptance, yet his clumsy gestures only widened the gap.",
    "source_paragraph_index": 3
  },
  {
    "text": "Severus Snape remembered the first train ride to Hogwarts, sitting beside Lily Evans. Their bond was tentative, yet hopeful, amid the clash of James Potter and Sirius Black. That bitter debate over houses marked the beginning of a lifelong rivalry, forging scars that would shadow Severus’s heart forever.",
    "source_paragraph_index": 4
  },
  {
    "text": "Severus Snape, sorted into Slytherin, quickly mastered dark arts beyond his years. At eleven, he knew more curses than seventh-years, creating spells like Sectumsempra and Muffliato. His talent drew him close to a dangerous gang of future Death Eaters, forging a path shadowed by power and darkness.",
    "source_paragraph_index": 5
  },
  {
    "text": "Severus Snape remembered Lucius Malfoy's warm greeting on their first day at Hogwarts. Their bond grew quietly, built on trust and unspoken understanding. Years later, Severus watched over Draco Malfoy, his loyalty rooted in those early, kind moments that defined his silent devotion.",
    "source_paragraph_index": 6
  },
  {
    "text": "Severus Snape met Patricia Rakepick, a rebellious fifth year who thrived on mischief. Her daring spirit and rule-breaking ways drew both admiration from students and disapproval from teachers. Despite the warnings, Severus was drawn into her world, feeling a dangerous thrill in walking the line between rebellion and consequence.",
    "source_paragraph_index": 7
  },
  {
    "text": "Severus Snape watched Rakepick with growing suspicion. Her relentless pursuit of the Cursed Vaults ignited a quiet fear in him. He saw ambition in her eyes, a dangerous fire that threatened Hogwarts. Snape's trust waned, and he wondered if her true motives would bring disaster to the castle and everyone he cared for.",
    "source_paragraph_index": 8
  },
  {
    "text": "Severus Snape, shy and studious, faced relentless hostility from James and his friends. James's arrogance and popularity fueled their rivalry, worsened by Severus's quiet love for Lily. Their school years were a battlefield of unspoken longing and bitter conflict, each encounter leaving a scar on Severus's heart.",
    "source_paragraph_index": 9
  },
  {
    "text": "Severus followed Remus under the full moon, risking everything. When Sirius’s plan was revealed, James heroically intervened, saving Severus from the deadly wrath of a werewolf. Severus's secret remained safe, but the truth of Remus’s curse haunted him forever.",
    "source_paragraph_index": 10
  },
  {
    "text": "Severus Snape remembers James humiliating him in school, turning him upside-down and exposing his underwear. Lily’s attempt to defend him only made things worse. In a moment of anger, Severus called Lily a Mudblood, shattering their friendship forever. That painful memory haunted him, a stain on his soul.",
    "source_paragraph_index": 11
  },
  {
    "text": "Severus Snape watched Lily choose James, knowing his love was unreciprocated. James's maturity couldn't hide his lingering hatred for Severus, secretly hexing him behind Lily's back. Severus felt the sting of rejection, painfully aware that James's enmity persisted, even as Lily's heart seemed to lean elsewhere.",
    "source_paragraph_index": 12
  },
  {
    "text": "Snape watched Jacob, the reckless rule-breaker, unleash curses that tore through their school. Amidst chaos and fear, Snape’s disdain grew, knowing Jacob’s arrogance had caused lives to fall apart. Though Snape escaped unscathed, he felt the weight of loss and betrayal deep within his heart.",
    "source_paragraph_index": 13
  },
  {
    "text": "As Jacob’s cursed magic ravaged their school, Snape’s eyes burned with fury and sorrow. He saw innocence shattered, yet Jacob remained untouched, unrepentant. Snape vowed to remember this darkness, a haunting reminder of the dangers born from reckless defiance.",
    "source_paragraph_index": 13
  },
  {
    "text": "Severus Snape's childhood was marked by innate talent; even in school, his notes revealed a mind constantly crafting curses and potions. While others struggled with lessons, Severus’s scribbles whispered of a genius eager to innovate, blending brilliance and rebellion in every line.",
    "source_paragraph_index": 14
  },
  {
    "text": "Severus Snape created spells like Levicorpus, which held victims upside-down, and Sectumsempra, slicing with bloody precision. His secrets spread, and by fifth year, Levicorpus became notorious at Hogwarts. Snape’s dark ingenuity haunted the castle, a reminder of his hidden power and the chaos he unleashed.",
    "source_paragraph_index": 15
  },
  {
    "text": "Severus Snape’s potions were more than recipes; they were weapons. Levicorpus and Sectumsempra whispered of danger, secrets slipping free into Hogwarts’ shadows. Each spell revealed a glimpse of a boy forging darkness, his name etched into the haunted corridors of his past.",
    "source_paragraph_index": 15
  },
  {
    "text": "Severus Snape watched silently as his secret identity, the Half-Blood Prince, guided Harry Potter to success. Harry praised the mysterious teacher, unaware of Snape’s sacrifice. When the truth unraveled, Snape felt a sting of heartbreak, knowing his true self was hidden even from those he wished to protect.",
    "source_paragraph_index": 16
  },
  {
    "text": "Severus Snape's hidden identity as the Half-Blood Prince brought quiet pain. Harry’s admiration grew, blind to Snape’s sacrifice. When the truth finally surfaced, Snape’s heart ached—his greatest secret revealed, yet his love and sacrifice remained forever concealed behind a mask.",
    "source_paragraph_index": 16
  },
  {
    "text": "Severus Snape's secret nickname, the Half-Blood Prince, hid a painful truth—his mother's maiden name and his blood status woven together. Harry glimpsed the resemblance to Voldemort's dark self-naming, but Snape kept his true identity hidden, a silent burden that haunted him in shadows.",
    "source_paragraph_index": 17
  },
  {
    "text": "Severus Snape's potions textbook bore the name Half-Blood Prince, a mysterious alias. Hermione uncovered its meaning—his mother's maiden name and bloodline—while Snape's silent, private struggle remained hidden, a secret name known only to him, cloaked in secrecy and pain.",
    "source_paragraph_index": 17
  },
  {
    "text": "Severus Snape, torn between darkness and light, joined Voldemort's Death Eaters. His silence hid secrets that could destroy or save. When he overheard Trelawney’s prophecy, his heart clenched—knowing his actions could doom Harry Potter or save the wizarding world. Loyalty and betrayal haunted Snape’s every breath.",
    "source_paragraph_index": 18
  },
  {
    "text": "Severus Snape moved silently in Voldemort’s shadow, his role vital yet shrouded in mystery. When he eavesdropped on Dumbledore’s allies, he felt the weight of destiny. Each secret he uncovered pulled him deeper into darkness, forever torn between allegiance and regret, carrying the burden of choices that defined his life.",
    "source_paragraph_index": 18
  },
  {
    "text": "Snape remembers the prophecy's weight—destined destruction for Voldemort. As July ended, two children were born—Harry Potter and Neville Longbottom—each carrying hope or peril. Snape's heart clenched, knowing one held the key to their world’s fate, yet uncertain which one it would be.",
    "source_paragraph_index": 19
  },
  {
    "text": "Snape's mind races with prophecy’s shadow—two children born in July, one destined to destroy Voldemort. He feels the silent tension, the weight of unknown future, as hope and darkness collide. In that moment, Snape understands that fate's cruel twist might rest on one innocent life.",
    "source_paragraph_index": 19
  },
  {
    "text": "Severus Snape risked everything to overhear a life-changing prophecy, hoping to protect those he cared about. But Aberforth, sharp-eyed and unforgiving, caught him in the act and cast him out. Snape's silence haunted him, a secret burden weighing heavily on his soul.",
    "source_paragraph_index": 20
  },
  {
    "text": "Severus Snape revealed to Albus that he overheard the prophecy, but only fragments reached him. Caught by Aberforth in the act, Snape was thrown out—his chance to act lost in the shadows, leaving a haunting silence that would forever shape his sacrifices.",
    "source_paragraph_index": 20
  },
  {
    "text": "Snape overheard the prophecy and hurried to warn Voldemort, unaware that Lily’s life was at stake. When he learned Voldemort intended to kill her son, Snape begged for her safety, haunted by his role. His love for Lily drove him to betray Voldemort, sealing his fate as Lily’s unwavering protector.",
    "source_paragraph_index": 21
  },
  {
    "text": "After Lily’s death, Snape’s heart broke. Bound by love and guilt, he dedicated himself to shielding Harry, Lily’s son. His sacrifices, driven by a fierce hope for redemption, ultimately helped destroy Voldemort, all to honor Lily’s memory and ensure her sacrifice was not in vain.",
    "source_paragraph_index": 21
  },
  {
    "text": "Snape's world shattered when Lily died, his despair so deep he wished himself gone. Dumbledore's words kept him fighting: protect Harry, Lily's son, from Voldemort's return. Snape vowed to shield Harry, haunted by betrayal and loss, living a life of sacrifice amid distrust and hatred, driven by a promise born from grief.",
    "source_paragraph_index": 22
  },
  {
    "text": "Despite the pain of betrayal and exile, Snape dedicated his life to Dumbledore's cause. Living in shadows, he guarded Harry fiercely, haunted by Lily’s memory. His sacrifice was unseen, his love unacknowledged, yet Snape persisted—an unwilling hero torn between trust and hatred—forever bound to protect the boy who resembled Lily.",
    "source_paragraph_index": 22
  },
  {
    "text": "Severus Snape arrived at Hogwarts in 1981, hopes high. Despite his passion for defending others, his repeated rejections haunted him. When Jacob was expelled for risking everything to uncover dark secrets, Snape felt a deep ache—his own dreams slipping away as the castle's shadows grew darker.",
    "source_paragraph_index": 23
  },
  {
    "text": "Severus Snape longed to teach Defence Against the Dark Arts, but rejection after rejection shattered his confidence. Watching Jacob's reckless pursuit of cursed secrets, Snape's heart ached—his own aspirations fading in the cold shadows of a castle torn by danger and disappointment.",
    "source_paragraph_index": 23
  },
  {
    "text": "Dumbledore's trust in Snape was unshaken, even as others doubted. Knowing the dark curse on Defense classes, he appointed Snape as Potions Master and Slytherin Head. Snape, young yet vigilant, stood as a silent guardian, watching over Slytherins, bearing the weight of suspicion and hope intertwined in his quiet resolve.",
    "source_paragraph_index": 24
  },
  {
    "text": "Snape's loyalty lay in shadows, forever haunted by Lily's sacrifice. He hid his true intentions, pretending Voldemort was gone, while secretly safeguarding Harry. Each day as a teacher, Snape fought the darkness within, driven by love and guilt, risking everything to protect a boy he barely knew yet dearly loved.",
    "source_paragraph_index": 25
  },
  {
    "text": "Voldemort’s return was inevitable, but Snape's resolve never wavered. Disguised as a teacher, he carried the weight of secrets and betrayal, knowing his actions kept Harry safe. In the silence of the shadows, Snape endured, driven by a love that refused to die, even as enemies drew closer.",
    "source_paragraph_index": 25
  },
  {
    "text": "Snape’s heart burned with a quiet resolve as Voldemort vanished. At Hogwarts, he poured himself into teaching, stern but passionate. His mastery of potions turned science into art, earning respect from all. Behind his stern facade, a flicker of hope and dedication shone brightly, shaping young minds in the shadows of darkness.",
    "source_paragraph_index": 26
  },
  {
    "text": "Without Voldemort’s shadow, Snape’s true self emerged. In Hogwarts halls, he was strict yet driven, transforming potion brewing into an elegant craft. Respect from colleagues grew, but beneath his stern exterior lay a soul committed to a quiet, unyielding hope—an unspoken battle for a better future.",
    "source_paragraph_index": 26
  },
  {
    "text": "Snape only accepted students with 'Outstanding' O.W.L. marks, believing passion fueled dedication. His bias favored Slytherins, unfairly granting them privileges while dismissing others. His cold demeanor and bullying masked a deeper, conflicted hurt rooted in past losses, making him a feared yet tragic figure at Hogwarts.",
    "source_paragraph_index": 27
  },
  {
    "text": "Snape’s disdain for Neville Longbottom was more than bullying; it was a reflection of his own haunted past. His threats and insults, like threatening Neville’s toad, Trevor, revealed a man scarred by loss and regret. Behind his harshness lay a soul burdened by grief and unspoken remorse.",
    "source_paragraph_index": 27
  },
  {
    "text": "Severus Snape lived in shadows, master of secrets and disguise. Every decision was a gamble, each relationship a fragile mask. His coldness towards Harry Potter was a calculated shield, hiding a world of danger and loyalty behind icy eyes. In this silent war, Snape's every move was a desperate act to protect what truly mattered.",
    "source_paragraph_index": 28
  },
  {
    "text": "Severus Snape knew Voldemort's eyes searched for betrayal. His mind, a fortress of secrets, hid his true intentions. Cold and cautious, Snape played a dangerous game, risking everything to safeguard the future. In his quiet resolve, he bore the weight of a thousand secrets, fighting to shield a world unaware of his sacrifice.",
    "source_paragraph_index": 28
  },
  {
    "text": "Severus Snape secretly shielded Harry, his heart torn between duty and old rivalries. He caused Harry trouble, yet never harm, driven by Lily’s love. Snape’s sacrifices kept Harry safe from Voldemort’s wrath, fueling his silent hope that one day, his pain would serve a greater purpose.",
    "source_paragraph_index": 29
  },
  {
    "text": "At Hogwarts' start, Snape watched new students settle in. When Jacob's younger sibling was sorted into Slytherin, Snape felt a cold suspicion ignite. His eyes lingered, knowing secrets lurked beneath the surface, and trust was a fragile thing in the shadows of his mind.",
    "source_paragraph_index": 30
  },
  {
    "text": "Snape’s first encounter with the new students marked a quiet wariness. When Jacob’s sibling joined Slytherin, Snape’s suspicion deepened. Behind his calm facade, a storm of doubt brewed—trust was fleeting, and secrets hid behind every sorting, fueling his guarded, watchful heart.",
    "source_paragraph_index": 30
  },
  {
    "text": "On his first day teaching, Professor Snape's eyes revealed his disdain for Jacob, while his favoritism for Merula Snyde betrayed a hidden loyalty. His stern voice masked a complex mix of bias and duty, as he struggled to conceal the grudging respect blooming for the talented student he secretly admired.",
    "source_paragraph_index": 31
  },
  {
    "text": "Throughout the year, Professor Snape's calm exterior hid a storm of conflicting feelings. He secretly appreciated Merula Snyde’s talent, even as his words remained cold. His heart wrestled with the shadows of his past, quietly acknowledging the brilliance of a student who symbolized both his past and his hidden allegiance.",
    "source_paragraph_index": 31
  },
  {
    "text": "Jacob's sibling felt a surge of determination as Merula Snyde prepared to attack their friends. With Snape's guidance, they learned to wield spells and potions, trusting in their growing skills. When Snape praised Merula's potion, Jacob's sibling's heart swelled with mixed pride and rivalry, knowing they fought not just for victory but for their place in Snape's respect.",
    "source_paragraph_index": 32
  },
  {
    "text": "Merula Snyde's ambition burned bright as she asked Snape to teach her the Wiggenweld Potion. Jacob's sibling watched, tension tight in their chest, knowing their own skills were being tested. Snape's praise for Merula's potion ignited a flicker of envy and hope within Jacob's sibling, fueling the silent duel between ambition and loyalty.",
    "source_paragraph_index": 32
  },
  {
    "text": "Snape watched as Merula Snyde disarmed Jacob's sibling in the courtyard. Despite Filius Flitwick's concern over who cast the first spell, Snape's eyes remained cold. To Snape, the chaos mattered little—only that the lesson in control was lost, and innocence was at risk. The darkness in Snape's gaze lingered silently.",
    "source_paragraph_index": 33
  },
  {
    "text": "Severus Snape's eyes flickered with quiet fury as he uncovered his colleague's betrayal. His voice was steady but cold, commanding the students to clean up and meet him at the West Tower. In that moment, his sense of justice burned fiercely, determined to punish treachery and uphold his silent code of conduct.",
    "source_paragraph_index": 34
  },
  {
    "text": "Snape's voice echoed with frustration as he demanded Jacob's sibling be expelled, seeing a troublemaker in every corner. Dumbledore's gentle refusal left Snape simmering, regret flickering in his eyes. The moment passed, but Snape's silent disappointment lingered, knowing some mischief could never be fully erased.",
    "source_paragraph_index": 35
  },
  {
    "text": "Snape, stern and resolute, docked points from Jacob's house, but Filch's interruption shattered his plans. With a heavy sigh, Snape ordered the students away, burdened by the weight of unseen dangers lurking in the cursed vaults, his mind haunted by the chaos that demanded his immediate attention.",
    "source_paragraph_index": 35
  },
  {
    "text": "Severus Snape's heart raced when he saw the cursed ice. He knew danger lurked behind that sealed door. With urgency, he ordered Filch to guard it, determined to protect the students from unseen darkness. Snape's resolve was unwavering, even as he sensed the silent threat creeping closer, threatening to unravel everything he fought to keep safe.",
    "source_paragraph_index": 36
  },
  {
    "text": "Severus Snape sensed the students lurking nearby, their curiosity burning. He had sealed away the cursed room, yet he feared their reckless pursuit of secrets. His mind a storm of caution and dread—wishing he could shield them from the darkness he knew too well, even as they silently vowed to uncover its secrets.",
    "source_paragraph_index": 36
  },
  {
    "text": "In Herbicide Potion class, Merula faltered, panic flickering in her eyes. Jacob's sibling stepped in, guiding her through the mistake. Snape's sharp gaze caught their effort, and unexpectedly, he awarded 10 points, a rare moment of recognition that ignited hope amidst the tense classroom. Snape's silent approval spoke volumes.",
    "source_paragraph_index": 37
  },
  {
    "text": "Severus Snape watched over the students with relentless vigilance, especially Jacob's sibling. His efforts to conceal the truth from the school were desperate, yet ultimately failed. The weight of secrecy haunted him, knowing his careful watch could never fully shield the truth from those who sought it.",
    "source_paragraph_index": 38
  },
  {
    "text": "Severus Snape's focus was cruelly drawn to fairy wings for his potions. Jacob's sibling, risking Snape's suspicion, worked desperately to move the fairies. Penny Haywood’s quiet courage shrouded the chaos, trying to help the trapped fairy. Snape remained unaware, his mind tangled in potion secrets, while lives fluttered on the brink of silence.",
    "source_paragraph_index": 39
  },
  {
    "text": "At the Hallowe'en feast, Snape's focus was shattered as Rowan Khanna's distraction gave Jacob's sibling a fleeting chance. Quietly, they stole Aconite from Snape's store, risking everything to help Chiara Lobosca. Snape never saw it coming, his heart heavy with the silent sacrifice made in the shadows.",
    "source_paragraph_index": 40
  },
  {
    "text": "Snape hurriedly used the Fire-Making Spell with Professor McGonagall, risking everything to free Ben Copper from cursed ice. The danger and urgency etched into his face revealed a deep, unspoken care. That moment showed Snape’s hidden compassion, buried beneath layers of sternness and secrets.",
    "source_paragraph_index": 41
  },
  {
    "text": "Snape’s fury erupted when a first-year insulted Harry Potter in class. Without hesitation, Snape hurled a jar of pickled animal parts, his anger masking his protective instincts. Behind his fierce exterior, Snape’s loyalty to Harry burned quietly, unspoken but fiercely felt.",
    "source_paragraph_index": 41
  },
  {
    "text": "Snape's heart clenched as he uncovered potion ingredients in Jacob's sibling's dormitory, hope flickering. He urged them to understand the defenses, fearing the looming threat of the Cursed Vaults. Yet, beneath his guidance, he sensed a deeper treachery—a cruel plot woven by Merula, turning his efforts into a fragile shield of trust and betrayal.",
    "source_paragraph_index": 42
  },
  {
    "text": "In the dim silence of the classroom, Snape revealed the potion secrets he found, desperately trying to arm Jacob's sibling. His eyes betrayed concern, knowing the danger was real. But Merula’s treachery surfaced—an insidious plot—to undermine everything Snape fought for, leaving him haunted by the betrayal lurking behind innocent faces.",
    "source_paragraph_index": 42
  },
  {
    "text": "Snape's eyes hardened as he guarded the secrets of the Cursed Vaults. With quiet authority, he sent Filch to recover Jacob's black quill, knowing its importance. Every move was a silent promise to protect Hogwarts from unseen dangers, even if it meant risking his own peace.",
    "source_paragraph_index": 43
  },
  {
    "text": "Severus Snape warned Jacob's sibling that seeking the Cursed Vaults could cost them everything. Fear gripped them as Voldemort's Boggart appeared, threatening their future. Snape's words echoed, urging them to abandon their dangerous quest before it was too late.",
    "source_paragraph_index": 44
  },
  {
    "text": "Professor Snape’s classroom held a tense challenge for Jacob’s sibling. They brewed an unknown potion, risking failure under Snape’s watchful eye. When they drank it, sickness overtook them, and Snape’s disappointment cut deep, questioning Bill’s skills. The uncertain potion revealed more than they hoped—failure and doubt haunted their attempt.",
    "source_paragraph_index": 45
  },
  {
    "text": "Severus Snape's year darkened as Patricia Rakepick, an old rival and classmate, returned to Hogwarts. Her presence stirred memories of betrayal and the untrustworthy past they shared, casting a shadow over his new beginnings. The past and present collided, leaving Snape feeling the weight of old wounds reopened.",
    "source_paragraph_index": 46
  },
  {
    "text": "Snape sensed the suspicion in Jacob’s sibling during Potions. With quiet urgency, he warned of Madam Rakepick’s danger, revealing her true nature. Despite Dumbledore’s trust, Snape’s words carried weight—warning of shadows lurking behind a trusted face, risking everything for truth in a world full of secrets.",
    "source_paragraph_index": 47
  },
  {
    "text": "Jacob’s sibling confronted Snape, seeking truth about Rakepick. Snape’s voice was steady but guarded, revealing the dark side of the Curse-Breaker. Trust in Dumbledore’s judgment clashed with Snape’s conviction—danger lurked where loyalty was tested, and secrets threatened to unravel their fragile world.",
    "source_paragraph_index": 47
  },
  {
    "text": "Professor Snape's quiet gaze hid a storm as he broke Jacob's sibling's broomstick, seeking their help to uncover Rakepick's dark plans. His words revealed a chilling truth: Rakepick had been spying on her from the moment she arrived at Hogwarts. Trust fractured, Jacob's sibling faced a dangerous choice, haunted by secrets and betrayal.",
    "source_paragraph_index": 48
  },
  {
    "text": "Snape's voice was steady but cold as he confided that Rakepick had been watching Jacob's sibling since day one. Breaking her borrowed broomstick symbolized more than punishment—it was a plea for her to spy, to uncover a lurking menace. Fear and suspicion clouded her heart, torn between loyalty and danger.",
    "source_paragraph_index": 48
  },
  {
    "text": "Severus Snape watched Jacob’s sibling secretly, knowing their spying was pointless as she revealed everything she wished him to know. Despite his warning to keep silent, Snape felt the weight of betrayal and helplessness, sensing the fragile trust slipping through his fingers.",
    "source_paragraph_index": 49
  },
  {
    "text": "Severus Snape, driven by a rare flicker of compassion, handed Jacob’s sibling a deadly Garrotting Gas. When Rakepick’s Cruciatus Curse threatened to break them, Snape’s gift became their salvation, sparing their life and that of Merula. In that moment, his quiet bravery shone through, a silent guardian amid darkness.",
    "source_paragraph_index": 50
  },
  {
    "text": "Snape watched Madam Rakepick claim the Defence Against the Dark Arts title, a sting piercing his pride. His heart sank as another victory slipped away, leaving him haunted by doubt and unspoken longing for recognition. The loss echoed in his silent, restless nights, fueling a quiet resolve to prove himself someday.",
    "source_paragraph_index": 51
  },
  {
    "text": "Severus Snape's year ignited with a fiery hatred for Rakepick, burning brighter than ever. Every thought was consumed by her, fueling a silent storm inside him. The bitterness grew, shadowing his days with relentless fury. Snape clenched his fists, longing for justice, his heart heavy with a mix of rage and despair.",
    "source_paragraph_index": 52
  },
  {
    "text": "Severus Snape felt a bitter storm brewing as the year began. Rakepick's name haunted him, igniting a deep-seated hatred that refused to fade. His mind replayed every slight, every betrayal, fueling an unquenchable fire. Snape’s eyes darkened, carrying the weight of his growing fury and unspoken vengeance.",
    "source_paragraph_index": 52
  },
  {
    "text": "Severus Snape glimpsed the pain behind Penny Haywood’s eyes, remembering Beatrice’s fate. He warned Jacob’s sibling about her fears, knowing her grief might hinder their quest. Snape’s quiet disappointment reminded them that some wounds run deeper than curses, fueling their resolve to break the last dark spell and free those trapped by sorrow.",
    "source_paragraph_index": 53
  },
  {
    "text": "Severus Snape’s gaze held a flicker of regret as he revealed his disdain for the Marauders and his disappointment in Jacob’s allies. His words weighed heavy, hinting at past disillusionments. Yet, his warning about Penny Haywood’s anguish ignited a renewed determination in Jacob’s sibling to confront the curses and restore hope.",
    "source_paragraph_index": 53
  },
  {
    "text": "Severus Snape, under Dumbledore's orders, trained Jacob's sibling in Legilimency and Occlumency. With a piercing gaze, he challenged them to defend their mind, revealing secrets and testing their resolve. Snape’s unwavering presence proved to Jacob's sibling the true strength of their own mental defenses, igniting a quiet but fierce determination within.",
    "source_paragraph_index": 54
  },
  {
    "text": "Jacob’s sibling poured their heart into creating a dazzling spell, seeking Merula and Professor Snape’s guidance. When Professor Flitwick praised it, Snape recognized the mistake—this wasn’t the Star Shower Charm but the Star Shimming Charm. With quiet resolve, Snape helped fix the error, igniting a flicker of hope in Jacob’s sibling’s eyes.",
    "source_paragraph_index": 55
  },
  {
    "text": "In a moment of doubt, Jacob’s sibling turned to Snape, who saw beyond the flaw. Snape’s steady hand and silent support transformed disappointment into determination, reminding Jacob’s sibling that even mistakes can shine if guided by the right mentor.",
    "source_paragraph_index": 55
  },
  {
    "text": "Snape's eyes flickered with concern as he approached Poppy Pomfrey and Dumbledore. They hurried into the vault, knowing Merula Snyde’s fate hung in the balance after Rakepick’s treachery. Snape felt a pang of helplessness, longing to protect her from the darkness threatening to consume her.",
    "source_paragraph_index": 56
  },
  {
    "text": "Madam Rakepick's eyes burned with determination as she unleashed Lacarnum Inflamari onto Snape's cloak. The flames flickered fiercely, a symbol of her relentless pursuit. Snape watched in silent resilience, feeling the sting of betrayal and the fire of defiance within him.",
    "source_paragraph_index": 57
  },
  {
    "text": "Snape's sharp nose detected rats in the Great Hall, warning Jacob's sibling and friends to keep their creatures away. As chaos unfolded, Snape's calm voice guided them to brew a calming potion. When Percy returned with Scabbers, Jacob's sibling finally saw the terrifying truth: the rat's fear was rooted in Snape himself, their silent enemy.",
    "source_paragraph_index": 58
  },
  {
    "text": "Severus Snape watched Madam Rakepick leave, betrayal etched deep in his mind. The enemy who once haunted his past was gone, replaced by a fragile hope. Yet, beneath the relief, a shadow of mistrust lingered, reminding Snape that enemies could be vanquished but never truly forgotten.",
    "source_paragraph_index": 59
  },
  {
    "text": "Severus Snape felt a rare flicker of relief as Madam Rakepick was dismissed. Her betrayal had haunted him, a scar that refused to fade. Now, with her gone, a bittersweet hope blossomed—perhaps peace was finally within reach, yet the wounds of betrayal still echoed in his silent heart.",
    "source_paragraph_index": 59
  },
  {
    "text": "Severus Snape's heart sank as Beatrice Haywood revealed a petrified student. The curse's texture echoed the Merpeople's Trident, a sinister sign of danger. Snape's mind raced, knowing this darkness threatened Hogwarts itself. His silent resolve grew—protecting the students was his only hope against the creeping shadow.",
    "source_paragraph_index": 60
  },
  {
    "text": "Severus Snape met with Dumbledore, their whispers heavy with worry over the statue curse. Snape's eyes flickered with determination and fear; Hogwarts was under attack. In that quiet moment, Snape vowed to uncover the curse’s mystery, knowing lives depended on his every move.",
    "source_paragraph_index": 60
  },
  {
    "text": "Severus Snape carefully took the cursed items from Argus Filch, his heart heavy with the weight of dark magic. He knew these relics held pain, yet he hoped Dumbledore could undo what was broken. Snape’s resolve was shaken, knowing the curses might never be lifted, but his duty remained unwavering.",
    "source_paragraph_index": 61
  },
  {
    "text": "When Jacob's sibling and Merula Snyde found Snape brewing Veritaserum, he looked tired and defeated. He confessed he couldn't break the curses and entrusted the dangerous artifacts to Dumbledore, trusting the headmaster's wisdom. Snape’s silent burden pressed down, a reminder of his quiet sacrifice.",
    "source_paragraph_index": 61
  },
  {
    "text": "Severus Snape was forced to find Jacob's sibling when Madam Pomfrey was petrified. With no healer, Snape bore the weight of caring for sick students, feeling the pressure of helplessness. His stern face hid a storm of concern as he prepared the Cough Potion, knowing lives depended on his quiet, steadfast resolve.",
    "source_paragraph_index": 62
  },
  {
    "text": "Severus Snape faced chaos when Madam Pomfrey was turned to stone. With no healer, he became the reluctant guardian of frightened students, teaching remedies like the Cough Potion. Behind his cold exterior, a flicker of compassion shone as he fought to protect them amid the silent dread.",
    "source_paragraph_index": 62
  },
  {
    "text": "Snape met Alanza Alves, a Brazilian exchange student, amid a tense classroom moment. As Snape discussed missing magical eggs, Alanza warned him her potions often exploded. Despite the chaos, Snape’s stern eyes held a flicker of curiosity, sensing the storm of talent and trouble within her. Their worlds collided in fiery anticipation.",
    "source_paragraph_index": 63
  },
  {
    "text": "Snape was caught between two worlds—his classroom and a request from Jacob's sibling. As Arif Sikander discussed Muggle chemistry, Snape impatiently handed over Floo powder, dismissing them with cold indifference. His heart remained distant, unmoved by their need, as he prioritized his own disdain over their urgent plea.",
    "source_paragraph_index": 64
  },
  {
    "text": "In Snape's classroom, Jacob's sibling begged for Floo powder to reach the Ministry. Snape, absorbed in dismissive talk with Sikander, handed over the powder with a harsh word. Cold and detached, Snape's unfeeling act left no room for empathy in that fleeting moment.",
    "source_paragraph_index": 64
  },
  {
    "text": "Severus Snape poured his knowledge into seventh-years, guiding them through the perilous Wolfsbane Potion. His quiet dedication was fueled by a deeper purpose—helping the Ministry find a dangerous fugitive. In those moments, Snape's resolve shone, blending teaching with a silent hope for justice and safety.",
    "source_paragraph_index": 65
  },
  {
    "text": "When no other options arose, Severus Snape taught seventh-years how to brew Wolfsbane, knowing it was more than a lesson—it was a shield. His silent commitment helped the Ministry chase a dangerous werewolf, embodying a quiet courage that defined him beyond the classroom.",
    "source_paragraph_index": 65
  },
  {
    "text": "Severus Snape studied Xeep's Luscious Locks Solution, realizing its true danger. He saw how it stole memories, threatening Jacob's sibling and Penny Haywood. Determined to help, Snape vowed to develop a counter-serum, knowing lives depended on his knowledge and courage to undo the potion's devastating effects.",
    "source_paragraph_index": 66
  },
  {
    "text": "Snape uncovered the sinister truth behind Xeep's Luscious Locks Solution—a potion that erased memories. With quiet resolve, he committed himself to craft a cure, knowing Penny Haywood and Jacob’s sibling depended on his mastery to reclaim what was lost, igniting a flicker of hope in the shadows of danger.",
    "source_paragraph_index": 66
  },
  {
    "text": "Snape carefully examined the pitcher of Pumpkin juice, searching for clues that might explain the laughing curse. His brow furrowed as he found no traces of the Alihotsy Draught, leaving Jacob’s sibling disappointed. Snape’s quiet determination hid the weight of his failure, knowing the truth could have brought relief but instead deepened their despair.",
    "source_paragraph_index": 67
  },
  {
    "text": "Snape felt a surge of pride as he crafted a Potion riddle to guard the Philosopher's Stone. His logic became a silent shield, protecting Nicolas Flamel’s secret from those who would misuse it. In that moment, Snape’s quiet genius became a fortress of hope and trust at Hogwarts.",
    "source_paragraph_index": 68
  },
  {
    "text": "When the Philosopher's Stone was moved to Hogwarts, Snape's mind raced with fears and purpose. He added a Potion riddle, a test of wit and will, to safeguard Flamel’s secret. Snape’s quiet sacrifice carved a line between chaos and salvation, silent but unwavering.",
    "source_paragraph_index": 68
  },
  {
    "text": "Snape's eyes flicked with disdain as Harry entered his class, a mirror of his father igniting a fierce rivalry. Despite his vow to Dumbledore to protect Harry, Snape's bias for Slytherin cast a shadow, making Harry's lessons a battlefield of unspoken resentment and cold detachment.",
    "source_paragraph_index": 69
  },
  {
    "text": "Every glance between Snape and Harry burned with hostility. Snape, haunted by his past and prejudice, refused Harry kindness, turning his protection into a bitter struggle. The boy's presence stirred a storm of animosity, revealing Snape's deepest biases and unresolved fury.",
    "source_paragraph_index": 69
  },
  {
    "text": "Snape's unwavering vow to Dumbledore drove him to thwart Quirrell's dark plans. When Voldemort’s pawn unleashed chaos with a mountain troll, Snape seized the moment, risking everything to protect the Stone. A bite from Fluffy marked his sacrifice, yet his resolve remained unbroken—protecting Hogwarts from shadows he alone understood.",
    "source_paragraph_index": 70
  },
  {
    "text": "Snape's quick magic saved Harry during a dangerous Quidditch match, but Hermione's sharp eyes misjudged him. Her fiery distraction caused Quirrell to stumble, unintentionally thwarting a deadly curse. Snape watched silently, burdened yet relieved, knowing he had protected Harry in a silent, unseen battle.",
    "source_paragraph_index": 71
  },
  {
    "text": "Snape, driven by a desire for justice, took it upon himself to referee the next match. His intentions were pure, but others saw only suspicion. The teachers doubted his motives, whispering that Snape sought to sabotage Gryffindor’s victory, unaware of his quiet hope to prevent further harm and protect the game he loved.",
    "source_paragraph_index": 72
  },
  {
    "text": "Snape faced Quirrell in the Forbidden Forest, voice fierce, demanding the truth about the Philosopher's Stone. Harry watched from above, heart pounding, sensing a deadly game. Snape's eyes burned with urgency, as if risking everything to uncover secrets that could change their fates forever.",
    "source_paragraph_index": 73
  },
  {
    "text": "In the shadows of the forest, Snape’s confrontation with Quirrell felt like a battle of wills. Harry, hidden above, felt the weight of suspicion and danger. Snape’s intense stare hinted at hidden motives, as the night held its breath, threatening to reveal or hide secrets that could destroy them all.",
    "source_paragraph_index": 73
  },
  {
    "text": "Severus Snape watched as Harry, Ron, and Hermione fought to protect Quirrell, their unwavering support shining through every kind word and defiant glare. Snape saw innocence in their actions, a rare warmth that challenged his cold exterior. It was a fleeting glimpse of hope amidst the shadows of prejudice.",
    "source_paragraph_index": 74
  },
  {
    "text": "At the Leaving Feast, Snape's face flickered with pride as Slytherin claimed the House Cup. Yet, when Dumbledore awarded points to Harry's friends, Snape's smile faltered. Despite his pride for Slytherin, he couldn't hide the ache of Gryffindor's triumph, forcing himself to shake McGonagall’s hand with a strained, hollow smile.",
    "source_paragraph_index": 75
  },
  {
    "text": "Snape watched Slytherin celebrate, a rare glow of satisfaction in his eyes. But as Dumbledore’s points shifted the victory away, Snape’s expression hardened. Forced to congratulate Gryffindor, Snape’s pride was overshadowed by a quiet, bitter disappointment, a reminder that loyalty and victory often clashed with personal longing.",
    "source_paragraph_index": 75
  },
  {
    "text": "In 1992, Snape learned Harry and Ron risked everything by flying to Hogwarts. Confronting them, Snape's anger burned fiercely, warning them of the danger they faced. Though Dumbledore spared them expulsion, Snape's stern punishment left Harry feeling the weight of his choices and Snape’s unyielding vigilance.",
    "source_paragraph_index": 76
  },
  {
    "text": "Snape discovered Harry and Ron’s reckless flight, his voice cold with fury. He scolded them harshly, pretending to call for higher powers, knowing their fate hung in balance. Though Dumbledore’s mercy spared them, Snape’s stern glare etched a lasting reminder of the risks they dared to take.",
    "source_paragraph_index": 76
  },
  {
    "text": "Snape, haunted by Lily's memory, felt the punishment was too kind. His anger fueled a cruel act—allowing Slytherins to dominate the Quidditch pitch, training Draco Malfoy as their Seeker. His love for Lily twisted into a bitter retaliation, blinding him to mercy.",
    "source_paragraph_index": 77
  },
  {
    "text": "Snape’s trust was shattered when Harry, Ron, and Hermione stole Polyjuice ingredients from his cabinet. Their distraction, a fiery chaos in his classroom, masked their daring theft—an act born from defiance, igniting Snape’s simmering fury and helplessness.",
    "source_paragraph_index": 77
  },
  {
    "text": "Snape's fury burned as he realized Harry's role in the chaos. His piercing gaze revealed he knew, perhaps through Legilimency. Yet, duty held him back. Despite his anger, Snape's love for Lily's son overshadowed revenge, forcing him to release Harry, fearing the cost of losing control—protecting Harry was more vital than justice.",
    "source_paragraph_index": 78
  },
  {
    "text": "Snape's eyes simmered with rage as Lockhart's foolishness threatened his passion. When Lockhart mocked the Duelling Club, Snape's Disarming Charm sent him crashing against the wall. Snape’s fury burned fiercely, a silent promise to protect what he loved, leaving Lockhart trembling, finally silenced by Snape’s deadly quiet wrath.",
    "source_paragraph_index": 79
  },
  {
    "text": "Snape's patience snapped as Lockhart's arrogance mocked his cherished subject. With a swift spell, Snape hurled Lockhart against the wall, his anger boiling over. Lockhart, once confident, now trembled under Snape's murderous glare, finally understanding the depth of Snape’s unyielding devotion and simmering fury.",
    "source_paragraph_index": 79
  },
  {
    "text": "Snape watched Harry and Draco's duel with a cold, calculating eye. When Harry's Parseltongue revealed a dangerous snake, Snape swiftly intervened, vanishing the threat. Relief washed over him as Harry was led away, but suspicion lingered in Snape's gaze—protecting secrets that could change everything.",
    "source_paragraph_index": 80
  },
  {
    "text": "On Valentine's Day, Snape's dread deepened as Lockhart's party erupted. Lockhart's innocent cheer turned sinister when he urged students to make Love Potions. Snape's eyes burned with fury, warning that no one would force him to poison. The chaos of Cupids distracted Snape from his lessons, fueling his silent, simmering anger.",
    "source_paragraph_index": 81
  },
  {
    "text": "Snape's fury erupted when Lockhart intruded during Ginny’s kidnapping. Despite his disdain for Gryffindor, Snape's concern for her outweighed hatred. He forcefully pushed Lockhart aside, leading teachers to safety, driven by a fierce protectiveness that overshadowed his bitterness.",
    "source_paragraph_index": 82
  },
  {
    "text": "Snape’s resolve shone as he brewed the Mandrake Restorative Draught, risking his reputation to heal those petrified by Slytherin’s monster. His actions revealed a deep, unspoken compassion beneath his cold exterior, fighting to save his students.",
    "source_paragraph_index": 82
  },
  {
    "text": "Snape's quiet teaching ignited hope in Harry. Recalling the Polyjuice Potion, Harry felt a spark of confidence. In the Duelling Club, Snape's Disarming Charm became Harry’s shield, transforming fear into courage. Snape’s lessons, subtle yet powerful, guided Harry toward victory when it mattered most.",
    "source_paragraph_index": 83
  },
  {
    "text": "Snape poured his soul into brewing the Wolfsbane Potion, knowing it could save Lupin’s life. His skill and quiet dedication shone through, even amid suspicion and danger. For a moment, Snape’s focus was pure, his purpose clear — to protect, to serve, despite the shadows that lingered around him.",
    "source_paragraph_index": 84
  },
  {
    "text": "Snape’s eyes narrowed as he suspected Lupin’s secrets. Memories of Sirius’s cruel joke haunted him, but James’s quick intervention saved Snape from danger. In that moment, Snape felt both betrayed and grateful—caught between suspicion and the fragile hope that loyalty still existed.",
    "source_paragraph_index": 84
  },
  {
    "text": "Snape's eyes burned with betrayal as he emerged from under the cloak, capturing Remus and confronting Harry and Hermione. His voice trembled with fury and sorrow, convinced Sirius had betrayed Lily. In that moment, Snape's loyalty and pain clashed, driving him to threaten Sirius and Remus with the cold silence of Azkaban.",
    "source_paragraph_index": 85
  },
  {
    "text": "Under the shadow of the Whomping Willow, Snape's desperation overtook him. He tied up Remus, eyes blazing with betrayal and grief. Convinced Sirius betrayed Lily, Snape's voice echoed with anger as he sought to send his enemies to the unforgiving darkness of Azkaban, haunted by his own fractured loyalty.",
    "source_paragraph_index": 85
  },
  {
    "text": "Snape's anger boiled as Harry, Ron, and Hermione struck him down, their spell knocking him unconscious. His heart ached with betrayal, knowing their actions could endanger all. That day, he felt the weight of helplessness and bitter disappointment, helpless to stop the chaos they unleashed.",
    "source_paragraph_index": 86
  },
  {
    "text": "On the final day, Snape’s voice trembled with sorrow as he exposed Lupin’s curse. The revelation shattered lives, forcing Lupin to resign. Snape’s eyes revealed silent regret, haunted by the painful truth he couldn’t undo, burdened by the tragic consequences of secrets kept and truths revealed.",
    "source_paragraph_index": 86
  },
  {
    "text": "Snape's rage boiled over as Harry's name emerged from the Goblet of Fire. Trust shattered, Snape believed Harry deliberately entered, fueling his suspicion that Harry had stolen ingredients to cheat in the dangerous tournament. The betrayal stained Snape's heart, turning his suspicion into relentless hostility.",
    "source_paragraph_index": 87
  },
  {
    "text": "Snape watched Harry with cold eyes, convinced of Harry's deceit. The shock of the Goblet’s choice ignited a deep-seated fury in Snape, who refused to see innocence. To Snape, Harry was a threat, a cheater, and an enemy, fueling a silent war of mistrust and suspicion.",
    "source_paragraph_index": 87
  },
  {
    "text": "Snape's past haunted him as a Death Eater, blackening his soul. Dumbledore’s trust became a fragile shield, whispering that Snape truly changed. Harry’s heart wrestled with doubt, unsure if Snape’s loyalty was real or just another mask. Beneath the surface, Snape carried the weight of betrayal and redemption intertwined forever.",
    "source_paragraph_index": 88
  },
  {
    "text": "Snape once walked the dark path of Voldemort's followers, his choices shadowed by darkness. Dumbledore’s faith in him was a fragile beacon, promising redemption. Harry saw only mystery, sensing the pain behind Snape’s guarded eyes, a man torn between past sins and a desperate hope for salvation.",
    "source_paragraph_index": 88
  },
  {
    "text": "Snape felt the sting of suspicion as Moody's accusations led to a search of his office. Resentment burned within him, knowing the truth—Moody was an impostor, sneaking and stealing. Despite his pain, Snape endured in silence, guarding his secrets and dignity against those who doubted his integrity.",
    "source_paragraph_index": 89
  },
  {
    "text": "Snape's quiet fury simmered beneath his calm exterior when Moody raided his office. The betrayal cut deep; Moody was an impostor stealing his ingredients. Snape's resolve strengthened—he would protect his secrets, even if it meant enduring false accusations and betrayal from those who doubted him.",
    "source_paragraph_index": 89
  },
  {
    "text": "Snape watched as Voldemort's mark grew darker, a silent warning of impending doom. Karkaroff's frantic fears echoed in his ears, but Snape remained cold, unmoved. When Voldemort returned, Snape’s loyalty shone through—he had been waiting, silent and patient, for the dark master’s rise, ready to serve once more.",
    "source_paragraph_index": 90
  },
  {
    "text": "Karkaroff's fear gripped him as Voldemort's shadow lengthened. Snape saw the chaos but stayed detached, his allegiance clear. When Voldemort finally returned, Snape’s calm facade betrayed nothing—he had long been prepared for this moment, secretly aligned with darkness, waiting for his master’s reinforcements.",
    "source_paragraph_index": 90
  },
  {
    "text": "Barty Crouch Jnr, disguised as Moody, desperately questioned Harry about Voldemort's plans. Just as secrets threatened to spill, Dumbledore, McGonagall, and Snape intervened, saving Harry. Crouch Jnr's cover was shattered, revealing a man haunted by his own darkness and the sinister resurrection plot he had helped orchestrate.",
    "source_paragraph_index": 91
  },
  {
    "text": "Under Snape's Veritaserum, Crouch Jnr's facade crumbled. He confessed Voldemort’s dark resurrection and his role in Harry’s peril, revealing a man lost in the shadows. The truth spilled out, leaving Harry and his allies haunted by the depth of Crouch Jnr’s betrayal and the looming terror of Voldemort’s return.",
    "source_paragraph_index": 91
  },
  {
    "text": "Snape's heart clenched as Dumbledore revealed Sirius’s innocence, forcing Snape to shake hands with a man he once despised. The betrayal cut deep, yet purpose fueled his resolve. Disguised as a Death Eater, Snape walked into darkness, haunted by the weight of secrets and the fragile hope of saving them all.",
    "source_paragraph_index": 92
  },
  {
    "text": "Dumbledore's trust turned Snape into a double agent, torn between loyalty and deception. As Snape rejoined Voldemort's ranks, he carried the burden of betrayal, knowing his true allegiance could cost him everything. Shadows swallowed him, yet his eyes burned with the silent vow to protect from within.",
    "source_paragraph_index": 92
  },
  {
    "text": "In 1996, Snape's loyalty burned fiercely as he risked everything for Dumbledore. At Grimmauld Place, he silently relayed secrets, his eyes cold with purpose. Snape’s words sting Sirius, mocking his exile—each act a silent testament to his tortured allegiance and unspoken pain.",
    "source_paragraph_index": 93
  },
  {
    "text": "Snape's loyalty to the Order couldn't soften his disdain for Harry. Each lesson in Occlumency was a tense battle, a fragile dance of secrets and suspicion. Snape feared Voldemort might glimpse Harry's mind, revealing his own hidden resistance. Their hostility simmered, making trust impossible, yet Snape's silent resolve guarded Harry from unseen dangers.",
    "source_paragraph_index": 94
  },
  {
    "text": "Snape's eyes darkened as Harry glimpsed a painful memory of James bullying him. Snape's grip tightened, and he forcibly expelled Harry, his fury burning bright. From that moment, Snape's contempt grew, coldly ignoring Harry, haunted by wounds no one could see.",
    "source_paragraph_index": 95
  },
  {
    "text": "Snape remembered the sting of James's cruelty, a memory Harry unwittingly uncovered. Snape's wrath erupted, forcing Harry out and branding him as unwelcome. For the rest of the semester, Snape's cold indifference felt like a punishment Harry could never outrun.",
    "source_paragraph_index": 95
  },
  {
    "text": "Dolores Umbridge cornered Harry, demanding Dumbledore's secrets. Snape, tense and guarded, claimed his Veritaserum was gone, though doubt clouded his eyes. His silence betrayed a deeper loyalty, as he chose to withhold aid, leaving Harry vulnerable under the weight of unspoken truths. Snape’s quiet defiance echoed in the shadows of the room.",
    "source_paragraph_index": 96
  },
  {
    "text": "Severus Snape secretly gave Umbridge a fake potion, masking his true intentions. When Harry warned about Sirius, Snape acted swiftly, rallying the Order while searching for Harry in the Forbidden Forest. Despite his efforts, Harry's distrust remained, haunted by the belief that Snape's words pushed Sirius into danger.",
    "source_paragraph_index": 97
  },
  {
    "text": "Dumbledore’s life was slipping away from the curse on Marvolo Gaunt's ring. Severus Snape knew the darkness threatening his mentor. When Dumbledore begged him to end his suffering, Snape’s heart ached—saving Dumbledore meant sacrificing his own soul, a heavy burden that haunted him forever.",
    "source_paragraph_index": 98
  },
  {
    "text": "Severus Snape hesitated, fearing the toll on his soul. Dumbledore assured him this act would not destroy him like murder. With a heavy heart, Snape committed the deed, knowing trust with Voldemort awaited. His sacrifice was silent, driven by a desperate hope to uncover the dark secrets lurking behind evil’s mask.",
    "source_paragraph_index": 99
  },
  {
    "text": "Snape's soul trembled as he prepared to betray Voldemort, guided by Dumbledore’s words. Trust would come at a price—an act of mercy cloaked in darkness. With quiet resolve, Snape executed the plan, threading a dangerous path that could save or shatter him forever.",
    "source_paragraph_index": 99
  },
  {
    "text": "Narcissa begged Snape to protect her son Draco, swearing an Unbreakable Vow. Snape’s face was a mask of resolve as he promised to shield Draco at all costs, risking death if he failed. His loyalty was a silent, heavy burden, forged in shadows and sealed with blood, a silent vow to save a boy caught in darkness.",
    "source_paragraph_index": 100
  },
  {
    "text": "Bellatrix accused Snape of allegiance to Voldemort. Snape admitted his true loyalty, revealing years of secret service. Beneath his calm exterior, he carried the weight of betrayal and sacrifice, knowing his actions kept him free, yet forever bound to a dangerous game between light and dark.",
    "source_paragraph_index": 100
  },
  {
    "text": "Snape's long-awaited dream came true at Hogwarts. As Defense Against the Dark Arts professor, he taught with fiery passion, yearning to undo his past biases. His eyes softened for Hermione and he held Crabbe and Goyle accountable, revealing a flicker of fairness in a man shaped by shadows. Snape's true strength was finally shining through.",
    "source_paragraph_index": 101
  },
  {
    "text": "Severus Snape watched Harry excel in potions, shadows of doubt flickering in his eyes. He wondered how Harry had learned so much, feeling a sting of loss and suspicion. Snape’s silent pride was tinged with unease, knowing that Harry’s sudden mastery challenged everything he believed about his own teaching and his past.",
    "source_paragraph_index": 102
  },
  {
    "text": "Severus Snape's heart clenched as Harry’s skills soared, aided by a mysterious book. He fought the urge to confront Harry, feeling betrayed and confused. Snape’s suspicion grew, fearing secrets hidden in the margins, and questioning if Harry had truly learned on his own or if something darker was at play.",
    "source_paragraph_index": 102
  },
  {
    "text": "Snape confronted Dumbledore at the forest's edge, anger burning. Overhearing the secret lessons between Dumbledore and Harry, Snape felt betrayed and unworthy, his love for Lily still alive beneath layers of resentment. When Dumbledore asked him to protect Draco, Snape's heart ached with unspoken loyalty, his true feelings hidden behind a mask of duty.",
    "source_paragraph_index": 103
  },
  {
    "text": "In Dumbledore's office, Snape's world shattered. Learning Harry must die ignited a fierce outrage. As he revealed his true love for Lily through his Patronus—a gentle doe—Snape’s pain and devotion surfaced, a silent testament to a love that endured beyond betrayal, forever etched in the shimmer of a fragile, glowing form.",
    "source_paragraph_index": 103
  },
  {
    "text": "Snape watched helplessly as Harry's spell sliced through Draco's face and chest. Rushing to heal the wounds, Snape's eyes burned with anger and concern. He demanded answers, but Harry refused. Snape's voice was cold, demanding Harry to surrender all his books, knowing secrets lay hidden within. The pain of betrayal haunted him.",
    "source_paragraph_index": 104
  },
  {
    "text": "In the chaos of Harry's curse, Snape's immediate instinct was to save Draco, healing his wounds with urgent precision. But behind his calm, Snape's mind raced—seeking the truth. When Harry hid his own book, Snape's face darkened with disappointment, knowing dangerous secrets were at play and trust was slipping away.",
    "source_paragraph_index": 104
  },
  {
    "text": "Snape's punishment for Harry was relentless, a detention every Saturday that haunted him through the final Quidditch match. Snape's fear of revealing Harry's secret kept him from harsher punishment, sparing Harry from worse consequences. Professor McGonagall saw Harry's luck, unaware of the quiet sacrifices Snape made to protect him.",
    "source_paragraph_index": 105
  },
  {
    "text": "Severus Snape overheard the prophecy, revealing Harry's fate to Voldemort. This betrayal set chaos in motion, endangering Harry and his parents. Dumbledore's unwavering trust in Snape haunted Harry, who grappled with anger and doubt as they ascended to the Astronomy Tower, seeking answers in a world skewed by secrets.",
    "source_paragraph_index": 106
  },
  {
    "text": "Severus Snape's secret heard by Voldemort ignited a deadly hunt for Harry. Dumbledore's faith in Snape conflicted with Harry's fury, deepening the pain. As they soared to the Astronomy Tower, Harry felt the weight of betrayal, questioning whether trust could survive amidst such darkness.",
    "source_paragraph_index": 106
  },
  {
    "text": "Snape stood in the chaos, his heart heavy as Draco hesitated. Voldemort’s potion had drained him, yet he found the strength to end Dumbledore’s suffering. In that moment, Snape’s sacrifice sealed his fate, a silent act of love and loyalty amid the darkness.",
    "source_paragraph_index": 107
  },
  {
    "text": "Amidst the chaos of attack, Snape faced a terrible choice. Draco faltered, unable to kill Dumbledore. Snape’s resolve hardened; he stepped forward, ending the headmaster’s life. It was a heartbreaking act, born of duty and sacrifice in a world torn apart.",
    "source_paragraph_index": 107
  },
  {
    "text": "Severus Snape faced Harry's fury, his calm mask cracking as Harry's accusations ignited a fiery rage. Despite Harry’s relentless attacks, Snape remained composed, yet the insult of cowardice shattered his restraint. A flash of dark magic shot Harry to the ground, revealing the storm behind Snape’s composed exterior and the pain of unspoken sacrifice.",
    "source_paragraph_index": 108
  },
  {
    "text": "Severus Snape watched Harry, immobilized and helpless, as anger overtook him. Harry's accusations of cowardice pierced Snape deeply, igniting a fierce retaliation. In a burst of magic, Snape struck back, sending Harry sprawling. Behind his cold glare lay a tumult of pain, fury, and unspoken loyalty, buried beneath layers of secrecy and sacrifice.",
    "source_paragraph_index": 108
  },
  {
    "text": "Severus Snape, torn between worlds, revealed his true bloodline as the Half-Blood Prince. His past, a blend of Muggle and pure-blood, defined him. As Harry watched helplessly, Snape disappeared through the gates, leaving behind a legacy of secrets and silent sacrifice.",
    "source_paragraph_index": 109
  },
  {
    "text": "Snape, haunted by his past, betrayed Dumbledore and rejoined the Death Eaters. The weight of his choices pressed down as he watched Harry, unaware of the dangerous game he's been played. His loyalty was a fragile mask, hiding a soul torn between darkness and fleeting hope.",
    "source_paragraph_index": 110
  },
  {
    "text": "In 1997, Snape secretly warned Voldemort about Harry’s departure, ensuring his place in the shadows. Beneath the calm exterior, Snape's heart ached with the burden of deception, forever caught between allegiance and the desire to protect from within the darkness.",
    "source_paragraph_index": 110
  },
  {
    "text": "Snape whispered a clever ploy to Mundungus Fletcher, planting seven Harry decoys to mislead the Death Eaters. Beneath his calm exterior, Snape’s mind was a battlefield of secrets, ensuring the real Harry remained safe. His sacrifice masked in shadows, Snape’s loyalty concealed behind a web of deception.",
    "source_paragraph_index": 111
  },
  {
    "text": "Snape tricked Mundungus Fletcher into believing there were multiple Harrys. As the Death Eaters closed in, Snape’s quiet sacrifice protected the boy he secretly loved. Confunding Fletcher, Snape erased his own role, forever hiding his true loyalty behind layers of deception and sacrifice.",
    "source_paragraph_index": 111
  },
  {
    "text": "Severus Snape's secret knowledge betrayed him; during the chaos of Harry's rescue, Death Eaters ambushed. In the frenzied fight, Snape's spell went awry, severing George Weasley's ear. His actions, born of duty and danger, haunted him as lives were forever changed in that deadly, heartbreaking battle.",
    "source_paragraph_index": 112
  },
  {
    "text": "Severus Snape watched helplessly as chaos erupted around him during Harry's escape. His aim faltered, and Sectumsempra sliced through George Weasley's ear. In that moment, Snape felt the weight of unintended harm, knowing his actions in the deadly battle would forever echo in their shattered lives.",
    "source_paragraph_index": 112
  },
  {
    "text": "Severus Snape entered Sirius Black's abandoned room, clutching Lily Potter's letter. Her loving signature and words haunted him, torn from their original home. He also seized a cherished picture of Lily and James, holding onto memories that both comforted and haunted him forever.",
    "source_paragraph_index": 113
  },
  {
    "text": "In the silence of Grimmauld Place, Severus Snape found Lily Potter's letter and a photograph of her family. With trembling hands, he took what he cherished, carrying her love and memory as both solace and burden in his lonely, haunted heart.",
    "source_paragraph_index": 113
  },
  {
    "text": "Snape became Headmaster of Hogwarts, a heavy cloak of responsibility. Amid chaos, he secretly protected the students and restrained the cruel Carrows. His quiet vigilance was fueled by whispers from Dumbledore’s portrait, a guiding light in the darkness. Snape’s sacrifice was silent but unwavering.",
    "source_paragraph_index": 114
  },
  {
    "text": "As Headmaster, Snape bore a secret burden—shielding students from chaos while navigating the treacherous Carrows. He sought counsel from Dumbledore’s portrait, clinging to hope. Each discreet act of protection defined his silent, noble struggle beneath the weight of his hidden allegiance.",
    "source_paragraph_index": 114
  },
  {
    "text": "Snape watched as Scrimgeour, eager for Dumbledore's secrets, lifted the fake Sword of Gryffindor. Snape's heart sank, knowing the true sword was hidden behind Dumbledore’s portrait, safe from prying eyes. The deception cut deep, a reminder of secrets buried in shadows, forever out of reach.",
    "source_paragraph_index": 115
  },
  {
    "text": "Snape felt a cold realization. Scrimgeour's hands found only a fake sword, not the true power hidden behind Dumbledore’s portrait. The real sword was lost in secrecy, a silent guardian in a hidden hole—concealed, protected, forever beyond reach for those who sought it.",
    "source_paragraph_index": 115
  },
  {
    "text": "Snape watched Luna Lovegood, Neville Longbottom, and Ginny Weasley as they faced punishment in the Forbidden Forest. His heart sank when he handed the fake sword to Bellatrix Lestrange, unaware she believed it was real. Snape's silent regret haunted him as danger lurked in the shadows, the truth lost in deception.",
    "source_paragraph_index": 116
  },
  {
    "text": "Snape’s quiet betrayal sealed a dangerous lie. He handed the counterfeit sword to Bellatrix Lestrange, trusting her to keep it hidden. Meanwhile, Luna, Neville, and Ginny’s effort to protect what was real felt futile, as Snape’s secret ensured chaos would follow in the darkness of his choices.",
    "source_paragraph_index": 116
  },
  {
    "text": "Snape's heart clenched as Dumbledore’s portrait whispered Harry’s location. He knew giving Harry the sword would be dangerous, especially after his past betrayals. Snape’s resolve was to protect Harry from Voldemort’s gaze, even if it meant risking his own redemption in silence.",
    "source_paragraph_index": 117
  },
  {
    "text": "Severus Snape hid the sword beneath the icy water, guiding Harry with his Patronus to safety. After rescuing Harry from drowning, Snape watched from the shadows, silent and watchful. His quiet presence haunted the edges of Harry’s world, always alert, always caring, even when unseen.",
    "source_paragraph_index": 118
  },
  {
    "text": "Severus Snape’s eyes lingered in the darkness as Harry was saved. Though he vanished into the shadows, his unwavering vigilance proved his silent devotion. Snape’s sacrifice was invisible to many, but Harry felt it in every quiet moment of safety, knowing Snape’s watchful heart never truly left him.",
    "source_paragraph_index": 118
  },
  {
    "text": "Snape faced hostility as headmaster, yet secretly he protected students like Neville, Luna, and Ginny. When Voldemort’s darkness threatened Hogwarts, Snape’s quiet defiance shone through. He sent students to aid Hagrid, risking his own safety to keep hope alive amid chaos and cruelty.",
    "source_paragraph_index": 119
  },
  {
    "text": "Severus Snape rarely appeared, his presence felt in the quiet, watchful shadows. Whether guarding the trio or hidden in his office, his silent vigilance was a shield. Behind the scenes, he orchestrated order, even as students marched like soldiers, unaware of the quiet protector watching over them.",
    "source_paragraph_index": 120
  },
  {
    "text": "Severus Snape's absence was a mask for his relentless dedication. Often in solitude, he tracked the trio’s safety, his resolve hidden behind the closed doors of his office. His quiet hand enforced discipline, transforming students into soldiers under his watchful eye, ensuring their safety in the shadows.",
    "source_paragraph_index": 120
  },
  {
    "text": "Severus Snape’s life was shrouded in secrets and sacrifice. Behind his piercing eyes lay a man torn between loyalty and love, forever haunted by choices that shaped Harry Potter’s destiny. His quiet strength hid a heart burdened with loss, yet unwavering in the hope that one day, his sacrifices would bring peace.",
    "source_paragraph_index": 121
  },
  {
    "text": "Severus Snape watched from the shadows as Harry faced danger, his own past weighing heavily. Despite the darkness that clung to him, a flicker of redemption burned bright. Snape’s silent courage was a testament to a man who fought for a future he might never see, driven by love and regret.",
    "source_paragraph_index": 121
  },
  {
    "text": "Snape faced McGonagall's fierce assault, pushed to the brink. As her daggers closed in, he retreated behind a suit of armor, desperation in his eyes. Outnumbered and overwhelmed, Snape fled the castle, leaping from a window and soaring away, haunted by the shadows of his choices.",
    "source_paragraph_index": 122
  },
  {
    "text": "Snape's fight with McGonagall turned desperate. Surrounded, he hid behind armor, then escaped through a window, flying away like a ghost. Each flight was a silent cry, a fleeing from the chaos and the weight of his secrets, forever fleeing his own darkness.",
    "source_paragraph_index": 122
  },
  {
    "text": "Voldemort summoned Snape to the Shrieking Shack, accusing him of controlling the Elder Wand. As Nagini bit into Snape's neck, venom coursing through him, Snape's last act was releasing memories for Harry, hope flickering in his eyes. In that final moment, Snape's sacrifice whispered a silent plea for understanding.",
    "source_paragraph_index": 123
  },
  {
    "text": "Snape's childhood in Cokeworth revealed a fragile friendship with Lily, formed in innocence but shadowed by the world's cruelty. Harry saw how Snape's tender heart was forever intertwined with a lost love, fueling a quiet pain that haunted his every step.",
    "source_paragraph_index": 124
  },
  {
    "text": "Harry uncovered Snape’s past—how a young boy in Cokeworth once shared a pure bond with Lily. That fragile connection, broken by time and choices, explained the quiet ache in Snape’s soul, a love that never faded, shaping the man he became.",
    "source_paragraph_index": 124
  },
  {
    "text": "Severus Snape and Lily Potter sat apart at Hogwarts, their friendship strained by Snape’s dark pursuits. Despite the growing distance, Snape’s love for Lily remained a silent, burning flame, unquenched by years of separation and rivalry. His heart clung to memories of a bond lost but never forgotten.",
    "source_paragraph_index": 125
  },
  {
    "text": "Severus Snape’s world shattered when a harsh insult in fifth year drove him further from Lily. Though they parted ways, his love endured—a deep, unspoken ache. Years later, Snape’s feelings lingered, a testament to a friendship betrayed and a love forever sealed in his fractured heart.",
    "source_paragraph_index": 125
  },
  {
    "text": "Snape's heart ached as he begged Dumbledore to shield Lily's son from Voldemort's wrath. Guilt haunted him for revealing the prophecy, yet his desperation drove him to become a double agent. With silent courage, Snape concealed his true allegiance, risking everything to protect Lily's family from a darkness he had once unleashed.",
    "source_paragraph_index": 126
  },
  {
    "text": "Severus Snape's heart shattered when Lily was taken from him. Grief and guilt consumed him, fueling a resolve to protect her son and oppose Voldemort. Yet, he kept his love and pain hidden, trusting Dumbledore to shield his secret, haunted by the loss, driven by a love that death could never erase.",
    "source_paragraph_index": 127
  },
  {
    "text": "After Lily's murder, Severus Snape's world darkened with remorse. He vowed to shield her son from the darkness that took her, hiding his pain behind a stoic face. Only Dumbledore knew the truth—Snape's love for Lily remained silent, a secret weapon in the fight against evil.",
    "source_paragraph_index": 127
  },
  {
    "text": "Severus Snape remembered the moment he slowed Dumbledore’s deadly curse, knowing it would ultimately claim him within a year. Dumbledore’s trust in Snape’s loyalty weighed heavily, as he asked him to take his life instead of Draco’s, trusting Snape with a secret that could forever change the war’s course.",
    "source_paragraph_index": 128
  },
  {
    "text": "Snape’s heart ached with the burden of Dumbledore’s last request. He knew the curse’s deadly grip was inevitable, yet he vowed to protect the greater good. Dumbledore’s trust made Snape’s sacrifice personal—a quiet promise to hold onto hope amid the darkness.",
    "source_paragraph_index": 128
  },
  {
    "text": "Snape's heart shattered upon realizing Harry's fate. His outrage burned fiercely, yet tears welled as he revealed his Patronus—a gentle doe, Lily's reflection—proving his undying love amid the chaos. In that moment, love and fury intertwined, echoing a lifetime of sacrifice and sorrow.",
    "source_paragraph_index": 129
  },
  {
    "text": "Snape's fury erupted at the thought of Harry's death, but beneath it all, love persisted. His Patronus—a delicate doe—appeared, a silent testament to Lily's everlasting presence in his heart. In that fleeting moment, his pain and devotion shone brightly, defying the darkness.",
    "source_paragraph_index": 129
  },
  {
    "text": "Snape's memories revealed his unwavering loyalty. Harry saw the truth behind Snape's sacrifices, understanding where his true allegiance lay. In that moment, Harry realized Snape's hidden love and sacrifice, knowing it was the key to Voldemort's defeat. Snape’s silent suffering finally made sense to Harry.",
    "source_paragraph_index": 130
  },
  {
    "text": "Snape’s memories unveiled the secret of Harry’s fate—he was a Horcrux. Harry saw Dumbledore’s trust in Snape’s burdened heart, understanding the depth of Snape’s sacrifices. It was a painful revelation, but it clarified Snape’s sacrifices and his true allegiance to Harry’s victory.",
    "source_paragraph_index": 130
  },
  {
    "text": "In the final duel, Harry revealed Snape was Dumbledore’s man, not Voldemort’s. Snape never truly owned the Elder Wand; Dumbledore’s death was a setup. Draco Malfoy had disarmed Dumbledore first, claiming the wand’s power. Snape’s sacrifice was layered with secrets, forever hidden in the shadows of loyalty and fate.",
    "source_paragraph_index": 131
  },
  {
    "text": "Snape’s role was a shadowed truth, his loyalty a secret kept until the end. Harry’s revelation unraveled the illusion: Snape never truly commanded the Elder Wand. It was Draco Malfoy who held its true power, having disarmed Dumbledore before Snape’s hand. Snape’s sacrifice was silent, his loyalty forever etched in hidden betrayal.",
    "source_paragraph_index": 131
  },
  {
    "text": "Severus Snape's love kept his secrets safe, hiding his true loyalties from Voldemort. His sacrifice, unseen by many, became the silent strength behind Harry’s victory. When Voldemort fell, Snape’s love shone through, forever changing the course of history.",
    "source_paragraph_index": 132
  },
  {
    "text": "Severus Snape’s death was avenged by Harry and Neville, but his true sacrifice remained a quiet, powerful act. His love and loyalty, hidden behind Occlumency, gave Harry the strength to triumph over darkness and protect what Snape held dear.",
    "source_paragraph_index": 132
  },
  {
    "text": "Snape's portrait was missing from the Headmaster's office, a silent reminder of his abandonment during the Battle. Harry, seeking reconciliation, ensured it was placed there, honoring Snape's complex legacy. After the war, Harry likely gave Snape a proper burial, while Rita Skeeter's book forever probed whether Snape was a scoundrel or saint.",
    "source_paragraph_index": 133
  },
  {
    "text": "In death, Snape's story lingered. Harry, recognizing his sacrifice, honored him with a portrait in the Headmaster's office, bridging past wounds. Rita Skeeter's book questioned his true nature, but Harry knew Snape's sacrifice was a quiet, unspoken testament to his complex soul.",
    "source_paragraph_index": 133
  },
  {
    "text": "Albus Severus Potter, Harry's son, carried Lily's bright green eyes and a name tied to Snape. Fearful of Slytherin, Albus worried. Harry reassured him, remembering Snape’s bravery, reminding Albus that even Slytherins can be brave. The boy felt a flicker of hope, knowing his name embodied courage beyond house walls.",
    "source_paragraph_index": 134
  },
  {
    "text": "Albus Severus Potter, with Lily's eyes, feared his Sorting. Harry, recalling Snape’s bravery, told him his name honored two headmasters, one Slytherin but brave beyond words. Albus’s heart steadied, sensing that bravery transcended houses—he was destined for courage, just like Snape.",
    "source_paragraph_index": 134
  },
  {
    "text": "Horace Slughorn cherished Snape’s old cauldron, a simple reminder of Snape’s humble beginnings. To Slughorn, it symbolized Snape’s quiet strength and belief that talent mattered more than social standing. The unassuming vessel held memories of Snape’s resilience and unwavering focus, inspiring those who saw it.",
    "source_paragraph_index": 135
  },
  {
    "text": "During the Calamity, Harry remembered Snape's quiet wisdom. He showed an investigator how Snape pressed Sopophorous beans with a knife, unlocking their secret juice. This simple act, born of Snape's mastery, became vital in saving time and lives amid chaos.",
    "source_paragraph_index": 136
  },
  {
    "text": "In the chaos of the Calamity, Harry carried Snape's knowledge like a fragile flame. He taught an investigator Snape’s secret: pressing beans gently to unlock their essence, a small act that empowered them to craft their potion faster and better, honoring Snape’s unseen legacy.",
    "source_paragraph_index": 136
  },
  {
    "text": "Scorpius Malfoy, knowing Snape’s past, convinced an alternate Snape that he was from another time. In a world where Voldemort triumphed, Snape hesitated, torn by old loyalties. Overcome with hope, Snape stepped into the shadows, helping Scorpius meet the rebels—fighting to rewrite a dark, unchangeable fate.",
    "source_paragraph_index": 137
  },
  {
    "text": "In a twisted future ruled by Voldemort, Snape’s memories stirred as Scorpius Malfoy appeared with a desperate plea. Snape, haunted by his past, found a flicker of courage. He guided the young Malfoy to the resistance, silently yearning to undo the nightmare—hope flickering in a world shrouded in darkness.",
    "source_paragraph_index": 137
  },
  {
    "text": "Severus Snape realized he had fallen in Voldemort's battle, his death confirmed by Scorpius's shock. Though annoyed by his fate, Snape helped Scorpius escape Dolores Umbridge and faced Dementors, leaving his future uncertain. His sacrifice lingered in the shadows, a silent testament to his complex loyalty.",
    "source_paragraph_index": 138
  }
]