{
  "0": {
    "text": "Minerva McGonagall's birth on October 4th marked the beginning of a unique life. Her father, a humble minister, and her mother, a powerful witch, raised her on the Scottish Highlands' edge. From her earliest days, Minerva carried the weight of her magical heritage amid a world of Muggles, destined for greatness.",
    "source_paragraph_index": 0
  },
  "1": {
    "text": "Minerva's first moments sparked a quiet chaos—toys floated, the cat danced on command, and bagpipes played by unseen hands. Her innocent laughter filled the room, hiding her uncontrollable magic. Isobel watched with a tender, trembling heart, knowing she must reveal the truth to Robert, risking everything to protect their secret and their child's future.",
    "source_paragraph_index": 1
  },
  "2": {
    "text": "Minerva McGonagall watched her parents' trust fade after a shocking secret. Despite their love, her heart ached for the fragile bond broken by revealed truths. She hid her magic from her father, feeling the weight of childhood secrets and the ache of innocence lost. Her closeness to her Muggle father deepened her silent sorrow.",
    "source_paragraph_index": 2
  },
  "3": {
    "text": "Minerva McGonagall's heart swelled with pride and longing as she clutched her wand, knowing her journey into magic was beginning. Watching her mother cry, a mix of pride and envy, Minerva felt the weight of her destiny, eager to prove herself among her kind.",
    "source_paragraph_index": 3
  },
  "4": {
    "text": "Minerva McGonagall sat nervously as the Sorting Hat hesitated, wavering between Gryffindor and Ravenclaw. When it finally declared Gryffindor, her heart swelled with pride. That moment marked the beginning of a journey filled with friendship and magic, shaping the fierce and compassionate witch she would become.",
    "source_paragraph_index": 4
  },
  "5": {
    "text": "Minerva McGonagall gifted Pomona Sprout a Fanged Geranium named Gerald, helping her heal homesickness. Their bond blossomed, and the plant thrived under their friendship’s magic—an enduring symbol of Minerva’s kindness and the powerful connections that defined her Hogwarts years.",
    "source_paragraph_index": 4
  },
  "6": {
    "text": "Minerva McGonagall's brilliance shone early, her talent for Transfiguration unmatched. Under Dumbledore's guidance, she became an Animagus, her tabby form echoing her fierce determination. Her journey was a testament to perseverance and talent, leaving an indelible mark on Hogwarts and the magical world.",
    "source_paragraph_index": 5
  },
  "7": {
    "text": "Minerva's talent shone on the Gryffindor Quidditch team, but during her final year, a foul brought her crashing to the ground. The pain of broken ribs and a haunting concussion fueled her fierce desire to see Slytherin defeated forever.",
    "source_paragraph_index": 6
  },
  "8": {
    "text": "A deadly foul during a crucial match left Minerva battered and broken, her body scarred, but her spirit ignited. The fall fueled her resolve, fueling an unyielding wish to crush Slytherin on the Quidditch pitch forever.",
    "source_paragraph_index": 6
  },
  "9": {
    "text": "Minerva McGonagall cherished her last summer at home, feeling the bittersweet pull of departure. Her heart fluttered when she met Dougal McGregor, a charming Muggle farmer’s son, whose wit and kindness ignited a hope she hadn't known. That fleeting summer became a treasured memory of innocence and new beginnings.",
    "source_paragraph_index": 7
  },
  "10": {
    "text": "Minerva McGonagall felt her heart race as McGregor’s proposal echoed across the ploughed field. For the first time, she truly lost her head in love, overwhelmed by a fiery mix of humor, fierce arguments, and deep suspicion. Her answer was a trembling yes, sealing a moment she would never forget.",
    "source_paragraph_index": 8
  },
  "11": {
    "text": "Minerva McGonagall gazed at her reflection, tears filling her eyes. She knew revealing her secret to McGregor would shatter everything. Her heart ached, but she chose silence. The pain of losing love was eclipsed by the fear of a life imprisoned, her dreams forever locked away in the shadows of her secret world.",
    "source_paragraph_index": 9
  },
  "12": {
    "text": "Early dawn, Minerva told McGregor she couldn't marry him. Her voice trembled, yet she hid the truth: her magic. McGregor's face fell, heartbreak etched into his features. Three days later, he left for London, leaving Minerva haunted by the sacrifices that kept her true self hidden, forging a lonely path for her future.",
    "source_paragraph_index": 9
  },
  "13": {
    "text": "Minerva McGonagall loved her Muggle father and Dougal fiercely, yet her London home was cold and filled with bias. The Ministry's shadows weighed on her, but her spirit remained unbroken. Despite a tempting promotion, she yearned for Scotland’s embrace, where her heart truly belonged, holding onto love amid a world that misunderstood her.",
    "source_paragraph_index": 10
  },
  "14": {
    "text": "Minerva McGonagall's swift owl carried her hopes to Hogwarts. When Albus Dumbledore offered her a Transfiguration post, her heart swelled. She became a strict yet inspiring teacher, wielding her stern hand with pride, knowing she shaped young minds and earned their respect through unwavering dedication.",
    "source_paragraph_index": 11
  },
  "15": {
    "text": "Minerva's heart broke when her mother casually revealed Dougal's marriage to another. Later, in tears, Minerva confided in Albus, pouring out her pain. His comforting words and shared stories forged a deep bond between them, transforming heartbreak into hope and friendship that would last forever.",
    "source_paragraph_index": 12
  },
  "16": {
    "text": "Surprised by her mother's news of Dougal's marriage, Minerva wept alone in her classroom. Albus found her that night, offering solace and revealing his own family struggles. Their shared secrets kindled a friendship rooted in understanding and compassion, forever shaping their lives.",
    "source_paragraph_index": 12
  },
  "17": {
    "text": "Minerva McGonagall watched Leta Lestrange, tears in her eyes, run from her after sealing a cruel gossiper's mouth. Frustration and worry clashed as Minerva chased her through the halls, docking points for Leta’s rebellion. Despite her sternness, her heart ached for the girl’s pain and the chaos of misunderstood innocence.",
    "source_paragraph_index": 13
  },
  "18": {
    "text": "In 1927, Minerva McGonagall watched helplessly as Aurors stormed Dumbledore's classroom. Her heart ached with fury and frustration, knowing Hogwarts was a sanctuary, not a battleground. She silently vowed to protect the school’s soul, even if her voice was drowned out by the chaos around her.",
    "source_paragraph_index": 14
  },
  "19": {
    "text": "Minerva McGonagall’s eyes burned with anger as she led students out of Dumbledore’s ruined lesson. Her spirit trembled, torn between obedience and her fierce desire to defend Hogwarts’ sanctity amid the storm of Ministry interference.",
    "source_paragraph_index": 14
  },
  "20": {
    "text": "In 1932, Minerva hurried to the Hog's Head Inn, her heart pounding as she warned Albus about Anton Vogel's dangerous plans to clear Grindelwald's name. Her voice trembled with urgency, knowing the fate of many depended on her courage. She felt the weight of the world in that fleeting moment.",
    "source_paragraph_index": 15
  },
  "21": {
    "text": "After Albus's first army returned victorious, Minerva watched them with pride and relief in the Great Hall. As he revealed a sculpture of the Eyrie, she felt a deep connection—hope ignited in her chest, knowing their fight was just beginning, yet already forging a brighter future.",
    "source_paragraph_index": 15
  },
  "22": {
    "text": "Minerva McGonagall remembered Elphinstone’s love, her heart torn between duty and longing. When he finally proposed by the Great Lake, she accepted, their dreams of a cottage in Hogsmeade blending hope with sorrow. After his tragic death, she found solace wandering by the lake, clutching memories of their fleeting happiness.",
    "source_paragraph_index": 16
  },
  "23": {
    "text": "Minerva McGonagall's heart swelled with bittersweet memories of Elphinstone. She cherished their time together, from his proposals at Madam Puddifoot’s to walks by the Great Lake. Even after his tragic death, she kept his memory alive, finding comfort in small reminders of their love and shared dreams.",
    "source_paragraph_index": 16
  },
  "24": {
    "text": "Minerva McGonagall, now Head of Transfiguration, watched her students transform mice into snuffboxes, her heart swelling with pride. She remembered her own Hogwarts days, and now she guided others with unwavering dedication, her spirit a beacon of magical mastery and kindness.",
    "source_paragraph_index": 17
  },
  "25": {
    "text": "As Head of Gryffindor, Minerva's loyalty shone brightly. Dumbledore trusted her implicitly, making her Deputy Headmistress. She stood tall, ready to fill his shoes, her resolve embodying the strength and spirit of her house, her journey a testament to unwavering commitment and love for Hogwarts.",
    "source_paragraph_index": 17
  },
  "26": {
    "text": "Minerva McGonagall fought fiercely against Voldemort's dark shadow, secretly risking everything by spying as a cat, whispering vital truths to Aurors. Her quiet bravery lit a hidden path of hope amidst chaos, her heart torn between teaching and saving lives in the shadows.",
    "source_paragraph_index": 18
  },
  "27": {
    "text": "Minerva McGonagall survived the war, her heart heavy with loss. Her brother Robert, Lily Evans, James Potter, and Dougal McGregor—each taken too soon—haunted her. The pain of their absence carved deep into her soul, leaving her to wonder if love or duty could have saved them. Her grief was silent but everlasting.",
    "source_paragraph_index": 19
  },
  "28": {
    "text": "Minerva McGonagall watched helplessly as curses erupted from Jacob’s reckless meddling, tears welling in her eyes. The chaos stole lives—Duncan Ashe's innocence lost forever. Despite her fierce efforts to shield the students, pain and loss etched into her heart, fueling her resolve to protect them at all costs.",
    "source_paragraph_index": 20
  },
  "29": {
    "text": "Amidst the chaos outside the castle, Minerva McGonagall felt a crushing weight of guilt as Jacob’s curiosity unleashed deadly curses. The tragic death of Duncan Ashe haunted her, igniting a fierce resolve to shield her students. Her heart ached for the lives shattered, fueling her determination to prevent further tragedy.",
    "source_paragraph_index": 20
  },
  "30": {
    "text": "Minerva McGonagall watched with tears as Harry Potter, a baby, faced darkness at Godric's Hollow. His parents had sacrificed everything, dying to save him. When Voldemort fell, hope flickered anew. Minerva felt both sorrow and relief—an end to terror, a new beginning for the boy who survived against all odds.",
    "source_paragraph_index": 21
  },
  "31": {
    "text": "Minerva McGonagall's heart sank as she watched the Dursleys, realizing they were nothing like Harry's loving parents. She felt a deep dread, knowing Harry's future was in their hands. When Dumbledore left Harry at their doorstep, Minerva's protective instincts flared—she knew she could only watch and hope.",
    "source_paragraph_index": 22
  },
  "32": {
    "text": "Minerva McGonagall stood silently, eyes fixed on Harry's tiny figure. She despised the Dursleys' neglect, seeing in them the stark absence of Lily and James. Her worry haunted her as she kept a vigilant watch, desperate to shield Harry from a future she knew was fraught with neglect.",
    "source_paragraph_index": 22
  },
  "33": {
    "text": "After the war, Minerva found peace at Hogwarts, teaching Transfiguration. Elphinstone’s love endured silently until Dougal’s death. During a quiet summer walk by the lake, he proposed. Their life in Hogsmeade brought her joy, filled with visits from nieces and nephews—moments of quiet fulfillment she cherished deeply.",
    "source_paragraph_index": 23
  },
  "34": {
    "text": "Minerva McGonagall's heart shattered when Elphinstone died from a deadly bite. She left their cottage, unable to face solitude, and sought refuge in Hogwarts. Behind her brave facade, silent grief consumed her, hidden from all but her closest confidant, Albus. Her pain was a quiet storm, fueling her unwavering dedication to her work.",
    "source_paragraph_index": 24
  },
  "35": {
    "text": "Three years after Elphinstone's death, Minerva McGonagall returned to Hogwarts, carrying the weight of loss. Her courage masked deep sorrow; her solitude was a silent cry. Only Albus saw her suffering, as she poured her pain into her work, a quiet testament to her resilience and hidden heartbreak.",
    "source_paragraph_index": 24
  },
  "36": {
    "text": "Minerva McGonagall's gaze was sharp with concern as she listened to Jacob's sibling. She knew the Cursed ice might have changed Ben Copper, and her voice trembled with worry. She reminded them that Hogwarts' safety depended on their choices, not just secrets behind a door, her eyes pleading for understanding and caution.",
    "source_paragraph_index": 25
  },
  "37": {
    "text": "Minerva McGonagall's voice held a heavy weight when she spoke of Ben Copper. She questioned the risks, her face etched with worry. Her words were a gentle but firm reminder that Hogwarts' fate was intertwined with their actions, and that no secret was worth endangering everyone she protected.",
    "source_paragraph_index": 25
  },
  "38": {
    "text": "Minerva McGonagall's heart raced as she learned of the Ice Knight and Vanished Stairs. She remembered the chilling battles against the Cursed Ice, a secret she hurriedly concealed. Her voice trembled when she urged Jacob's sibling to help find Ben, promising a reward. The weight of secrets pressed heavily on her shoulders.",
    "source_paragraph_index": 26
  },
  "39": {
    "text": "Minerva McGonagall's heart pounded as she and Snape uncovered Ben Copper trapped in cursed ice. She felt a surge of hope amid the cold darkness, knowing they had to act before it was too late. Her resolve hardened; she would not let the ice claim another life. Together, they shattered the curse, saving Ben’s trembling form.",
    "source_paragraph_index": 27
  },
  "40": {
    "text": "Minerva McGonagall stared in horror as the cursed ice expanded, whispering secrets of treachery within the vaults. Snape’s callous suggestion to burn everything away chilled her more than the ice. Yet, with fierce determination, Minerva cast the Fire-Making Spell, risking her soul to free Ben and confront the darkness threatening their world.",
    "source_paragraph_index": 27
  },
  "41": {
    "text": "Minerva McGonagall watched Jacob's sibling seek her out, desperation shining in their eyes. Though the Revelio Charm was complex, her heart softened at their determination to save Hogwarts. When they finally succeeded, her pride and warmth filled the room, knowing she had helped ignite their hope and courage.",
    "source_paragraph_index": 28
  },
  "42": {
    "text": "Minerva McGonagall's eyes blazed with fury when she learned Bill Weasley had taught Jacob's sibling the Fire-Making Spell. Her voice trembled with anger as she scolded him fiercely, worried about the reckless power being handed over. Her heart ached for the potential danger, her love for her students burning bright.",
    "source_paragraph_index": 29
  },
  "43": {
    "text": "Minerva McGonagall watched with fierce determination as she transformed a giant chess set, her magic animating it to defend the Philosopher’s Stone. She knew anyone daring to breach could be sacrificed in the brutal game. Her courage burned bright, protecting life itself through a risky, vital act of enchantment.",
    "source_paragraph_index": 30
  },
  "44": {
    "text": "Minerva McGonagall watched silently as Harry Potter, unaware of his true magic, arrived at Hogwarts. Her heart swelled with quiet hope as he was sorted into Gryffindor, knowing her watchful care would now be his shield in this new, mysterious world.",
    "source_paragraph_index": 31
  },
  "45": {
    "text": "Minerva McGonagall saw Harry flying alone, risking everything. Instead of punishment, she took him to meet Oliver Wood, recognizing his talent. Her quiet act of kindness changed Harry’s life, making him the youngest Seeker in a century. Her heart warmed with pride, even if her stern face rarely revealed it.",
    "source_paragraph_index": 32
  },
  "46": {
    "text": "Minerva McGonagall often wore a strict mask, but when she caught Harry flying unsupervised, she chose compassion over punishment. She arranged for him to have a Nimbus 2000, believing in his potential. Though her sternness remained, her actions whispered her belief—she saw greatness in him.",
    "source_paragraph_index": 32
  },
  "47": {
    "text": "Minerva McGonagall's heart pounded as she found Hermione battered and trembling after the chaos. The bathroom lay in ruins, a troll subdued but alive. Fear and protectiveness swelled within her; she knew her students' safety depended on her strength. In that shattered room, her resolve to shield them burned brighter than ever.",
    "source_paragraph_index": 33
  },
  "48": {
    "text": "On Halloween night, Minerva McGonagall watched helplessly as chaos erupted. A troll's terror had torn through the school, leaving students like Hermione battered but alive. Her eyes welled with both fear and fierce determination—she would do anything to keep her students safe, even in the face of unimaginable darkness.",
    "source_paragraph_index": 33
  },
  "49": {
    "text": "Minerva McGonagall watched Hermione risked her life against a troll, realizing her bravery bordered on foolhardiness. Despite her anger, pride swelled within her as she awarded Harry and Ron for their luck. That Christmas, she blushed and giggled when Hagrid's drunken kiss surprised her, a rare moment of joy amid her stern exterior.",
    "source_paragraph_index": 34
  },
  "50": {
    "text": "One night, Minerva McGonagall caught Draco Malfoy wandering the halls. Her eyes burned with disappointment as she dragged him to detention, deducting points from Slytherin. Her sternness revealed her deep care, punishing him not just for mischief but to guide him back onto the right path.",
    "source_paragraph_index": 35
  },
  "51": {
    "text": "When Harry, Hermione, and Neville were caught with a baby dragon, Minerva McGonagall’s disappointment cut deep. She scolded them fiercely, deducting fifty points each. Her stern punishment echoed her hope to teach, not just punish, leaving her students feeling both scared and cared for beneath her unwavering gaze.",
    "source_paragraph_index": 35
  },
  "52": {
    "text": "Minerva McGonagall watched with pride as Harry, Hermione, and Ron thwarted Quirrell’s theft. Her heart swelled when Gryffindor finally claimed the House Cup, a victory born of courage and unity. Though her face remained composed, inside she felt a rare warmth, knowing her students had truly triumphed.",
    "source_paragraph_index": 36
  },
  "53": {
    "text": "Minerva McGonagall’s eyes shimmered with quiet joy as Gryffindor celebrated their hard-won victory. She saw bravery in every face, hope in every cheer. Though her expression was steady, her soul recognized this moment—a triumph long awaited, a testament to her house’s courage and her unwavering pride.",
    "source_paragraph_index": 36
  },
  "54": {
    "text": "Minerva McGonagall watched Harry and Ron crash the flying car into the Whomping Willow. Her heart ached for their recklessness, yet she knew justice with kindness. She spared them harsh punishment, understanding their fear and innocence. Her gentle fairness shielded their mistakes, reminding them that even in chaos, compassion prevails.",
    "source_paragraph_index": 37
  },
  "55": {
    "text": "Minerva McGonagall's heart ached as she watched the castle's walls whisper secrets of danger. Despite her efforts, the Chamber remained hidden, filling her with helplessness. The weight of fear pressed on her, but her resolve never wavered. She knew she had to protect her students, no matter how dark the threat.",
    "source_paragraph_index": 38
  },
  "56": {
    "text": "Minerva McGonagall’s face twitched with disdain at Gilderoy Lockhart's nauseating pink hearts. Her frustration simmered beneath her calm exterior as she fought to keep hope alive. The petrified students haunted her, yet she stood firm, determined to shield Hogwarts from the invisible darkness threatening to consume them all.",
    "source_paragraph_index": 38
  },
  "57": {
    "text": "Minerva McGonagall, fragile yet resolute, stepped into the headmistress's role as chaos threatened Hogwarts. When Harry and Ron sneaked out, she caught them but saw their concern. Her softened heart spared them detention, revealing her deep care amid the turmoil.",
    "source_paragraph_index": 39
  },
  "58": {
    "text": "Minerva McGonagall's frustration grew with Gilderoy Lockhart's clueless antics amid rising chaos. Her hope dimmed as the staff prepared for a future without Hogwarts, a loss she could hardly bear, feeling the weight of impending tragedy.",
    "source_paragraph_index": 40
  },
  "59": {
    "text": "Minerva McGonagall's heart swelled with relief as Ginny entered, alive and safe, amid Harry, Ron, and magical relics. The danger was gone, replaced by joy. She watched Ginny, knowing the darkness had passed, and pride filled her soul. The crisis was over, and hope had been restored.",
    "source_paragraph_index": 41
  },
  "60": {
    "text": "Minerva McGonagall saw Ginny walk in, exhausted but victorious. Harry and Ron had faced the darkness and returned triumphant. Dumbledore’s approval and the sight of the slain monster filled her with warmth. She knew peace had returned, and her heart overflowed with gratitude and relief.",
    "source_paragraph_index": 41
  },
  "61": {
    "text": "Minerva McGonagall watched Harry Potter shiver as Dementors loomed outside Hogwarts. Her heart ached for her students, knowing the darkness they faced. She stood firm, protecting her school from the foul creatures she despised, determined to shield them from the darkness threatening to consume their innocence.",
    "source_paragraph_index": 42
  },
  "62": {
    "text": "In a quiet moment, Minerva McGonagall approved Hermione Granger’s use of a Time-Turner, sensing it would save lives. Her resolve burned fiercely—she would do anything to safeguard her students, even if it meant bending rules. The battle against darkness was relentless, but Minerva’s courage shone brighter than ever.",
    "source_paragraph_index": 42
  },
  "63": {
    "text": "When McGonagall revealed her Animagus form, the silence in her first class was profound, unlike the applause she usually received. Her calm presence comforted her students, especially Harry Potter, who looked uncertain. McGonagall's gentle humor reassured him that, no matter the predictions, she believed in their safety and her faith in them endured.",
    "source_paragraph_index": 43
  },
  "64": {
    "text": "Minerva McGonagall watched with trembling heart as Black infiltrated the castle, her years of guarding tested by the dark intruder. She desperately tried to warn Harry, but words were lost in the chaos. Fear and frustration flickered in her eyes—she knew the danger was closer than ever, and her protectiveness burned fiercely.",
    "source_paragraph_index": 44
  },
  "65": {
    "text": "When Ron Weasley claimed Black attacked him, Minerva McGonagall hurried to Gryffindor Tower, worry etched deep. She dismissed his fears, unaware of the secret help Crookshanks provided, and her mind raced with the impossible. Her heart ached with helplessness, knowing the darkness lurked just beyond her grasp.",
    "source_paragraph_index": 44
  },
  "66": {
    "text": "McGonagall’s heart sank as Sir Cadogan confirmed Neville’s mistake. She felt the weight of disappointment and worry for Neville’s future, knowing her strictness was necessary but painful. Her enforcement, though harsh, was driven by concern, leaving her with a lingering ache for the young Gryffindor’s crushed spirit.",
    "source_paragraph_index": 45
  },
  "67": {
    "text": "McGonagall watched Neville’s face fall as he received the Howler from his grandmother. The regret and embarrassment pierced her, knowing her punishment struck deep. She wished she could protect Neville from the pain, yet understood her duty to teach him responsibility, leaving her with a bittersweet ache.",
    "source_paragraph_index": 45
  },
  "68": {
    "text": "Minerva McGonagall's suspicion cast a shadow over Harry's prized Firebolt, her fears rooted in dark curses. When she confiscated it, Harry felt betrayed, yet her actions stemmed from protectiveness. Later, her unwavering resolve shone as she declared the Firebolt safe, defending Harry's joy and trust.",
    "source_paragraph_index": 46
  },
  "69": {
    "text": "During a tense Quidditch match, Minerva McGonagall's fury ignited as Dementor-like tricks threatened Harry. Her swift punishment of the tricksters, deducting points and detention, was a fierce shield. Her protective heart burned bright, ensuring Harry's safety amidst chaos.",
    "source_paragraph_index": 46
  },
  "70": {
    "text": "In 1994, Minerva McGonagall watched Gryffindor win the Quidditch Cup, tears of joy streaming down her face as she clung to a Gryffindor flag. Her heart swelled with pride, yet sorrow shadowed her happiness as she saw Oliver Wood depart, knowing the team’s victory marked a bittersweet chapter.",
    "source_paragraph_index": 47
  },
  "71": {
    "text": "Minerva McGonagall's heart ached as Harry Potter was chosen for the dangerous Triwizard Tournament. She watched over him like a mother, fearing for his safety. Despite her pleas to protect him, she knew the rules bound Harry, and her worry grew with every step he took into the perilous challenge.",
    "source_paragraph_index": 48
  },
  "72": {
    "text": "Minerva McGonagall, determined to impress her guests, finally let her hair down at the Yule Ball. Dancing with Dumbledore and Ludovic Bagman, her grace shone through. Harry watched as Bagman kissed her hand—a rare moment of vulnerability, revealing a woman who cherished elegance and fleeting happiness amidst her duties.",
    "source_paragraph_index": 49
  },
  "73": {
    "text": "At the Yule Ball, Minerva McGonagall shed her usual formality, embracing a rare joy. Dancing with Dumbledore and Ludovic Bagman, her spirit sparkled. Harry saw Bagman kiss her hand—a tender gesture that hinted at the quiet, unspoken depths of her heart beyond her stern exterior.",
    "source_paragraph_index": 49
  },
  "74": {
    "text": "Minerva McGonagall watched Harry, Ron, and Hermione with quiet pride as she lent her classroom for their practice. She had seen their dedication many times, her heart swelling with hope. When danger struck, Minerva stood brave with Dumbledore and Snape, determined to rescue Harry, her faith unwavering in the face of darkness.",
    "source_paragraph_index": 50
  },
  "75": {
    "text": "Minerva McGonagall's heart shattered as she watched the Dementor's Kiss claim Crouch Jnr, her fury at Fudge boiling over. The horror left her trembling, screams echoing her anguish. Despite the chaos, she stood unwavering, supporting Dumbledore and Harry, her soul burning with resolve to face the darkness looming over Hogwarts.",
    "source_paragraph_index": 51
  },
  "76": {
    "text": "Minerva McGonagall felt the sting of betrayal as Cedric Diggory was murdered, innocence lost in a cruel second. Her tears and silent grief fueled her resolve, knowing the war had begun. She sheltered her pain behind her stern gaze, quietly vowing to fight for hope amid the darkness threatening to consume them all.",
    "source_paragraph_index": 51
  },
  "77": {
    "text": "Minerva McGonagall joined the fight in 1995, risking everything for the Order. Dressed in Muggle clothes, she moved stealthily, her resolve unshaken. At Hogwarts, the battles grew fiercer, but Minerva’s courage shone brighter than ever, a guardian whose strength held the school and its students together in dark times.",
    "source_paragraph_index": 52
  },
  "78": {
    "text": "Minerva McGonagall's heart sank as Dolores Umbridge was appointed. She saw the dark cloud looming over Hogwarts, a betrayal that insulted everything she loved about the school. Her eyes burned with quiet fury, knowing she had to stand against this storm for the sake of her students and the magic they cherished.",
    "source_paragraph_index": 53
  },
  "79": {
    "text": "When Minerva McGonagall learned of Umbridge’s appointment, her spirit flickered with disapproval. She clenched her fists, feeling the weight of disappointment. Hogwarts was under siege, and Minerva’s silent resolve grew—she would protect her school, no matter the cost, from this creeping darkness.",
    "source_paragraph_index": 53
  },
  "80": {
    "text": "Minerva McGonagall watched Harry Potter face Umbridge's wrath with a heavy heart. She warned him silently: stay quiet, stay safe. Her courage shone in secret acts of rebellion, like aiding Peeves and rescuing Trelawney, all to protect Hogwarts from the darkness threatening to swallow it. Minerva’s quiet strength kept hope alive.",
    "source_paragraph_index": 54
  },
  "81": {
    "text": "Minerva McGonagall faced Umbridge’s scrutinizing gaze with icy calm, her wit a silent shield. Though her temper threatened to flare, she held firm, inspiring students like Ron Weasley who cheered her quiet defiance. Minerva’s strength whispered hope amid looming darkness.",
    "source_paragraph_index": 55
  },
  "82": {
    "text": "Minerva McGonagall stood in Dumbledore's office, her heart pounding as Harry was brought in. When Umbridge accused Harry of forming a rebel group, Minerva's voice trembled with outrage. She couldn’t believe Willy Widdershins's betrayal, her resolve burning—to protect her students and stand against injustice—shaking her very soul.",
    "source_paragraph_index": 56
  },
  "83": {
    "text": "Minerva McGonagall's loyalty burned fiercely. When Fudge dared to threaten Dumbledore, she drew her wand, ready to fight the Minister for Magic. Her voice trembled with defiance, but she obeyed Dumbledore’s silent command, knowing Hogwarts' safety depended on her. Her courage shone brighter than any fear.",
    "source_paragraph_index": 57
  },
  "84": {
    "text": "Dumbledore's sacrifice saved Harry, but Fudge's anger turned violent. Minerva McGonagall stood tall, prepared to face the Minister himself. Her heart pounded, but her resolve was unwavering. She held back, trusting Dumbledore’s wisdom, her loyalty etched in her very soul, ready to defend her school at any cost.",
    "source_paragraph_index": 57
  },
  "85": {
    "text": "Minerva McGonagall watched helplessly as Umbridge, with no support, tried to crush her students' dreams. When Umbridge mocked Harry Potter's future, Minerva's resolve broke. She vowed silently to help Harry achieve his goal, her heart burning with fierce protectiveness amid Hogwarts's growing darkness.",
    "source_paragraph_index": 58
  },
  "86": {
    "text": "Minerva McGonagall's patience shattered when Umbridge mocked Harry Potter's ambition. With unwavering resolve, Minerva promised to support Harry, even if it cost her everything. Her heart ached as Hogwarts' atmosphere darkened, but her commitment to her students' futures burned brighter than ever.",
    "source_paragraph_index": 58
  },
  "87": {
    "text": "Minerva McGonagall's courage shone during a crisis. She charged at Aurors threatening Hagrid, voice fierce with protection. Before she could cast a spell, four Stunning Spells struck her, leaving her wounded. Her resolve was clear—she fought for her friend, even at great personal cost, embodying unwavering loyalty and bravery.",
    "source_paragraph_index": 59
  },
  "88": {
    "text": "Minerva McGonagall felt the sting of cowardice as attackers betrayed her trust. Hagrid's fury ignited a fierce fight, defending her honor. Despite her pain, her resolve to protect her students overshadowed her own wounds, fueling her silent, unwavering courage amid chaos.",
    "source_paragraph_index": 60
  },
  "89": {
    "text": "Minerva McGonagall returned to Hogwarts battered but resolute, her injuries eased by time. She awarded brave students house points, her pride shining through pain. Watching Peeves chase Umbridge, she chuckled, longing to join the chaos, but her walking stick was stolen—her strength momentarily tethered, yet her spirit unbroken.",
    "source_paragraph_index": 61
  },
  "90": {
    "text": "Minerva McGonagall returned to her roles with renewed purpose, her heart heavy with duty. As she handed out schedules to sixth-year students, she felt the weight of their futures. Every paper she distributed carried her hopes and silent prayers for their success and safety in uncertain times.",
    "source_paragraph_index": 62
  },
  "91": {
    "text": "Minerva watched with a heavy heart as Hagrid gently carried a cursed Katie Bell into the castle. Her eyes reflected concern and resolve, knowing the danger was real. She quietly approached Harry, her voice steady but tender, asking what he held— the cursed necklace, a symbol of peril and hope intertwined.",
    "source_paragraph_index": 63
  },
  "92": {
    "text": "After Harry ran off in distress, Minerva stood amidst the chaos, her face a mask of calm determination. When she saw Harry clutching the cursed necklace, her voice softened but carried weight, as she gently inquired about the dangerous object, knowing it was a key to their peril and their salvation.",
    "source_paragraph_index": 63
  },
  "93": {
    "text": "Minerva McGonagall watched helplessly as Katie was rushed to St Mungo's, her heart aching. She trusted Harry's theory, but her doubts kept her awake all night, fearing the darkness lurking behind innocent faces. Her resolve to protect her students burned brighter than ever, knowing some curses could threaten everything she loved.",
    "source_paragraph_index": 64
  },
  "94": {
    "text": "Minerva McGonagall handed the cursed necklace to Professor Snape, her hands trembling. She questioned Harry and the others, desperately seeking truth amid chaos. Though Snape stopped the curse, her worry for Katie lingered, shadows of fear haunting her, knowing evil had struck close to her heart and the fight was far from over.",
    "source_paragraph_index": 64
  },
  "95": {
    "text": "Minerva McGonagall felt a surge of pride and responsibility as she patrolled the castle, trusting Dumbledore’s plan. When Ron, Ginny, and Neville appeared with urgent news about intruders, her heart tightened—Voldemort’s shadow was never far, and she knew every second counted in protecting her students.",
    "source_paragraph_index": 65
  },
  "96": {
    "text": "Minerva McGonagall's heart pounded as she led the charge against the ruthless Death Eaters. Despite their numbers, her courage drove her to fight fiercely, knowing the safety of Hogwarts depended on her. The skirmish was brutal, and as darkness closed in, Minerva’s resolve never wavered, even as the enemy gained the upper hand.",
    "source_paragraph_index": 66
  },
  "97": {
    "text": "Minerva McGonagall saw the Death Eaters approaching the Astronomy Tower. Her breath hitched with fear and fury as she rallied her allies. They fought desperately, curses flying, each moment a battle of life and death. Though overwhelmed, Minerva clung to hope, refusing to let darkness swallow Hogwarts without a fight.",
    "source_paragraph_index": 66
  },
  "98": {
    "text": "Minerva McGonagall watched Neville and Bill fall, their strength drained by relentless Death Eaters. Her heart ached with urgency and fear. She sent Flitwick for Snape, clinging to hope, knowing every second counted in their desperate fight for survival.",
    "source_paragraph_index": 67
  },
  "99": {
    "text": "Locked below, Minerva McGonagall felt helpless as the cursed barrier kept her from her friends. When Snape arrived, fueled by the Dark Mark, he pushed past her with determination, igniting a flicker of hope amid the darkness.",
    "source_paragraph_index": 67
  },
  "100": {
    "text": "Minerva believed Snape was fleeing with Draco, and she chased after them. When Alecto Carrow attacked, Minerva fought fiercely, sending her fleeing. Yet, her heart broke when she found their beloved headmaster fallen outside the tower, a life she had cherished for decades now lost. Her world shattered in silent grief.",
    "source_paragraph_index": 68
  },
  "101": {
    "text": "As chaos erupted, Minerva watched Snape and Draco escape, trusting they were safe. Her victory over Alecto Carrow was fleeting; her greatest sorrow was discovering the headmaster, her lifelong friend, dead beneath the stars. Her fight was over, but her grief had only just begun.",
    "source_paragraph_index": 68
  },
  "102": {
    "text": "Minerva McGonagall's heart broke as she delivered the news of her student's grave injury, feeling the weight of loss and helplessness. At the Hospital Wing, her resolve hardened, knowing she must protect Hogwarts and its students from the darkness threatening to consume them all.",
    "source_paragraph_index": 69
  },
  "103": {
    "text": "Minerva McGonagall, eyes blazing with determination, stepped into her new role as acting Headmistress. Surrounded by her fellow Heads of Houses, she vowed to shield Hogwarts and forge a future amid chaos, her spirit unwavering despite the storm around her.",
    "source_paragraph_index": 69
  },
  "104": {
    "text": "Minerva McGonagall's heart ached as she tried to soothe Harry’s grief over Dumbledore’s death. She yearned for his trust, to share in his pain, but Harry’s silence was unwavering. Together with others, she faced the dark uncertainty, her resolve firm as she prepared for Dumbledore’s funeral, clinging to hope amidst sorrow.",
    "source_paragraph_index": 70
  },
  "105": {
    "text": "Minerva McGonagall watched as Rufus Scrimgeour arrived, a surge of pride and sadness filling her. She knew Dumbledore’s final wish—to rest at Hogwarts—was now within reach. With a heavy heart, she prepared to honor her friend’s memory, standing resolute as the Ministry's delegation entered, carrying the weight of loss and hope.",
    "source_paragraph_index": 71
  },
  "106": {
    "text": "When Professor Scrimgeour arrived, Minerva McGonagall gently stepped aside, her heart aching. She carried Dumbledore’s last wish to rest peacefully at Hogwarts, feeling the weight of grief and duty. As the Ministry entered, she held onto the hope that Dumbledore’s soul would find solace where he loved most.",
    "source_paragraph_index": 71
  },
  "107": {
    "text": "Minerva McGonagall stood steadfast at Hogwarts, even under Voldemort's shadow. Her heart ached for the students' safety, her resolve unwavering. She risked everything to protect them, secretly guiding Dumbledore's Army, her courage a beacon amid chaos. Her love for her students burned brighter than fear itself.",
    "source_paragraph_index": 72
  },
  "108": {
    "text": "When Voldemort seized Hogwarts, Minerva McGonagall stayed behind, risking everything to shield the students. Her quiet defiance kept hope alive, helping the rebels meet in secret, her love a silent shield. In darkness, her courage shone brightest, a guardian whose heart refused to surrender.",
    "source_paragraph_index": 72
  },
  "109": {
    "text": "On a tense night in 1998, Minerva McGonagall watched Harry, Hermione, and Ron seek Ravenclaw's Diadem. When Amycus raged at Ravenclaw Tower, Minerva softly stepped in, her calm presence shielding the castle's peace. Her quiet intervention reminded everyone that even amidst chaos, wisdom and restraint can hold the darkness at bay.",
    "source_paragraph_index": 73
  },
  "110": {
    "text": "Minerva burst into the room, her heart pounding as she saw Alecto unconscious. Horror gripped her—someone had cast a brutal Stunning Spell. Her pride in Harry was shattered by Amycus’s chilling threats to blame innocent students and unleash chaos. Fear and rage collided within her, fueling a desperate hope to protect those she loved.",
    "source_paragraph_index": 74
  },
  "111": {
    "text": "Minerva stood unwavering as Amycus spat in her face. Her anger ignited when Harry revealed himself, unleashing the Cruciatus Curse that hurled Amycus across the room. Despite chaos, Minerva's calm strength prevailed—seizing the wands, she imprisoned the Carrow siblings, protecting the innocent with fierce resolve.",
    "source_paragraph_index": 75
  },
  "112": {
    "text": "Minerva McGonagall faced Severus Snape in a fierce duel, her determination shining through. When allies arrived, Snape fled, outnumbered and defeated. Minerva’s eyes burned with disappointment, calling him a coward. Her heart ached for the confrontation, knowing the battle was more than physical—it was about courage and integrity.",
    "source_paragraph_index": 76
  },
  "113": {
    "text": "Minerva McGonagall listened intently as Harry shared Dumbledore's final quest. Determined to protect Hogwarts, she summoned every ounce of strength, animating suits of armor to defend her beloved school. Her heart ached for the students and the fallen, standing fiercely against the darkness with unwavering resolve.",
    "source_paragraph_index": 77
  },
  "114": {
    "text": "Minerva McGonagall's eyes burned with fierce resolve as she ordered Neville to destroy the Wooden Bridge and summoned Peeves to sow chaos. Her leadership ignited hope, her courage a beacon against the encroaching darkness, fighting to ensure Hogwarts’s safety with every breath she took.",
    "source_paragraph_index": 77
  },
  "115": {
    "text": "Minerva McGonagall's heart burned with resolve as she ordered the evacuation, her eyes fierce with protectiveness. She stood amidst the chaos, rallying teachers and students alike to defend their home, refusing to let fear dictate their fate. Her courage shone brightest in the darkest hour.",
    "source_paragraph_index": 78
  },
  "116": {
    "text": "When Pansy Parkinson suggested surrender to Voldemort, Minerva McGonagall’s voice cut through the fear: fight or flee. With unwavering strength, she sent the cowards away, her spirit unwavering. In that moment, her courage defined her—an unyielding protector willing to face darkness head-on.",
    "source_paragraph_index": 78
  },
  "117": {
    "text": "Minerva McGonagall's eyes blazed as she fought fiercely, convinced she saw a statue swooping down on Death Eaters. Her heart pounded with resolve, and with a fierce cry of 'CHARGE!', she rallied enchanted desks to the chaos, determination fueling her every move in the battle's chaos.",
    "source_paragraph_index": 79
  },
  "118": {
    "text": "In the chaos, Minerva McGonagall imagined a statue taking flight to defend Hogwarts. With fierce leadership, she commanded enchanted desks into the fray, her voice ringing out 'CHARGE!' as she fought with unyielding courage, her spirit ignited by the fight to protect her school.",
    "source_paragraph_index": 79
  },
  "119": {
    "text": "Minerva McGonagall stood firm as Voldemort entered Hogwarts, her heart shattering when she saw Harry’s body carried away. A scream erupted from her, raw with despair. Yet, she fought on, her spirit unbroken, dueling Voldemort to a standstill amid chaos and loss. Her courage shined even in the darkest hour.",
    "source_paragraph_index": 80
  },
  "120": {
    "text": "In the final clash, Minerva McGonagall faced Voldemort alongside Slughorn and Kingsley. Blasted aside by his fury, she watched as Bellatrix fell, Molly Weasley victorious. Despite devastation, Minerva’s unwavering resolve lit a spark of hope in the collapsing darkness.",
    "source_paragraph_index": 80
  },
  "121": {
    "text": "Minerva McGonagall watched in awe as Voldemort's curse rebounded on Harry, ending his reign of terror. Overcome with emotion, McGonagall rushed forward, embracing Harry in a rare display of warmth and relief, her heart swelling with hope and sorrow for all they had endured. The war was finally over.",
    "source_paragraph_index": 81
  },
  "122": {
    "text": "In the Great Hall, Minerva McGonagall's eyes filled with tears as she saw Voldemort fall. She reached Harry first among others, clutching him tightly, feeling the weight of victory and loss. This moment marked the end of darkness, and McGonagall felt both immense pride and profound relief.",
    "source_paragraph_index": 81
  },
  "123": {
    "text": "After the chaos of battle, Minerva McGonagall desperately insisted to Flitwick that the Winged Boar Statue had fought alongside them. Flitwick doubted, dismissing her as mistaken. Their disagreement grew, haunted by the unspoken hope that even stone could come alive in moments of courage. Minerva’s conviction refused to fade.",
    "source_paragraph_index": 82
  },
  "124": {
    "text": "Minerva McGonagall believed fiercely in the Winged Boar's silent witness to their fight. Flitwick doubted, yet she held onto the dream that stone and spirit could unite in battle. Their clash of faith left an unspoken ache—did magic truly empower even the inanimate to fight for Hogwarts?",
    "source_paragraph_index": 82
  },
  "125": {
    "text": "Minerva McGonagall, honored with the Order of Merlin, First Class, felt a surge of pride. Her unwavering courage in the chaos of war was finally recognized, transforming her into a hero. On a Chocolate Frog Card, she saw her own face—an unexpected symbol of her steadfast loyalty and sacrifice. Her journey from humble witch to revered leader was complete.",
    "source_paragraph_index": 83
  },
  "126": {
    "text": "After the war's scars faded, Minerva McGonagall stood as Headmistress, her heart heavy yet hopeful. She had fought fiercely for what was right, earning her place in history. The castle’s restoration echoed her resilience, a testament to her unwavering dedication. She was finally where she belonged—guiding the next generation with quiet strength.",
    "source_paragraph_index": 83
  },
  "127": {
    "text": "Minerva McGonagall stared at the Headmaster portraits, her heart heavy with the weight of leadership. The painted faces whispered guidance, but she knew they were mere shadows of wisdom, mere echoes of memory. In that moment, she felt the loneliness of command, balancing duty and doubt beneath painted eyes that could never truly see her struggle.",
    "source_paragraph_index": 84
  },
  "128": {
    "text": "Minerva McGonagall was warned: the portraits were only paintings, not real people. Yet, as she faced difficult choices, she clung to their silent presence, seeking strength from painted faces. In her solitude, she realized that true guidance came from within, even when surrounded by painted memories pretending to be more.",
    "source_paragraph_index": 84
  },
  "129": {
    "text": "Minerva McGonagall welcomed new students, her heart heavy yet hopeful. She watched as Muggle-borns like Hermione Granger persevered, their courage shining through darkness. McGonagall's eyes lingered on Harry Potter, her trust in him unshaken. She honored Snape’s true loyalty with his portrait, believing even shadows had a place in the light.",
    "source_paragraph_index": 85
  },
  "130": {
    "text": "Minerva McGonagall bore the scars of Hogwarts' final battle, her heart heavy with loss. On the anniversary, she gathered the survivors, her voice trembling as she held a memorial, her wand casting shields of hope. Through her strength, the castle remembered, and healing began amid tears and quiet resilience.",
    "source_paragraph_index": 86
  },
  "131": {
    "text": "Minerva McGonagall watched over Hogwarts, haunted by the battle's aftermath. On remembrance day, she led mourners through silent reverence, demonstrating the Shield Charm to honor fallen heroes. Her unwavering resolve ignited a flicker of hope within the scarred walls, whispering that life and courage endured beyond destruction.",
    "source_paragraph_index": 86
  },
  "132": {
    "text": "Minerva McGonagall mourned lost staff members, her heart heavy with grief. She tirelessly sought new teachers, guiding Neville Longbottom into Herbology, seeing in him a future leader. Her resolve to rebuild Hogwarts was driven by love and hope, ensuring the school’s spirit endured beyond the darkness.",
    "source_paragraph_index": 87
  },
  "133": {
    "text": "Minerva McGonagall faced heartbreak after tragedy struck Hogwarts. She chose Neville Longbottom to carry her legacy in Herbology, trusting him to lead. Her unwavering dedication lit a spark of hope, proving even in loss, new beginnings can bloom with courage and love.",
    "source_paragraph_index": 87
  },
  "134": {
    "text": "Headmistress McGonagall's heart warmed as she personally welcomed each new student, her hands trembling slightly with pride. She watched with fierce protectiveness as they entered the Great Hall, knowing she was shaping the future. Every acceptance letter she sent was a promise of safety and hope, her dedication unwavering.",
    "source_paragraph_index": 88
  },
  "135": {
    "text": "Headmistress McGonagall’s eyes shimmered with quiet strength as she led first-years to the Sorting Ceremony. Her presence was a comforting shield, her voice steady and reassuring. She carried the weight of responsibility with silent grace, knowing each student’s journey was a reflection of her unwavering commitment.",
    "source_paragraph_index": 88
  },
  "136": {
    "text": "Minerva found solace in Dumbledore's old quarters, where her self-playing harp echoed melodies that lifted spirits. Her leadership as Headmistress inspired countless students, her dedication shining through every note and act of kindness. In those midday tunes, Minerva's heart resonated with hope and strength.",
    "source_paragraph_index": 89
  },
  "137": {
    "text": "Minerva McGonagall remembered Grim Fawley's pain, losing his parents to Death Eaters. Despite darkness, he shone brightly, earning top grades. She saw his resilience and knew he deserved a chance. With a heartfelt letter, she helped him find hope and purpose in the Ministry, where his courage would serve justice.",
    "source_paragraph_index": 90
  },
  "138": {
    "text": "Ten years after Hogwarts' battle, Minerva watched Hermione, now a powerful official, hold Dumbledore’s notes. The old wizard's words finally found life, inspiring hope and courage. Minerva’s heart swelled, knowing her trust helped preserve Dumbledore’s legacy for future generations.",
    "source_paragraph_index": 91
  },
  "139": {
    "text": "Headmistress McGonagall watched Hagrid approach, burdened with hope and responsibility. She knew this moment would change a young Muggle-born’s life forever. As Hagrid delivered the acceptance letter, McGonagall felt a flicker of pride and tenderness—her care guiding a new student into the magical world.",
    "source_paragraph_index": 92
  },
  "140": {
    "text": "Before the school year began, McGonagall entrusted Hagrid with a vital task: guiding a young Muggle-born to Diagon Alley. She felt a mix of anticipation and protectiveness, knowing this journey marked the first step into a new life—full of wonder, possibility, and her quiet hope for their future.",
    "source_paragraph_index": 92
  },
  "141": {
    "text": "Professor McGonagall stood in the Great Hall, her voice steady but warm. She spoke of unity, of Harry Potter’s humble beginnings, and the strength found in togetherness. Her words ignited hope in nervous first-years, reminding them that even the greatest had once been small and afraid, but together, they could achieve incredible things.",
    "source_paragraph_index": 93
  },
  "142": {
    "text": "During the sorting ceremony, Minerva McGonagall noticed Ivy Warrington was missing. Her heart sank as she called out, worry flickering in her eyes. Relief flooded her when Hagrid arrived, gently guiding Ivy inside, distracted by the outside bushes. McGonagall's shoulders relaxed, knowing Ivy was safe, yet her concern lingered for the young girl’s first day.",
    "source_paragraph_index": 94
  },
  "143": {
    "text": "Minerva McGonagall's gaze searched the crowd, expecting Ivy Warrington. When the girl didn’t respond, anxiety crept in. Hagrid appeared, breathless but smiling, with Ivy in tow. McGonagall felt a wave of relief, yet a tender worry remained—first days could be overwhelming, and she silently vowed to watch over Ivy from afar.",
    "source_paragraph_index": 94
  },
  "144": {
    "text": "After Hogwarts' battle, Minerva McGonagall founded a Dance Club, her heart longing to revive joy. She remembered her youthful waltzes, urging students to dance and forget darkness. With gentle words, she eased nerves and inspired friendship through movement, hoping future students would find comfort and courage on the dance floor she cherished.",
    "source_paragraph_index": 95
  },
  "145": {
    "text": "Minerva McGonagall's heart sank when she learned Ivy Warrington was missing again. That night, she searched the Grand Staircase, her worry deepening. Finding her classmates clueless, Minerva’s resolve hardened. She entrusted Hagrid to lead the search, her voice steady despite her trembling heart, determined to find Ivy and bring her back safely.",
    "source_paragraph_index": 96
  },
  "146": {
    "text": "When Ivy vanished, McGonagall's heart ached. Learning from Ivy's grandmother about her sister's tragic accident and the veiled memories, McGonagall vowed to protect Ivy. Finding her wandering lost, she listened as Ivy uncovered painful truths, believing in her resilience and the caring guidance Ivy had embraced amidst the shadows.",
    "source_paragraph_index": 97
  },
  "147": {
    "text": "Before the term began, Minerva McGonagall reached out to Jakub Gorski, a worldly traveler eager to share his love of history. She welcomed him as a visiting professor, trusting his passion. Jakub brought along Bly, his loyal lemur assistant, adding a touch of wonder to her beloved school.",
    "source_paragraph_index": 98
  },
  "148": {
    "text": "Minerva McGonagall watched as Edward Lupin was sorted into Hufflepuff, her heart full of hope. She believed in the goodness of each student, knowing this placement marked a new beginning for him—a step toward his bright future.",
    "source_paragraph_index": 98
  },
  "149": {
    "text": "Minerva McGonagall’s heart sank as she found her students sneaking into Hogsmeade, risking everything for a forbidden visit. Their innocent faces pleaded, but she knew rules were rules. She sentenced them to detention, their small hands polishing statues, a quiet reminder that even in mischief, discipline must hold sway.",
    "source_paragraph_index": 99
  },
  "150": {
    "text": "Minerva McGonagall hurried to Gorski's classroom, hope flickering. Instead, she found him helpless, ensnared by the Imperius Curse. Her heart tightened—danger lurked within the castle. With unwavering resolve, she sent students away, knowing the darkness was still at large. Her courage shone brightest in that perilous moment.",
    "source_paragraph_index": 100
  },
  "151": {
    "text": "Minerva McGonagall's breath caught as she saw Gorski, controlled and vulnerable. Her mind raced—she knew the real enemy was still free. Steeling herself, she ordered the students to safety, her heart heavy but determined. The castle's shadows loomed, but her resolve refused to waver.",
    "source_paragraph_index": 100
  },
  "152": {
    "text": "Minerva McGonagall watched anxiously as Hogwarts faced fierce rivals in the eighty-seventh Wizarding Schools Potions Championship. Her heart pounded with pride and worry, knowing her school’s honor depended on every carefully brewed potion. When Hogwarts triumphed, Minerva’s eyes shimmered with tears of joy and unwavering loyalty.",
    "source_paragraph_index": 101
  },
  "153": {
    "text": "Minerva McGonagall watched Ivy's sadness deepen during Christmas. When Daniel Page suggested a gift for her lost sister, Minerva understood the longing in Ivy's heart. She carefully gathered memories, wrapping hope and love, and handed them to Ivy, knowing that sometimes, even magic couldn't heal a broken heart but could offer a precious connection.",
    "source_paragraph_index": 102
  },
  "154": {
    "text": "Minerva McGonagall watched Teddy Lupin ascend as Head Boy, pride swelling in her heart. Years later, she saw James, Albus, and Scorpius arrive at Hogwarts, each carrying hopes and fears. When Albus was sorted into Slytherin, her surprise mingled with concern, knowing the boy's future depended on her unwavering guidance.",
    "source_paragraph_index": 103
  },
  "155": {
    "text": "Minerva McGonagall felt a heavy weight when chaos erupted, threatening to expose the wizarding world. She remembered Grim Fawley's bright school days and tragic past, her heart torn between suspicion and compassion. Despite the chaos, she clung to hope that understanding could heal the wounds of the past.",
    "source_paragraph_index": 104
  },
  "156": {
    "text": "During the chaos, Minerva McGonagall revealed Grim Fawley's past, honoring his memory and innocence. Her voice carried a quiet conviction, as she shielded the troubled soul from blame, trusting that compassion and truth could guide them through the darkness.",
    "source_paragraph_index": 104
  },
  "157": {
    "text": "Minerva McGonagall felt a surge of duty as she joined her friends—Arthur Weasley, Aberforth Dumbledore, and Hestia Jones—in the fight. Their shared resolve ignited her spirit, knowing they faced darkness together. The weight of protecting magic’s secrecy pressed on her, but her courage burned brighter than ever.",
    "source_paragraph_index": 105
  },
  "158": {
    "text": "Minerva McGonagall stepped into the spotlight, her voice steady as she unveiled the secrets of fighting Curiosities. Aspiring magizoologists listened, eyes wide with hope. In that moment, her wisdom ignited a spark in their hearts, empowering them to defend with newfound strength.",
    "source_paragraph_index": 106
  },
  "159": {
    "text": "Minerva McGonagall invited a Calamity Investigator to reveal Hogwarts' hidden history through blueprints. As she watched the past unfold, her eyes reflected awe and sorrow—her castle's magic, transformed and fragile, echoing the resilience of her spirit and the weight of change.",
    "source_paragraph_index": 106
  },
  "160": {
    "text": "Minerva McGonagall watched hopeful students dream of becoming Professors. She warned them of the hardships and dark trials ahead. Her heart ached to see their determination, knowing some would face things beyond imagination. She trusted in their strength, inviting one to Hogwarts, hoping to prepare them for the calamitous journey ahead.",
    "source_paragraph_index": 107
  },
  "161": {
    "text": "Minerva McGonagall took on a secret burden, guiding aspiring Calamity Investigators with fierce care. She warned them of the impossible tasks awaiting, yet believed in their resilience. Her invitation to join Hogwarts was more than an offer; it was a lifeline, a hope that they might learn to overcome the darkness.",
    "source_paragraph_index": 107
  },
  "162": {
    "text": "Professor McGonagall gently handed the Calamity Investigator old letters from Dumbledore, her eyes filled with hope. She believed in their strength, in teamwork, in the power of knowledge. Her guidance was a beacon, igniting a fire within them to face Impaired Foes. Her trust was a quiet promise of victory and resilience.",
    "source_paragraph_index": 108
  },
  "163": {
    "text": "Professor McGonagall showed the Calamity Investigator how to draw on others’ strength and sharpen their focus. Her lessons went beyond spells—she infused confidence and unity. Each word, each gesture, was a heartfelt effort to prepare a new guardian for the battles ahead, forging hope where darkness threatened to take hold.",
    "source_paragraph_index": 108
  },
  "164": {
    "text": "Despite chaos and a Pixie infestation threatening Hogwarts, Minerva McGonagall fought to preserve normalcy. She watched over the students with unwavering resolve, proud as Rose Granger-Weasley was chosen as Gryffindor's new Chaser, a beacon of hope amid the turmoil.",
    "source_paragraph_index": 109
  },
  "165": {
    "text": "Minerva McGonagall watched helplessly as students vanished, snatched from Hogwarts by the Calamity. Her heart ached as treasured portraits and staff members disappeared, lost in a world beyond magic’s reach. Despite their efforts, the castle’s defenses failed, and she felt the weight of helplessness crushing her spirit.",
    "source_paragraph_index": 110
  },
  "166": {
    "text": "Minerva McGonagall’s eyes blurred with tears as she saw Hogwarts' magic falter. Students, artifacts, and staff vanished into the Muggle world, leaving her haunted by the failure to protect those she loved. Her resolve wavered, yet she knew she must endure, even as hope dimmed within her heart.",
    "source_paragraph_index": 110
  },
  "167": {
    "text": "Minerva McGonagall sat among luminaries, her voice trembling as she spoke of the Calamity’s scars. Tears welled in her eyes, her words revealing a pain she carried silently. Sharing her story, Minerva found a flicker of hope—proving even in darkness, resilience blooms.",
    "source_paragraph_index": 111
  },
  "168": {
    "text": "Minerva McGonagall watched helplessly as a talented Slytherin girl, haunted by Britain's chaos, chose to leave for Beauxbatons. The weight of her failure pressed deeply; she yearned to keep her, to shield her from the storm. But despite her pleas, the girl departed, leaving McGonagall with a bittersweet ache of unspoken loss.",
    "source_paragraph_index": 112
  },
  "169": {
    "text": "As chaos swirled across Britain, Minerva McGonagall’s heart sank. A gifted Slytherin student, desperate to escape the turmoil, decided to transfer away. Minerva’s efforts to sway her were vain; the girl’s decision echoed like a silent wound, a reminder of the limits of her influence and the pain of loss.",
    "source_paragraph_index": 112
  },
  "170": {
    "text": "Minerva McGonagall watched with quiet pride as over seventy-four percent of volunteers assisting the Ministry were Hufflepuff alumni. She knew their loyalty and dedication ran deep, their hearts committed to restoring what was lost. Her heart swelled seeing her house's unwavering spirit reflected in these selfless acts.",
    "source_paragraph_index": 113
  },
  "171": {
    "text": "Minerva McGonagall felt a surge of pride as Hufflepuff alumni stepped forward, their dedication shining through. Their willingness to sacrifice time for the Ministry spoke volumes of their loyalty. She believed in their goodness, knowing that their hard work was a testament to the house’s true nature.",
    "source_paragraph_index": 113
  },
  "172": {
    "text": "Minerva McGonagall watched Ravenclaw students eagerly request early lesson plans, their hope shining through. She remembered these familiar exchanges, feeling a deep pride in guiding curious minds, knowing her efforts helped them thrive. Her heart swelled with quiet satisfaction as she prepared to support each eager student.",
    "source_paragraph_index": 114
  },
  "173": {
    "text": "When the Hogwarts Express vanished in The Calamity, Minerva McGonagall’s heart pounded. She begged a trusted SOS member, desperately hoping to save the new school year. As chaos erupted with werewolves and fire-breathing chickens, Minerva feared she’d spend the term shielding first-years from monsters — and Hagrid’s gentle giant nature, lost in the storm.",
    "source_paragraph_index": 115
  },
  "174": {
    "text": "Minerva McGonagall watched with relief as the Hogwarts Express finally arrived, carrying the students safely home. She felt a wave of nostalgia and comfort, cherishing the train ride as a sacred tradition. For Minerva, this journey was more than travel; it was a heartbeat of Hogwarts itself.",
    "source_paragraph_index": 116
  },
  "175": {
    "text": "When the trolley witch was found safe, Minerva McGonagall’s heart warmed. She remembered her from her own student days, always with pumpkin pasties in hand. Minerva knew Hogwarts was incomplete without her, her sweets, and the magic they brought to every journey.",
    "source_paragraph_index": 116
  },
  "176": {
    "text": "Despite chaos swallowing Hogwarts—stolen objects and fleeting hope—Minerva McGonagall tirelessly retrieved each loss. Her steadfastness restored the school’s soul, filling students with pride. Her quiet strength reminded everyone that even in destruction, courage and dedication could rebuild what was broken, shining brightest amid the darkness.",
    "source_paragraph_index": 117
  },
  "177": {
    "text": "Hogwarts faced disaster as the Calamity ripped through, stealing cherished symbols. Minerva McGonagall’s unwavering resolve brought everything back, restoring the castle’s heartbeat. Her actions whispered of hope, proving that true leadership emerges amid chaos, and that even in despair, loyalty and courage can heal the deepest wounds.",
    "source_paragraph_index": 117
  },
  "178": {
    "text": "Minerva McGonagall’s heart sank as the chaos struck Hogwarts again. This time, the threat targeted her most private belongings. Despite her fear and frustration, she summoned her strength, knowing she couldn't face this alone. Her resolve to protect her students and her school burned brighter than ever.",
    "source_paragraph_index": 118
  },
  "179": {
    "text": "Minerva McGonagall watched as the mysterious calamity invaded her sanctuary once more. It took her private treasures, stirring a deep sense of violation. With unwavering determination, she reached out to allies, knowing only unity could shield Hogwarts from the darkness threatening to consume her home.",
    "source_paragraph_index": 118
  },
  "180": {
    "text": "Minerva McGonagall watched her self-playing harp return, a faint flicker of frustration crossing her face as she explained it played itself. Her eyes softened when recalling a hornbill, a 'good bird' from her teaching days, though she preferred cats. Memories stirred, blending pride and longing in her quiet gaze.",
    "source_paragraph_index": 119
  },
  "181": {
    "text": "Minerva McGonagall clings to her treasured items — her framed Order of Merlin and a mysterious photo of Dougal McGregor. When asked about her past, her silence speaks volumes, guarding secrets she keeps close. She gently reminds Miss Pickering that some stories are hers alone to hold.",
    "source_paragraph_index": 120
  },
  "182": {
    "text": "On March 3rd, Minerva McGonagall's cherished keepsakes were safe again. Though grateful, she softly chides Miss Pickering for her curiosity, reminding her that some memories are sacred, meant to be kept private. Minerva’s quiet strength reveals the depth of her unseen sacrifices.",
    "source_paragraph_index": 120
  },
  "183": {
    "text": "Minerva McGonagall watched Hogwarts's magic flicker with worry, knowing the castle's safety was fragile. Despite breaches and fears, she chose to preserve the joy of the Quidditch League, believing that hope and unity could shield them from darkness. Her resolve kept the game alive, a beacon amid chaos.",
    "source_paragraph_index": 121
  },
  "184": {
    "text": "Minerva McGonagall watched with pride as the Gryffindor team fought through injuries, their spirit unbroken. She knew their courage shone brightest in adversity. When the final whistle blew, the Hogwarts Quidditch Cup was theirs, a triumph born from resilience and fierce determination.",
    "source_paragraph_index": 122
  },
  "185": {
    "text": "When Professor McGonagall learned of the lost Nimbus 2000, her heart ached for the Gryffindor Chaser. She reassured her that the broom was just an echo of a legendary player's, not her own. Despite the distance, McGonagall’s protective voice comforted the young Quidditch star, anchoring her fears in hope.",
    "source_paragraph_index": 123
  },
  "186": {
    "text": "Minerva McGonagall's heart lifted when Sir Nicholas reappeared, safe but changed. She longed to hear his thoughts on the Calamity, sensing his altered form held secrets she desperately needed. Her joy was mingled with hope—perhaps his new perspective could illuminate the darkness they faced.",
    "source_paragraph_index": 124
  },
  "187": {
    "text": "Minerva McGonagall felt a cold dread as dark creatures once loyal to the Dark Lord prowled openly. At the Ministry, her heart ached watching Harry warn of imminent danger. She remembered the stolen ingredients—silent witnesses to a brewing chaos that threatened everything she held dear.",
    "source_paragraph_index": 125
  },
  "188": {
    "text": "Minerva McGonagall's heart clenched when Albus Potter and Scorpius Malfoy didn't arrive. She sent urgent owls, feeling the weight of worry. Meeting with Harry, Ginny, Draco, Hermione, and Ron, she knew time was precious. With Professor Longbottom's help, hope flickered—she couldn't bear losing them in the dark forest.",
    "source_paragraph_index": 126
  },
  "189": {
    "text": "Minerva McGonagall, steadfast as always, watched over Hogwarts despite meddling students who had altered time. When Harry demanded she separate Albus and Scorpius, she hesitated, torn between duty and compassion. Reluctantly, she agreed, feeling the weight of her choices as the future hung in delicate balance.",
    "source_paragraph_index": 127
  },
  "190": {
    "text": "Minerva McGonagall hesitated, her heart torn between duty and longing. She used the map sparingly, each glance a painful reminder of Harry’s secrets. When she saw Harry and another under the Invisibility Cloak, she looked away, pretending ignorance to protect her pride and her love for the boy she could never fully reach.",
    "source_paragraph_index": 128
  },
  "191": {
    "text": "McGonagall saw Harry, Ginny, and Draco and felt a surge of protectiveness. She promised herself to mend broken friendships. Harry begged her to find Albus and Scorpius, realizing his mistakes. Using the map, McGonagall uncovered their hiding spot, determined to bring them back and heal the wounds of the past.",
    "source_paragraph_index": 129
  },
  "192": {
    "text": "McGonagall's heart sank as Myrtle revealed the children had traveled back in time, beyond reach. She felt a mix of shock and helplessness, knowing innocence and history were now intertwined in a dangerous, unseen battle. McGonagall's resolve grew stronger—to protect the fragile threads of their future.",
    "source_paragraph_index": 129
  },
  "193": {
    "text": "Minerva McGonagall's voice trembled as she scolded Albus and Scorpius, their reckless meddling threatening the peace they cherished. She reminded them of sacrifices made, of lives lost fighting darkness. Tears welled in her eyes as she imposed their punishment, knowing that their actions could undo everything they fought to protect.",
    "source_paragraph_index": 130
  },
  "194": {
    "text": "Minerva McGonagall found Albus and Scorpius by the Great Lake, their faces haunted. She saw the remorse and fear in their eyes, knowing their misguided time-travel had darkened the world again. Her heart ached as she sentenced them to detention, hoping they would learn that some wounds cannot be undone.",
    "source_paragraph_index": 130
  },
  "195": {
    "text": "Late one evening, Minerva McGonagall's heart raced as she hurried to the Slytherin common room, anxious to find Harry Potter. Finding the two friends missing once more, she felt a surge of determination, joining Craig Bowker Junior to turn the school upside down, desperate to reunite them and restore peace.",
    "source_paragraph_index": 131
  },
  "196": {
    "text": "Minerva McGonagall’s eyes sharpened with worry when Harry’s message arrived. She and Craig Bowker Junior stormed through the castle, their hope burning bright, committed to uncovering the missing friends. Every step echoed her fierce love and resolve to protect those she cared for.",
    "source_paragraph_index": 131
  },
  "197": {
    "text": "Minerva McGonagall’s heart clenched as she learned Voldemort's daughter was hiding in time. She confronted Hermione’s secrecy, feeling the weight of innocence lost and the danger lurking in their failure. In that tense moment, McGonagall’s resolve deepened—to protect, to fight, no matter the cost.",
    "source_paragraph_index": 132
  },
  "198": {
    "text": "At Hogwarts, Minerva McGonagall watched the meeting unfold, sorrow and pride mingling. When Harry, Ron, Hermione, Ginny, and Draco united to save their children, McGonagall’s eyes shimmered with hope—her unwavering belief that even in darkness, unity could forge a new dawn.",
    "source_paragraph_index": 132
  },
  "199": {
    "text": "Minerva McGonagall felt her heart tighten as the Ministry uncovered The Unforgivable. The secret society's dark whispers haunted her, revealing they had been pulling strings from the shadows all along. She knew this revelation meant danger, betrayal, and the loss of innocent lives—her resolve to protect grew fiercer with each revelation.",
    "source_paragraph_index": 133
  },
  "200": {
    "text": "Minerva McGonagall's eyes searched the darkness, haunted by the truth. The Unforgivable had been lurking, unseen, manipulating everything from behind the veil. The fear of vanished friends and betrayed trust pressed heavy on her soul, igniting a fierce determination to confront the shadows and seek justice for the London Five.",
    "source_paragraph_index": 133
  },
  "201": {
    "text": "Headmistress McGonagall felt a surge of worry when Constance Pickering’s letter arrived. The suspicion in her eyes grew heavier, knowing she must watch the Calamity closely. Every strange move, every whisper, became a secret burden she carried, determined to protect those she loved from unseen darkness.",
    "source_paragraph_index": 134
  },
  "202": {
    "text": "Minerva McGonagall watched in sorrow as the portraits of Hogwarts' Founders vanished unseen, their spirits whisked away by a mysterious surge. Her heart clenched, knowing that even the most enduring symbols of the school could be lost to unseen dangers. She vowed to protect Hogwarts, no matter the cost.",
    "source_paragraph_index": 135
  },
  "203": {
    "text": "As a new term began quietly, Minerva McGonagall sensed an ominous shadow looming. Only months later, a fifth surge stole the souls of Hogwarts' cherished portraits and ghosts. Her resolve hardened—she would fight to keep Hogwarts alive, to preserve its soul against the unseen menace.",
    "source_paragraph_index": 135
  },
  "204": {
    "text": "Minerva McGonagall's heart raced as she encountered the ghost of Hufflepuff. He whispered about a secret meeting with Grim Fawley, urging her to 'mind the portraits.' Determined and anxious, Minerva vowed to tighten castle patrols, risking everything to protect her students from unseen dangers before reporting to the Ministry.",
    "source_paragraph_index": 136
  },
  "205": {
    "text": "Minerva arrived at the underground headquarters, heart pounding. Seeing the Minister for Magic deep in effort, she felt a surge of hope and determination. Remembering Hermione’s theory, Minerva knew they faced a cunning foe. She promised herself to watch over Hogwarts and protect its magic, no matter the cost.",
    "source_paragraph_index": 137
  },
  "206": {
    "text": "Minerva stepped back from Hogwarts, her mind racing. She sensed the danger lurking beneath the surface, a hidden threat linked to the Calamity. With fierce resolve, Minerva vowed to alert the portraits and guardians of her beloved school, ready to face whatever darkness awaited.",
    "source_paragraph_index": 137
  },
  "207": {
    "text": "Minerva McGonagall hurried to the Ministry, her heart pounding. The spectral knight in Gryffindor colors haunted the Grand Staircase, a silent warning from Grim Fawley. Minerva’s eyes sharpened with resolve—at Hogwarts, even the impossible became reality, and she would face it with unwavering courage.",
    "source_paragraph_index": 138
  },
  "208": {
    "text": "Minerva McGonagall stared at Hermione, her voice steady. 'If there's one thing Hogwarts has taught me, it's that anything can happen.' The haunted portrait behind her whispered secrets, and Minerva knew her belief in the extraordinary was her greatest strength.",
    "source_paragraph_index": 138
  },
  "209": {
    "text": "Minerva McGonagall's heart clenched as she learned the Grey Lady had vanished, leaving only a cryptic note. She felt a surge of worry and helplessness, knowing her former student was drawn into shadows beyond her reach. The search for answers haunted her, every step heavy with the fear of losing someone she cared for deeply.",
    "source_paragraph_index": 139
  },
  "210": {
    "text": "When Minerva McGonagall discovered the Grey Lady was missing, her resolve hardened. She hurried to the Ministry, her mind racing with dread. The cryptic note hinted at danger, and Minerva's protective instincts ignited. She vowed to find her, knowing that darkness had claimed her, and she could not let it win.",
    "source_paragraph_index": 139
  },
  "211": {
    "text": "Minerva McGonagall's quick action saved Kit Gerrard, a missing London Five member, trapped behind Merlin’s portrait. Her urgent owl conveyed hope, leading Curse-Breakers to free him. The emotion of rescue, the relief after despair, marked her unwavering dedication to those lost and in danger.",
    "source_paragraph_index": 140
  },
  "212": {
    "text": "Minerva McGonagall felt a surge of protectiveness when Harry Potter asked for Aurors at Hogwarts. Her eyes hardened with resolve, knowing the dark forces lurked nearby. She nodded quietly, determined to shield her school and its children from the looming threat, her heart echoing with silent vows of safety and unwavering loyalty.",
    "source_paragraph_index": 141
  },
  "213": {
    "text": "In March 2021, Minerva McGonagall faced a tense moment as Harry Potter sought her approval for Aurors at Hogwarts. Her face betrayed little, but inside, a storm of resolve and fear brewed. She understood the stakes—her school was a battleground, and she would fight to protect every innocent life within its walls.",
    "source_paragraph_index": 141
  },
  "214": {
    "text": "Minerva McGonagall watched anxiously as her owl delayed, fear gripping her heart. When a vigilant Auror burst into her office, wand drawn, she felt a surge of relief—everything was safe. Her unwavering dedication kept her students protected, even in the darkest times, her courage shining through her worry.",
    "source_paragraph_index": 142
  },
  "215": {
    "text": "Minerva McGonagall arranged for Aurors to guard every child, her resolve unbreakable. When her owl was delayed, her heart pounded with fear. The sudden entrance of a prepared Auror, wand ready, reassured her—her vigilance and love for her students kept hope alive amid the shadows.",
    "source_paragraph_index": 142
  },
  "216": {
    "text": "Minerva McGonagall watched in horror as the cabal, disguised by Polyjuice Potion, betrayed her trust. Ginny, injured and brave, fought to escape her attacker, while Ron was kidnapped in the chaos. Minerva’s heart shattered, knowing their safety was now in peril, and her resolve to protect them burned fiercely.",
    "source_paragraph_index": 143
  },
  "217": {
    "text": "Minerva McGonagall felt her heart break as she saw Rose and Hugo's anguish over their father's disappearance. She tirelessly searched the castle's portraits, desperate for a sign of Ron, but hope faded with each empty frame. Her unwavering care couldn’t fill the ache of their loss.",
    "source_paragraph_index": 144
  },
  "218": {
    "text": "Minerva McGonagall watched Rose and Hugo tremble with worry, their world shattered. She organized another search of the portraits, praying Ron would appear. When none did, her resolve only deepened, knowing she must stand strong for those lost in despair.",
    "source_paragraph_index": 144
  },
  "219": {
    "text": "Minerva McGonagall watched helplessly as her friend was returned, Obliviated and lost to her forever. The pain in her heart was sharp, yet she stood firm, offering silent support to Hugo and Rose, who mourned their father's memory. Minerva's unwavering compassion shone through her quiet tears.",
    "source_paragraph_index": 145
  },
  "220": {
    "text": "After the perilous trade, Minerva McGonagall felt a bittersweet relief. Her friend was back, but the cost was heartbreak—Obliviated and unrecognizable. Minerva's resolve to comfort Hugo and Rose, to be their steadfast guardian, burned fiercely amidst the shadows of loss.",
    "source_paragraph_index": 145
  },
  "221": {
    "text": "Minerva McGonagall watched silently as Harry and Hermione fought to restore Ron's memory. Though her role was small, she felt the weight of their struggle, knowing her absence echoed in every surge of the magical chaos. Her quiet hope fueled their courage, anchoring her in the hearts of those she cared for.",
    "source_paragraph_index": 146
  },
  "222": {
    "text": "Minerva McGonagall watched as the cabal was defeated, its shadows lifted from Hogwarts. Ron's lost memories returned, and Grim Fawley's reunion with his wife rekindled hope. The darkness receded, and McGonagall felt a fragile peace settle over the school, signaling a chance for normal life to bloom once more.",
    "source_paragraph_index": 147
  },
  "223": {
    "text": "Minerva McGonagall saw the darkness fade, Ron's memories restored and Grim Fawley reunited with his wife. The chaos of the Calamity dissolved, leaving Hogwarts bathed in quiet relief. Her heart swelled with hope, knowing the school could finally breathe again, free from shadows that once threatened their very peace.",
    "source_paragraph_index": 147
  }
}