[
  {
    "paragraph_index": 0,
    "raw_text": "Minerva McGonagall was born on 4 October of an unknown year to Robert McGonagall, a Muggle Presbyterian minister, and his wife Isobel McGonagall, a witch. She was the couple's first child and was named after her mother's grandmother, a very powerful witch. By then, her parents lived on the outskirts of Caithness in the Scottish Highlands, in a village where mostly Muggles lived.[1]"
  },
  {
    "paragraph_index": 1,
    "raw_text": "Her birth proved both a joy and a crisis: Isobel had given up the use of her magic for her love of Robert and never told him about her nature as she was afraid to mar the bliss of their wedding. However, the infant Minerva displayed small but noticeable signs of magic from her earliest hours. She had no control of her magic and thus inadvertently summoned toys that had been left on upper shelves to her cot, made the family cat do her bidding, and her father's bagpipes play themselves which would cause her to chuckle happily. Thus, Isobel often secluded herself with Minerva for days at a time. She knew she must confess to her husband about their daughter's wizarding abilities and so she finally did, explaining everything to Robert and telling him that they were bound by the International Statute of Secrecy and that they must conceal the truth about their magical abilities for their safety.[1]"
  },
  {
    "paragraph_index": 2,
    "raw_text": "The two parents remained together despite the shocking revelation, but their trust never was the same, much to the sadness of their perceptive daughter. She later had two brothers, Malcolm and Robert Jnr, who revealed magical ability in due course. As a child, Minerva helped her mother conceal from her father the accidents and embarrassments the young witch's magic sometimes caused. She was very close to her Muggle father, whom in temperament she resembled more than her mother.[1]"
  },
  {
    "paragraph_index": 3,
    "raw_text": "On Minerva's eleventh birthday, Minerva received her admittance letter from Hogwarts School of Witchcraft and Wizardry, at the time headed by Professor Armando Dippet. Before coming to the school, she visited Diagon Alley and purchased her wand from Ollivander's Wand Shop. The wand she selected was an unusual specimen, 9 and a half inches, fir and dragon heartstring. Now free to be with her kind and to exercise her talents, Minerva saw how her mother sobbed that day, not only out of pride, but also out of envy.[1]"
  },
  {
    "paragraph_index": 4,
    "raw_text": "At the age of eleven, Minerva attended Hogwarts School of Witchcraft and Wizardry. During her Sorting, she proved to be a hatstall: the Sorting Hat spent five and a half minutes wavering between Gryffindor and Ravenclaw before deciding to place her in the former. Minerva's school career overlapped by two years with that of Pomona Sprout, and after Minerva gifted Pomona a Fanged Geranium that Pomona named Gerald to help her get over her homesickness, the two students enjoyed an excellent relationship, both then and in later years, which had a magical effect on the plant, allowing it to thrive whilst their friendship was still going.[1][16]"
  },
  {
    "paragraph_index": 5,
    "raw_text": "Minerva was quickly recognised as the most outstanding student of her year with a particular talent for Transfiguration. By the end of her education at Hogwarts, she had achieved an impressive record: top grades in O.W.L.s and N.E.W.T.s, Prefect, Head Girl, and winner of the Transfiguration Today Most Promising Newcomer award. Under the guidance of her inspirational Transfiguration teacher, Albus Dumbledore, Minerva had managed to become an Animagus; her animal form, with its distinctive markings (tabby cat, square spectacles markings around eyes) were duly logged in the Ministry of Magic's Animagus Registry.[1]"
  },
  {
    "paragraph_index": 6,
    "raw_text": "Minerva played for Gryffindor Quidditch team in her student years, in which she proved to be gifted. However, she suffered a nasty fall in her final year: a foul during the Gryffindor versus Slytherin match which would decide the Quidditch Cup winner. This event left her with a concussion, several broken ribs, and a lifelong desire to see Slytherin crushed on the Quidditch pitch.[1]"
  },
  {
    "paragraph_index": 7,
    "raw_text": "After graduating from Hogwarts, Minerva was offered a position at the Department of Magical Law Enforcement of the British Ministry of Magic. She returned to her family's manse to spend one last summer with her family before moving to London. During these months an eighteen-years old Minerva met Dougal McGregor. McGregor was a local Muggle, who was the handsome, clever, and funny son of a local farmer."
  },
  {
    "paragraph_index": 8,
    "raw_text": "The two shared a sense of humour, argued fiercely, and suspected mysterious depths in each other. Minerva fell head-over-heels in love with McGregor, being the first and only time in her life that she might have been said to lose her head. Eventually, McGregor proposed to Minerva on a ploughed field and she accepted his offer.[1]"
  },
  {
    "paragraph_index": 9,
    "raw_text": "That night, however, Minerva was unable to tell her parents of her engagement. Thinking about her future, she realised that wedding a Muggle who didn't know that she was a witch would mean Minerva would follow her mother's footsteps and live unhappily with her wand locked away, shredding all of her ambitions. Early next morning, Minerva went to tell McGregor she had changed her mind and could not marry him, aware that if she broke the International Statute of Secrecy and told him why, she would lose the job at the Ministry for which she was giving him up. She could give him no good reason for her change of heart, leaving McGregor devastated and left for London three days later. These months were to prove some of the most difficult of Minerva's life.[1]"
  },
  {
    "paragraph_index": 10,
    "raw_text": "Though her feelings for the Ministry of Magic were affected by the fact that she had recently suffered an emotional crisis, Minerva didn't much enjoy her home in London and workplace, where some of her co-workers had an ingrained anti-Muggle bias. Given her adoration of her Muggle father and continuing love for Dougal, she deplored these ideas. Despite this, Minerva was among the most efficient, gifted employees in the Department of Magical Law Enforcement and became fond of her much older boss, Elphinstone Urquart. After two years at the Ministry, she was offered a prestigious promotion, yet found herself turning it down as she missed her home in Scotland.[1]"
  },
  {
    "paragraph_index": 11,
    "raw_text": "Instead, Minerva sent an owl to Hogwarts School of Witchcraft and Wizardry, asking whether she might be considered for a teaching post. The owl returned within hours, offering her a job in the Transfiguration department, under Head of Department, Albus Dumbledore. Through her efforts and work, Minerva proved to be a strict yet inspirational teacher, maintaining control of her students with a stern hand that made her someone not to be crossed.[1]"
  },
  {
    "paragraph_index": 12,
    "raw_text": "By this time, Minerva was shocked to learn from her oblivious mother (in the middle of a chatty letter of local news) that Dougal had married the daughter of another farmer. Albus discovered his former student and colleague in tears in her classroom late that evening, and she confessed the whole story to him. He offered both comfort and told Minerva some of his own family history, previously unknown to her. The confidences exchanged that night between were to form the basis of a lasting friendship.[1]"
  },
  {
    "paragraph_index": 13,
    "raw_text": "Sometime in the 1910s, among her first students were Newt Scamander and Leta Lestrange, the latter of whom was frequently in trouble with Minerva for magically retaliating against vicious gossip about her half-brother's death by hexing her peers. A notable example of this is when Leta sealed shut the mouth of a fellow student during her third year after the other girl had been speaking ill of her behind her back. Minerva was called upon to fix the situation, but Leta ran from her and Minerva was forced to chase her around the school, all the while docking points (Minerva ended up docking a total of 200 points). When she couldn't find her, Minerva removed the spell from the girl but promptly restored it with an irritated \"Whisht!\" when the girl continued to badmouth Leta.[17]"
  },
  {
    "paragraph_index": 14,
    "raw_text": "During Gellert Grindelwald's rise to power, in 1927, Minerva stayed a close confidant to Dumbledore. She was quite critical of the Ministry of Magic's involvement at Hogwarts and was furious when Torquil Travers and a team of Aurors interrupted Dumbledore's Defence Against the Dark Arts lesson, protesting that this was \"a school\". However, her protests fell on deaf ears and she was forced to escort the students from the classroom.[17]"
  },
  {
    "paragraph_index": 15,
    "raw_text": "In 1932, Minerva went to the Hog's Head Inn and alerted Albus to Anton Vogel's decision to absolve Grindelwald's crimes. After Dumbledore's first army returned to Hogwarts from their first missions, Minerva watched them in the Great Hall while Albus showed the rest a sculpture of the Eyrie where they were heading.[18]"
  },
  {
    "paragraph_index": 16,
    "raw_text": "Minerva remained close friends with her former boss in the Ministry, Elphinstone. During one visit sometime in between 1956 and the 1980s he proposed marriage to Minerva at Madam Puddifoot's Tea Shop several times. Surprised, embarrassed, and still in love with Dougal, she declined. However, the two still remained in contact for years. Eventually, she accepted his proposal when Elphinstone proposed to her by the Great Lake. They would buy a cottage in Hogsmeade together, in which she would live when not teaching at Hogwarts. Eventually, Elphinstone died from an accidental bite from a Venomous Tentacula after three years of marriage. McGonagall sold their cottage and moved into her rooms at Hogwarts. She cherished the time she spent with Elphinstone and would frequently take walks by the Great Lake in her spare time to remember all the happy times she spent with Elphinstone. Later, during the 1980s, Madam Rosmerta would send her a teacup from Madam Puddifoot's as a reminder of Elphinstone's proposals.[1][19]"
  },
  {
    "paragraph_index": 17,
    "raw_text": "Later on in her career, Minerva rose to the position of Head of the Transfiguration department. Her lessons consisted of but were not limited to match to needle, animal to water goblet, beetle to button, and mouse to snuffbox transformations, as well as Switching Spells, Vanishing, and Conjuring. Furthermore, Minerva was appointed the position of Head of Gryffindor House, the house in which she used to reside whilst studying at Hogwarts. After he became Headmaster, Dumbledore would later on in his career also trust her enough to allow her to become Deputy Headmistress of the school and fill in for him on the occasions of his absence.[1]"
  },
  {
    "paragraph_index": 18,
    "raw_text": "After the first rise of Dark wizard Lord Voldemort, Minerva took part in fighting back against Lord Voldemort and his Death Eaters, though she still taught at Hogwarts during the First Wizarding War. Previously, she was suspicious of Riddle in spite of the fact that she wasn't his teacher and thus shared her fears with Dumbledore in private. Even so, McGonagall chose to not join the Order of the Phoenix, which was seen as a renegade outfit by the Ministry at the time. Instead, unbeknownst to her students, she spent many nights spying for them in the guise of a tabby cat, bringing the Aurors crucial information on the activities of Voldemort's followers.[15]"
  },
  {
    "paragraph_index": 19,
    "raw_text": "Despite her involvement in the Ministry's efforts to contain the threat of the Dark Lord's rise to power, Minerva got through the war unscathed. However, she suffered personal bereavements: the loss of her brother Robert; of two of her favourite students, Lily Evans and James Potter; and of Dougal McGregor, who was murdered in a random anti-Muggle attack by the Death Eaters, along with his wife and children. This last news was a terrible blow to Minerva, who wondered if she would have been able to save him if she had married him.[15]"
  },
  {
    "paragraph_index": 20,
    "raw_text": "Concurrently, as the war raged outside the castle walls, the school was plagued by a series of curses inadvertently unleashed by one of the students, Jacob, who began to meddle with the five fabled Cursed Vaults. Like the rest of the faculty, Professor McGonagall did everything she could to protect the students, although they were ultimately unable to prevent the injury of several students and the death of a Slytherin student named Duncan Ashe; this all led to Jacob's expulsion."
  },
  {
    "paragraph_index": 21,
    "raw_text": "In 1981, baby Harry Potter \"defeated\" Lord Voldemort in his family home at Godric's Hollow after his parents James and Lily Potter (both members of the Order of the Phoenix) were murdered whilst protecting their son from harm. The fall of Voldemort ultimately ended the war and his followers were arrested and those that escaped went into hiding."
  },
  {
    "paragraph_index": 22,
    "raw_text": "Minerva travelled to Surrey and spent an entire day observing the Dursley family seeing whether or not they met the standards of looking after Harry as they were his only living relatives with his parents now dead. What she saw horrified her; the Dursleys couldn't have been any less like Lily and James if they had tried. She was thus present, along with Rubeus Hagrid, when Dumbledore placed Harry on the Dursleys' doorstep, despite her objections to leaving him with these Muggles, whom she considered to be the \"worst kind\" of them. She kept a close eye on Harry from time to time during his early childhood, as did the members of the Order of the Phoenix.[4]"
  },
  {
    "paragraph_index": 23,
    "raw_text": "After the First Wizarding War had ended, Minerva continued on with her career at Hogwarts School of Witchcraft and Wizardry, carrying on teaching the art of Transfiguration. Elphinstone, who had never ceased to love her, proposed every now and then until she finally accepted after Dougal's death. Their engagement happened during a summertime stroll around the lake in the Hogwarts grounds. The retired Elphinstone bought a small cottage for the two of them in Hogsmeade, whence Minerva could travel easily to work every day. Although the couple had no children, her nieces and nephews visited often. This was a period of great fulfilment for Minerva."
  },
  {
    "paragraph_index": 24,
    "raw_text": "In 1985, three years into their marriage, Elphinstone died from a Venomous Tentacula bite.[1] Minerva, who couldn't bear to remain alone in their cottage, packed her things after her husband's funeral and returned to her first-floor study in Hogwarts Castle. It is unknown whether she still owns the cottage. Always a brave and private person, Minerva poured all her energies into her work and few people – excepting perhaps Albus – ever realised how much she suffered."
  },
  {
    "paragraph_index": 25,
    "raw_text": "During the second year of Jacob's sibling, when Ben Copper when missing, they asked Minerva about it as she was the Head of the Gryffindor House. She first asked if Jacob's sibling had seen him in the Hogwarts Express and if he had been acting strange and after learning that they didn't but Penny Haywood did and Ben seemed fine even though he was always a bit odd. She mentioned that the Cursed ice may have changed Ben and slightly chastised Jacob's sibling for their attempt to enter the Cursed Vault, asking them if they had learnt anything that said of a threat beyond the door and appealed to them that this involved all of Hogwarts, not just Jacob."
  },
  {
    "paragraph_index": 26,
    "raw_text": "Learning that they had found and read a message about an Ice Knight and Vanished Stairs, Minerva said she will discuss this with Dumbledore and accidentally revealed that she and the other teachers had once dealt with the Cursed Ice, which she quickly covered by telling Jacob's sibling that he is free to help in the search of Ben and ask for him to tell her personally should he succeed, promising to reward him.[20]"
  },
  {
    "paragraph_index": 27,
    "raw_text": "McGonagall and Snape eventually found the missing Ben Copper encased in Cursed ice and Jacob's Sibling and Rowan realised she knew more about the Cursed Ice than she revealed. Minerva was perplexed that the Knockback Jinx had no effect on the ice, noting on how they once could use it to shatter the ice, and even more so when Snape callously suggested they use Incendio to melt the ice while also burning him to death, as she realised from how the Cursed Ice had began to expand throughout the school that someone had been tampering with the Vaults. Ignoring Snape's frustrated questioning of Dumbledore's whereabouts, Minerva and Snape used the Fire-Making Spell to successfully free Ben from the Cursed Ice, taking care to target as further as possible from his body.[21]"
  },
  {
    "paragraph_index": 28,
    "raw_text": "Knowing Minerva was the only one left in the school with Dumbledore gone that could possibly teach them the Revelio Charm, Jacob's sibling turned to her to learn the spell. At first Minerva was baffled due to how advanced the charm was but ultimately agreed to teach them if they proved themselves sufficiently adept, impressed by their desire to help Hogwarts and study Transfiguration. Finding their abilities to have reached the level required in the class, Minerva called them to have their private lesson and after Jacob's sibling successfully learned Revelio, Minerva congratulated them and noted the usefulness of the spell.[22]"
  },
  {
    "paragraph_index": 29,
    "raw_text": "After learning that Bill Weasley had taught Jacob's sibling the Fire-Making Spell, Minerva was furious and scolded him heavily.[23]"
  },
  {
    "paragraph_index": 30,
    "raw_text": "In 1991 friend of Albus Dumbledore, Nicolas Flamel, had the Philosopher's Stone that was keeping him alive moved from his safe in Gringotts to Hogwarts for safe keeping. Minerva contributed to the defences set up around the magical artefact by transfiguring an enormous chess set and animating it to behave as a normal Wizard's chess set would. As part of its protection duty, it required that the person or persons seeking to get past would have to take the place of a piece on the board and play an actual game of wizard's chess, at great physical risk to themselves. This larger than life version of Wizard's Chess was known to be brutally violent and sacrificial for wizards to have to take part in themselves.[4]"
  },
  {
    "paragraph_index": 31,
    "raw_text": "Also in this year, Harry Potter, whom Minerva had been watching over for many years, would start his first year of education at Hogwarts School of Witchcraft and Wizardry, not knowing this, as he did not know that he was a wizard. Once Harry eventually arrived at Hogwarts, after the delivery of many acceptance letters, Harry was Sorted into the house of Gryffindor which Minerva was head of. Harry was therefore again placed under the watchful eye and care of McGonagall.[4]"
  },
  {
    "paragraph_index": 32,
    "raw_text": "Though Minerva often maintained her strict persona in regards to the boy, she wasn't above bending the rules for him on occasion, such as when she caught him flying on a broomstick without proper supervision. Instead of expelling him, which was Madam Hooch's stated punishment for anyone caught doing so, Minerva instead took him to see Oliver Wood, captain of the Gryffindor Quidditch team, to comment on his prodigious skill with the broom. Harry made the team, remarkable for a first year, and became the youngest Seeker in a century. She made arrangements for Harry to have a Nimbus 2000, the fastest broomstick of the time, for use during games and practices. However, several incidents marred the year.[4]"
  },
  {
    "paragraph_index": 33,
    "raw_text": "At Hallowe'en, the festive feast was interrupted by the arrival of Professor Quirrell, who came charging in screaming about a troll loose in the dungeons before fainting dead away. After restoring calm, Dumbledore ordered all students to return to their dormitories while he and the teachers made their way to the dungeons. The troll was not there upon their entry, but a terrible racket from an upper floor provided a clue. Upon reaching the site, Minerva was shocked to discover a wrecked bathroom, an unconscious troll and three bedraggled first years, one of whom was her best student Hermione Granger."
  },
  {
    "paragraph_index": 34,
    "raw_text": "To her further shock, Hermione claimed that she had gone looking for the troll thinking she could handle it but would most assuredly have been killed had Harry and Ron not found her. Torn between anger and pride, Minerva took five points from Hermione but awarded five each to Harry and Ron for, as she put it, \"sheer dumb luck.\" Over the Christmas period, she attended the Christmas feast and received a kiss on the cheek from a very drunk Hagrid; rather than admonish him, she instead giggled while blushing red in the face.[4]"
  },
  {
    "paragraph_index": 35,
    "raw_text": "However, her serious side appeared one night when she caught Draco Malfoy roaming the school at night. Dragging him by the ear, she sentenced him to detention and deducted twenty points from Slytherin when he claimed that Harry was also out of bed with an illegal baby dragon. Though the dragon in question was successfully released, Harry, Hermione and Neville were all caught and brought before McGonagall by Filch. Harshly disappointed with them, she told them all off before punishing them severely; a loss of fifty points each, 150 in total, and detention with Malfoy. This caused Gryffindor to drop to last in the House Cup.[4]"
  },
  {
    "paragraph_index": 36,
    "raw_text": "Towards the end of the year, McGonagall and the other teachers' protective enchantments down in the Philosopher's Stone chambers would come to test when Quirrell attempted to steal the Philosopher's Stone. Also testing and facing the enchantments were Harry Potter, Hermione Granger, and Ron Weasley. The trio was successful in stopping the stone being stolen and at the end of the school year, Gryffindor had won the house cup after receiving the most house points that year after getting bonus points for the trio's and Neville Longbottom's bravery. Thus, for the first time in years, McGonagall's house was the current house cup champions. Her reaction wasn't documented, but it's assumed that she was pleased with their efforts as Professor Snape shook her hand with a very forced look of congratulations.[4]"
  },
  {
    "paragraph_index": 37,
    "raw_text": "In the beginning of the 1992 school term, Minerva had to deal with Harry and Ron, who crashed Mr Weasley's Flying Ford Anglia into the Whomping Willow, due to the barrier to Platform Nine and Three-Quarters being sealed by Dobby so the two couldn't board the train. This nearly exposed the wizarding world to Muggles, but Minerva was fairer than Snape, the one who brought the matter up in the first place. Minerva ultimately let them off with a mere detention and letters to their families. Also she didn't take any house points as Harry pointed out that term had not started yet when they took the car, which she confirmed and almost smiled at this remark.[24]"
  },
  {
    "paragraph_index": 38,
    "raw_text": "Later, Minerva was present for the re-opening of the Chamber of Secrets. She, along with the rest of the teaching staff, scoured the castle for the Chamber, but to no avail. Minerva was worried over the messages left on the walls and was at a loss about what should be done. She also had to deal with the less than helpful Gilderoy Lockhart, who had been hired for the position of Defence Against the Dark Arts Professor. McGonagall had little liking or use for the man and by the end of the year was only one of the many staff members who utterly despised him. For example when he decorated the Great Hall in nauseatingly lurid pink hearts for Valentine's Day, she was observed to have a muscle twitching noticeably in her face. Throughout the year, two of Minerva's students, Hermione Granger and Colin Creevey were Petrified along with the House ghost Nearly Headless Nick.[24]"
  },
  {
    "paragraph_index": 39,
    "raw_text": "In the final weeks of that school year, Minerva served as temporary Headmistress of Hogwarts after the Board of Governors, under Lucius Malfoy's influence, suspended Dumbledore for failing to stop the attacks against the students. She was also quite shaken and softened up, as when Harry and Ron tried to sneak off to investigate the matter but were caught by herself. She let them off under the belief that they were trying to visit a petrified Hermione, though she normally would punish them with detention.[24]"
  },
  {
    "paragraph_index": 40,
    "raw_text": "When Ginny Weasley was later taken into the Chamber of Secrets, where \"her skeleton will lie in the chamber forever\", Minerva despairingly believed that they were facing the end of Hogwarts. Her temperament was not improved by the arrival of the hated Gilderoy Lockhart, who was completely oblivious to the worry of his fellow staff members, and immediately joined Professors Snape, Flitwick and Sprout in forcing him into a corner by recalling all of his boasts that he could deal with the monster easily. With him dealt with, as they couldn't care less if he succeeded or failed, the staff turned their attention to the thing they never thought would happen; the permanent closure of Hogwarts.[24]"
  },
  {
    "paragraph_index": 41,
    "raw_text": "Thankfully, this terrible reality never came to pass. While McGonagall received Ginny's distraught parents in her office, along with a returned Albus Dumbledore, she was astonished to see Ginny herself walk in, accompanied by a slime-covered Harry, Ron and Lockhart, the ragged old Sorting Hat, Dumbledore's pet phoenix and the silver Sword of Godric Gryffindor. Harry then explained that he and Ron had gone into the Chamber to find Ginny, having realised the mystery, and had slain the monster within. Dumbledore then declared the crisis over and sent Minerva down to the kitchens to organise a celebratory feast, which she subsequently attended with great joy as the monster was dead and Lockhart banished.[24]"
  },
  {
    "paragraph_index": 42,
    "raw_text": "The summer of 1993 also saw the escape of Sirius Black from Azkaban. When the school year began in September, Minerva had to deal with the effects that the Dementors had on her students, such as Harry Potter. She also authorised Hermione Granger to use a Time-Turner in order to take extra classes, a decision that would prove more useful in future events that year. This year at Hogwarts would prove to be another difficult year with Dementors guarding the castle, though they were forbidden from entering the grounds properly by Dumbledore. Minerva heartily approved of this, as she despised the foul creatures.[25]"
  },
  {
    "paragraph_index": 43,
    "raw_text": "At the start of the year, when McGonagall demonstrated her Animagus form to her first class, she notes how quiet they were, as every class she demonstrated it to prior clapped. When Hermione explained about their first Divination, McGonagall understood and asked her class which of them would be dying this year. Harry Potter raised his hand. McGonagall assured him that Sybill Trelawney's predictions were a way of greeting her class and that no deaths of any students have occurred yet. To further put him at ease, she demonstrated one of her rare glimmerings of humour by stating that she still expected him to do his homework, but if he did die then she would excuse his not handing it in.[25]"
  },
  {
    "paragraph_index": 44,
    "raw_text": "Throughout the year, Minerva assisted in guarding the school, yet nonetheless Black was able to infiltrate the castle. After Black had attacked the Fat Lady, McGonagall tried to tell Harry that Black was after him, but was cut off by Harry, who told her that Mr Weasley had told him, before she could explain. Later in the year, Minerva was summoned to Gryffindor Tower when Ron Weasley claimed to have been attacked by Black. She initially dismissed him as Black could not have possibly got in without the password (unaware that Hermione's cat, Crookshanks, befriended by Sirius and gave him a discarded list of passwords)."
  },
  {
    "paragraph_index": 45,
    "raw_text": "McGonagall was rendered speechless when the new guardian, Sir Cadogan, confirmed that he had indeed let him in because he had the passwords written down. When Neville Longbottom admitted to having written the passwords down, McGonagall banned him from future Hogsmeade visits for the rest of the year, gave him a detention, forbade anyone to give him the password into Gryffindor Tower and wrote to his grandmother. As a result, Neville received a Howler from her during breakfast.[25]"
  },
  {
    "paragraph_index": 46,
    "raw_text": "When Harry received a Firebolt following the destruction of his Nimbus 2000, McGonagall had it confiscated to be \"examined\" because she believed it to have been sent by Black (and correctly so), and therefore lethally cursed (which was incorrect). This incident caused Harry and Hermione to have a row, because Hermione had alerted Minerva about the Firebolt. It was returned to him later after having been declared safe. During the Quidditch match against Ravenclaw, Draco Malfoy, Gregory Goyle, Vincent Crabbe, and Marcus Flint posed as Dementors to sabotage Harry's performance, only to get struck down when Harry reflexively cast a Patronus Charm at them. Utterly furious at this downright trickery, she deducted fifty points from Slytherin and put the quartet in detention.[25]"
  },
  {
    "paragraph_index": 47,
    "raw_text": "In the spring of 1994, though disgusted by the Slytherin Quidditch team's dirty tactics during the final Quidditch match after witnessing Draco Malfoy grab onto the end of Harry's Firebolt to stop him from catching the Golden Snitch (which infuriated her to the point where she stopped telling Lee Jordan off and actually joined him in firing furious comments at Malfoy), she witnessed the Gryffindor Quidditch team win the Quidditch Cup for the first time since Charlie Weasley had played for the team during his Hogwarts education. McGonagall was delighted by Gryffindor's victory, openly sobbing — even louder than the already sobbing Oliver Wood — into a Gryffindor Flag, but was upset to see Oliver Wood leaving. Later on in the year, three students from her house — Harry Potter, Ron Weasley, and Hermione Granger — would run into trouble when Sirius Black returned to Hogwarts.[25]"
  },
  {
    "paragraph_index": 48,
    "raw_text": "In the autumn of 1994, Hogwarts hosted the magical schools, the Beauxbatons Academy of Magic and the Durmstrang Institute for the Triwizard Tournament. Harry Potter was selected as a Triwizard Champion, despite being under age and McGonagall worried for his safety after having looked after him for so many years. Minerva pleaded with Dumbledore and Crouch to withdraw Harry from the tournament, as the tournament was highly dangerous. But withdrawing would go against the rules of the tournament and Potter had to continue on, as there was a binding magical contract in place.[26]"
  },
  {
    "paragraph_index": 49,
    "raw_text": "During the year Minerva more than once exhorted her students to provide a good appearance to their guests at the castle. She attended the Yule Ball with Albus Dumbledore and notably wore her hair down for the first time since Harry started his education at Hogwarts. While at the Ball, Minerva danced with both Ludovic Bagman and Dumbledore, among others. In the case of the former, Harry Potter noticed Bagman kiss Minerva's hand once they had finished dancing.[26]"
  },
  {
    "paragraph_index": 50,
    "raw_text": "Minerva loaned her classroom to Harry, Ron and Hermione so they could practise spells for Harry's preparation for the Third Task. She did this after having walked in on them practising so many times around the school. At the end of the Tournament, Minerva accompanied Dumbledore and Severus Snape in the rescue of Harry Potter from the Death Eater that had spent the entire school year impersonating the Auror Alastor Moody, that year's DADA professor.[26]"
  },
  {
    "paragraph_index": 51,
    "raw_text": "She was instructed to guard Crouch Jnr after he revealed his part in the rebirth of Voldemort but was unable to prevent the Dementor brought by Minister Cornelius Fudge from giving the Death Eater the Dementor's Kiss. She was intensely furious at Fudge for this blunder, and severely shaken from having witnessed the unspeakably horrible act, screaming more than Harry had ever seen before. Thus, when the Minister refused to believe Dumbledore and Harry Potter about the return of Voldemort, Minerva nonetheless stood in support of her superior and her student. In the return of the Dark Lord, Hufflepuff student Cedric Diggory was carelessly murdered and a memorial feast was held at the end of the school year. The Second Wizarding War had now begun, despite the Ministry trying to hush up any claims of this.[26]"
  },
  {
    "paragraph_index": 52,
    "raw_text": "Once the Second Wizarding War had begun, Minerva joined the Order of the Phoenix and spent much of the summer of 1995 doing work for the Order. She would come and go from 12 Grimmauld Place wearing a Muggle dress rather than her robes, which Harry thought made her look odd. Though these duties took up much of her time, Minerva would face even greater challenges at Hogwarts."
  },
  {
    "paragraph_index": 53,
    "raw_text": "Because Dumbledore was unable to find a new professor for Defence Against the Dark Arts, the Ministry of Magic appointed Dolores Umbridge, a senior Ministry official and stout supporter of Fudge, to the Hogwarts staff. Minerva saw this appointment as an affront to the school itself and did little to hide her disgust.[13]"
  },
  {
    "paragraph_index": 54,
    "raw_text": "When Harry Potter crossed Umbridge, earning a detention in his first class with her, Minerva was sympathetic but warned him that Umbridge was not to be trifled with and that he should keep his head down. McGonagall did all she could to circumvent Umbridge's authority without risking her own security as Deputy Headmistress. Indeed, she treated Umbridge with as little credence and respect as possible while Hogwarts was under investigation by the Ministry of Magic and even gave Peeves tips on how to unscrew a chandelier when he was trying to cause havoc for Umbridge. McGonagall also managed to put aside her dislike of Professor Trelawney for a time in the face of Umbridge's persecution of Hogwarts' inhabitants. It is shown she brings Trelawney back to Hogwarts after Umbridge dismissed her.[13]"
  },
  {
    "paragraph_index": 55,
    "raw_text": "After Umbridge's appointment as High Inquisitor, Minerva was forced to endure the other woman's presence during her evaluation of Minerva's teaching. Minerva kept her temper under control, maintaining an icy exterior and yet still unleashed a dry and pointed wit on Umbridge. The encounter did serve to cheer students like Ron Weasley who heartily disliked Umbridge; Ron even expressed delight at the prospect of seeing Minerva's classes inspected, remarking that \"Umbridge won't know what's hit her\". Still, darker times lay ahead.[13]"
  },
  {
    "paragraph_index": 56,
    "raw_text": "Despite Minerva's best efforts to thwart the Ministry's influence at Hogwarts, things continued to grow worse. After Harry's resistance group was discovered by Umbridge, Minerva was present in Dumbledore's office when Harry was brought in. When Umbridge revealed that anti-Muggle prankster Willy Widdershins had provided her with testimony that Harry was forming this rebel group, Minerva loudly voiced that she had wondered why he had managed to avoid prosecution for all his regurgitating toilet charges, joined in her vocal outrage by the portrait of Headmaster Dexter Fortescue.[13]"
  },
  {
    "paragraph_index": 57,
    "raw_text": "Dumbledore managed to save Harry by taking credit for the student organisation, which led to Fudge announcing his intention to arrest him and actually attempted to have him taken by force, sneering at the idea of Dumbledore taking on him and the others single-handed. Minerva, loyal to her mentor and friend, loudly declared that he wouldn't be single-handed and actually made to draw her wand, fully prepared to duel the Minister for Magic himself. She only stood down on Dumbledore's direct orders, as Hogwarts would need her.[13]"
  },
  {
    "paragraph_index": 58,
    "raw_text": "After Dumbledore escaped arrest, Umbridge was appointed Headmistress over Minerva, but had virtually no support. When Umbridge invaded the career advising of the 5th-year students, Minerva finally lost her temper. During Harry Potter's session, when Umbridge kept interrupting the conversation and declaring that Harry would never be an Auror at the Ministry, Minerva declared to Harry that she would help him in any way necessary to achieve his goal, even if it was the last thing she ever did. The atmosphere at Hogwarts continued to devolve under Umbridge's leadership.[13]"
  },
  {
    "paragraph_index": 59,
    "raw_text": "During the O.W.L. examinations, events came to a head. When Dolores Umbridge and several Aurors attempted to evict Hagrid from the grounds of Hogwarts, Minerva sought to intervene on behalf of her colleague. Charging out of the castle, she shouted at the Aurors to leave Hagrid alone. However, before she could even draw her wand, Minerva was promptly hit with four Stunning Spells in the chest, which required that she be moved from Hogwarts Hospital Wing to St Mungo's for treatment.[13]"
  },
  {
    "paragraph_index": 60,
    "raw_text": "Hagrid was so enraged and disgusted by this attack that he attacked two of her attackers before fleeing, furiously denouncing them as cowards, while Madam Pomfrey said that it would be very difficult for Minerva to be hit in broad daylight. She would have resigned in protest because of this cowardly attack if the students' well-being was not placed as her priority. Many students were also outraged with this attack, to the point of ignoring their Astronomy exam and even the proctor Professor Tofty expressed aloud his fury.[13]"
  },
  {
    "paragraph_index": 61,
    "raw_text": "Minerva didn't return to Hogwarts until after the Battle of the Department of Mysteries. After being released from the hospital, she required the aid of a walking stick for several days. Upon her return to the school, she promptly gave the six students involved in the Battle at the Ministry 50 house points each for \"alerting the world to the return of You-Know-Who\", in response to Snape needling Harry about Gryffindor having 0 house points.[13] She also watched with some happiness when Peeves chased Umbridge from the school, commenting that she would've joined Peeves in chasing Dolores away in the school grounds, but Peeves had appropriated her walking stick.[13]"
  },
  {
    "paragraph_index": 62,
    "raw_text": "Having resumed her duties within the Order of the Phoenix as well as her other responsibilities at school when the new year began after summer,[13] early in the term, Minerva was responsible for the distribution of schedules among the sixth year N.E.W.T. students.[27]"
  },
  {
    "paragraph_index": 63,
    "raw_text": "Minerva was present after Katie Bell was cursed by the Opal Necklace. After Harry ran off to find someone to aid Katie, he bumped into Hagrid and led him back to the group. After learning the nature of the event Hagrid carried Katie to the castle, accompanied by Harry, Hermione, Ron, and Leanne. While in the castle Minerva appeared and asked Harry what he was holding in his hand, it was the necklace wrapped in his scarf."
  },
  {
    "paragraph_index": 64,
    "raw_text": "She then proceeded to hand over the necklace to Professor Snape, through the Caretaker Argus Filch and questioned the trio and Leanne on what they witnessed. Harry told her his theory that it was Draco Malfoy that gave Katie the necklace, but she scorned the theory and dismissed them. Snape was able to stop the curse from spreading any further, but Katie was taken to St Mungo's Hospital for Magical Maladies and Injuries, where she spent much of that year recovering from the effects of the curse.[27]"
  },
  {
    "paragraph_index": 65,
    "raw_text": "On 30 June 1997, Minerva and the other teachers was informed by Professor Dumbledore that he would be leaving the school for a few hours, and instructed them to patrol the corridors as a safety precaution, and that they would be joined by Remus Lupin, Nymphadora Tonks and Bill Weasley. Mindful of the stringent security measures that had been put in place in light of the Return of Lord Voldemort, it seemed impossible that any intruder could bypass the protective enchantments surrounding the school, and indeed, even as she began with her sentry duty, nothing seemed amiss until the sudden arrival of Ron, Ginny and Neville near mindnight, who explained that they had just come from the seventh-floor corridor, where a number of unknown individuals had just emerged from the Room of Requirement, hidden under the cover of Peruvian Instant Darkness Powder.[27]"
  },
  {
    "paragraph_index": 66,
    "raw_text": "Within minutes of this happening, Minerva, Filius Flitwick, and the two trios of students and Order members discovered that group of no less than six Death Eaters heading in the direction of the Astronomy Tower and, having immediately chase and thereby forced them to scatter, they were all quickly engaged in a fierce skirmish to try and stop the trespassers: Although they were greater in numbers, the Death Eaters they fought were relentless, cursed-to-kill and seemingly prepared to duel to the death, and before long they had gained the upper hand."
  },
  {
    "paragraph_index": 67,
    "raw_text": "Because of the relentlessness of the Death Eaters, Neville and Bill both had been brutally incapacitated in the struggle. Seeing the need for more wands on their side, Minerva sent Flitwick to get Severus Snape so he could help fend off the intruders, At the time of Dumbledore's murder, Minerva and the rest of the Hogwartsians was stuck on the level below them, having been prevented from passing on the stairs to reach them by a cursed barrier cast by the Death Eaters. When he arrived, Snape, by contrast, could (as he had the Dark Mark), and pushed past her.[27]"
  },
  {
    "paragraph_index": 68,
    "raw_text": "Having merely assumed that her colleague was simply in a hurry to pursue their adversaries, no one tried to stop him as he did so, and once  when one of them caused a section of the roof to collapse and took the barrier with him, Minerva and those who were still standing rushed forward to pursue them as well; only for the dust to clear and Snape to emerge with Draco Malfoy in tow, Assuming they were running from the Death Eaters, Minerva let them pass before reengaging the Death Eaters that came down after them, whereupon she duelled and personally chased off Alecto Carrow, whom Minerva sent running for cover. Once the intruders escaped the scene of the crime, however, Minerva was devastated to find their esteemed headmaster, the man whom she had known nearly her entire life as a teacher, mentor and friend, lying dead outside on the lawn beneath the Astronomy Tower, and asked Hagrid to move the body.[27]"
  },
  {
    "paragraph_index": 69,
    "raw_text": "Having notified Arthur and Molly Weasley about what had happened and that their oldest son had been gravely injured at the hands of Fenrir Greyback, Minerva  regrouped with the rest of the other combatants at the Hospital Wing, where they discussed what had transpired and Harry Potter elaborated on the plot to assassinate Albus Dumbledore. Upon learning from Hagrid that Horace Slughorn had notified the Ministry of Magic, Minerva promptly and prudently assumed the role of acting Headmistress of Hogwarts by having the Heads of Houses meet with her in what had now become her new office in the Headteacher's Tower to discuss the future of the school."
  },
  {
    "paragraph_index": 70,
    "raw_text": "Before they arrived, she also tried to tried to comfort Harry about the death of Dumbledore, as well as to persuade Harry to confide in her the truth about what he and the late headmaster had been up to prior to their sudden departure from the school, only for Harry to refuse her, as Dumbledore had shared the facts of the matter in the strictest confidence. Eventually joined by Pomona Sprout, Filius Flitwick and Horace Slughorn, the five individuals proceeded to talk about the possible closure of Hogwarts and the necessary arrangements for Dumbledore's funeral."
  },
  {
    "paragraph_index": 71,
    "raw_text": "When Professor Slughorn announced the emminent arrival of a delegation from the Ministry of Magic, led by the Minister for Magic Rufus Scrimgeour, she gave Harry leave to vacate the office so that she could prepare to receive the new arrivals and inform them about what had happened. During this exchange, Scrimgeour also agreed to let Minerva follow through with Dumbledore's previously stated wish of being put to rest at the school grounds.[27]"
  },
  {
    "paragraph_index": 72,
    "raw_text": "As the war continued, Minerva remained at Hogwarts, even when it was taken over by Voldemort. This was most likely to try and make sure as little harm came to the students as possible, and because she could act as an insider so that the Order of the Phoenix was informed on what was going on at Hogwarts. Even when Severus was appointed Headmaster and Alecto and Amycus Carrow were given free rein in the school, Minerva did as much as she could to protect the students. The rebel alliance Dumbledore's Army founded by the students reformed and McGonagall helped to keep their meetings a secret.[14]"
  },
  {
    "paragraph_index": 73,
    "raw_text": "On 1 May 1998, Minerva was present when Harry Potter, Hermione Granger, and Ron Weasley returned to Hogwarts in the middle of the night in search of Rowena Ravenclaw's Diadem. That night, she found Amycus at the door to Ravenclaw Tower, furiously assaulting it and demanding to be let in. Dryly pointing out that perhaps his sister, whom Professor Flitwick had admitted earlier at their urgent request, could open the door and prevent him from waking half the castle. Minerva then intervened on his behalf after he told her that Alecto wasn't responding.[14]"
  },
  {
    "paragraph_index": 74,
    "raw_text": "When the door opened, they found Alecto unconscious on the floor, which Minerva surmised as the work of a Stunning Spell. Amycus then revealed that they had been warned that Harry might try to get into Ravenclaw Tower, to which Minerva responded with confusion as Harry was in her house, speaking of this with pride in her voice, before scanning the room. Amycus then horrified her by stating his plan to push the blame for Alecto summoning Voldemort on the children in the dormitories, without remorse or concern that they would likely be killed or horribly tortured."
  },
  {
    "paragraph_index": 75,
    "raw_text": "Minerva refused to allow Amycus to place blame on the children, prompting the Death Eater to spit in her face, only to be flung across the room with the Cruciatus Curse when Harry, who had witnessed the whole thing from under his Invisibility Cloak, revealed himself in sheer anger. With both Carrow siblings now incapacitated, Minerva used the Imperius Curse to gain their wands, before she magically restrained and confined them to the Ravenclaw common room."
  },
  {
    "paragraph_index": 76,
    "raw_text": "Realising that a battle was upon them, Minerva engaged Severus Snape, the Headmaster at the time, in a fierce duel. Whilst Snape did put up a good defence, McGonagall gained the upper hand in the duel quickly, and when Filius Flitwick, Horace Slughorn and Pomona Sprout arrived, Snape fled, now severely outnumbered. Minerva, believing his escape was motivated by fear, called him a coward as he fled the school.[14]"
  },
  {
    "paragraph_index": 77,
    "raw_text": "Harry informed McGonagall of a quest that Dumbledore had left him. In respect for Dumbledore's wishes, she offered to hold Voldemort and his army back whilst Harry fulfilled this quest. She then proceeded to lead the defence of Hogwarts against the Death Eaters with Kingsley Shacklebolt, personally animating virtually all of the castle's suits of armour and statues to help her defend the school.[14] Shortly before the battle, Minerva ordered Neville Longbottom with the aid of Seamus Finnigan and other students to destroy the Wooden Bridge so that the Snatchers could not sneak into the school grounds.[28] To ensure the advantage of chaos on their side, she also ordered Argus Filch to find Peeves and bring him to her, which he did in response to her agitation.[14]"
  },
  {
    "paragraph_index": 78,
    "raw_text": "After ordering the evacuation of younger students through the Hog's Head, Minerva began to help fortify the castle against the coming attack, with the assistance of her fellow teachers, Order members, and even the older students who had stayed behind to fight. When Pansy Parkinson suggested they take the deal offered to them by Voldemort — that of their lives in exchange for Harry Potter — Minerva ordered the cowardly girl and all those not willing to fight to leave.[14]"
  },
  {
    "paragraph_index": 79,
    "raw_text": "Minerva fought skillfully in the first part of the battle, during which she could have sworn she saw one of the statues that usually flanks the school's Main Gates dive-bombing a cluster of Death Eaters.[29] She also led a herd of enchanted desks into the fray at one point, during which she yelled \"CHARGE!\"."
  },
  {
    "paragraph_index": 80,
    "raw_text": "She stood defiant in the lull and among many students in a crowd when Voldemort himself walked into the Hogwarts grounds. It was only when she saw Harry Potter's body being carried by Hagrid that she began to despair, letting out a scream terrible to anyone who heard it, equal to that of Ron, Hermione, and Ginny's together. Nonetheless, Minerva continued to fight when the battle resumed after the attack by the Centaurs on Voldemort and the Death Eaters. In the final moments of the battle, she duelled Voldemort himself to a stalemate along with Horace Slughorn and Kingsley Shacklebolt. They were blasted aside by his fury when Bellatrix Lestrange was killed in a duel with Molly Weasley.[14]"
  },
  {
    "paragraph_index": 81,
    "raw_text": "McGonagall was also present when Harry and Voldemort duelled for the final time. She and many others witnessed Voldemort's Killing Curse connect with Harry's Disarming Charm. Voldemort's curse was rebounded, signalling his final defeat at Harry's hands. She, along with everyone else in the Great Hall, hugged Harry in an uncharacteristic display of great emotion, being one of the first to reach Harry after Hermione, Ron, and Ginny. This event signalled the end of the Second Wizarding War.[14]"
  },
  {
    "paragraph_index": 82,
    "raw_text": "In the aftermath of the battle, Professor McGonagall brought the Winged Boar Statues' part in the battle to the attention of Professor Flitwick. Flitwick thought it an unlikely story, as no one was known to have enchanted them. This subsequently lead to a long-standing disagreement between the two, who could not agree as to whether or not the winged bore statue had, in fact, participated in the Battle of Hogwarts.[29]"
  },
  {
    "paragraph_index": 83,
    "raw_text": "Having been awarded the Order of Merlin, First Class, by Minister for Magic Kingsley Shacklebolt for her unwavering allegiance to the Order of the Phoenix during the historic conflict, Minerva was eventually immortalised on a Chocolate Frog Card (an accolade she later admitted she had never imagined receiving),[15] and four months later, by which time the damages done to the castle during the battle had been repaired and the protective enchantments around the castle and grounds restored, she had been officially appointed to the position of Headmistress.[30]"
  },
  {
    "paragraph_index": 84,
    "raw_text": "Upon assuming her new post full-time, she was advised not to confuse the Headmaster portraits for the actual people they depicted, as they were only paint and memory, and supposed to be nothing more than a support mechanism for the many difficult decisions that she would have to make while running the prestigious institution.[31]"
  },
  {
    "paragraph_index": 85,
    "raw_text": "Ultimately, the faculty was ready to accept a new batch of first-year students for the 1998–1999 school year on 1 September. During this term, the school also guided those who would have otherwise completed their studies had it not been for the Magic is Might Campaign of Lord Voldemort and his followers, such as Muggle-borns like Hermione Granger, in finishing their N.E.W.T.s.[32] Around this time, following a private conversation with Harry Potter, the new Headmistress, in view of the revelation of his true intentions and motives, made the somewhat controversial decision to add Professor Snape's portrait to the gallery in her office in commemoration of his true allegiance and the role he had played in the Second Wizarding War.[33]"
  },
  {
    "paragraph_index": 86,
    "raw_text": "In the time that followed, Minerva oversaw a very trying time for the rest of the denizens of Hogwarts Castle, as the final battle had left marks both seen and unseen upon the school. On the anniversary of the Battle of Hogwarts, Minerva would host memorials at the school, at least one of which involved those in attendance being treated to several expert demonstrations of the Shield Charm.[34]"
  },
  {
    "paragraph_index": 87,
    "raw_text": "Having also lost members of the staff during the battle,[28] she was also involved with the hiring of new members of the school faculty. In addition to find a suitable candidate to replace her as the school's Transfiguration teacher,[35] as well as a new, permanent occupant for the post of Defence Against the Dark Arts instructor. She was also behind the eventual employment of her former student Neville Longbottom to the Herbology department, under head of department Pomona Sprout,[30][36] whom she eventually appointed as her successor as the Head of Gryffindor House.[37]"
  },
  {
    "paragraph_index": 88,
    "raw_text": "Headmistress McGonagall was also known to have continued to personally attend to some of the duties she had carried out on Dumbledore's behalf throughout her time as Deputy Headmistress, including sending acceptance letters to future Hogwarts students,[38] collecting the new first-years, escorting them to the Great Hall, and presiding over the Sorting Ceremony.[30]"
  },
  {
    "paragraph_index": 89,
    "raw_text": "Minerva ultimately earned recognition as a very successful and inspirational Headmistress of the school, and when she took up permanent residence in Dumbledore's old quarters, her new study became the home to among other things a self-playing harp whose tones could often heard around midday between classes.[39]"
  },
  {
    "paragraph_index": 90,
    "raw_text": "Five years after the final battle, Minerva also wrote a glowing letter of recommendation to the Ministry of Magic's research wing regarding one of their graduating students: Having achieved no less than five 'Outstandings' and one 'Exceeds Expectations' on his N.E.W.T.s, Grim Fawley had been one of the students that were bereft by the Dark Lord's second rise to power; having lost both of his parents to the Death Eaters during the conflict. Still and all, he had remained an outstanding student that embodied all of the qualities that marked a true Hufflepuff, and given his perseverance and impressive record, Minerva was happy to help him land a job at the Ministry, where he was later taken on by the Department of Magical Law Enforcement as a research assistant at the Auror Office.[40]"
  },
  {
    "paragraph_index": 91,
    "raw_text": "At some point in 2008, ten years after the Battle of Hogwarts took place, Minerva gave Hermione Granger, who had since joined the Ministry and risen to a high-placed office in the Department of Magical Law Enforcement, permission for Dumbledore's old notes on The Tales of Beedle the Bard to be published as part of her new translation of the book.[41]"
  },
  {
    "paragraph_index": 92,
    "raw_text": "Sometime before 1 September that same year,[42] Headmistress McGonagall charged Rubeus Hagrid with serving as a special messenger to a young Muggle-born that had been admitted to the school to deliver their letter of acceptance and to take said student-to-be to Diagon Alley in London to purchase the necessary school supplies.[30]"
  },
  {
    "paragraph_index": 93,
    "raw_text": "In September 2008, Professor McGonagall carried out the Sorting Ceremony after collecting a new batch of first-years escorted by Professor Hagrid. In the Great Hall before the Start-of-Term Feast, she addressed the students with a brief speech about the importance of unity in spite of their individual differences. She cited their victory at the Battle of Hogwarts as a prime example of what the castle's residents might accomplish when they worked together and that they were capable of much more than they might have thought. She also put nervous students at ease by reminding them that even the famous Harry Potter had once stood where they did, having both started out as a student like themselves and looked just as nervous.[43]"
  },
  {
    "paragraph_index": 94,
    "raw_text": "The ceremony saw the sorting of a new Muggle-born student, Kevin Farrell, Robyn Thistlethwaite, Cassandra Vole, Fischer and Colby Frey, Daniel Page and Lottie Turner into their respective houses. However, the Headmistress was surprised to find that they were one student short when she called for Ivy Warrington, who did not respond. She asked if anyone knew where she was but nobody could tell her. Then, however, Hagrid arrived at the hall and brought Ivy with him, explaining that she had got distracted by the bushes outside the castle.[43]"
  },
  {
    "paragraph_index": 95,
    "raw_text": "At some point after the Battle of Hogwarts, she created a Dance Club. She had enjoyed dancing her whole life, once telling the student that she was a \"spritely lass\" when she was younger and enjoyed waltzing as much as Transfiguration. She thought the Yule Ball had boosted morale at Hogwarts and wanted to give future students that same experience. She talked to the student when they arrived at the club for the first time, telling them not to be nervous and asking them about their prior experience. She then encouraged them to get their friends to participate too.[44]"
  },
  {
    "paragraph_index": 96,
    "raw_text": "The following evening, Professor McGonagall learned that Ivy Warrington had wandered off once more and, what was more, this time been missing for a long enough time that there was actually cause for alarm. Having gone to have a look for her herself, the Headmistress eventually came across a small group of her classmates late in the evening in the Grand Staircase, whom she questioned about their classmate's whereabouts. Upon realising that they did not know either, Minerva tasked Hagrid with organising a search party to find her and turned down her peer's offer to lend them a hand.[45]"
  },
  {
    "paragraph_index": 97,
    "raw_text": "Due to Ivy's disappearance, McGonagall contacted her grandmother and learnt from her the true story of Ivy, which involved Ivy's sister Winifred accidentally Vanishing herself during a confrontation with Ivy, and her grandmother modifying Ivy's memories to make her forget what happened. She also contacted the Ministry of Magic at some point, and affirmed that the incident was accidental, and that Ivy would not be expelled. After Ivy was found and was caught by the caretaker Argus Filch wandering in the castle, she was brought to the Headmistress's office and explained to McGonagall what she had found out about herself. McGonagall noted that her story was not complete, and invited her grandmother to come forward and recount the truth of what had happened. Despite Ivy's grandmother lamenting she wasn't a good teacher for her granddaughters, McGonagall thought otherwise, and voiced the belief that Ivy had also received proper guidance from the friends she had made.[46]"
  },
  {
    "paragraph_index": 98,
    "raw_text": "At some point before the new term, Headmistress McGonagall got in contact with a worldly traveller with a proclaimed interest in bygone times named Jakub Gorski and invited him to join the staff for the duration of the new term as a visiting professor of History of Magic. He was also known to have kept a lemur called Bly, which acted as his assistant.[30] The new school year also saw the sorting of Edward Lupin into Hufflepuff.[47]"
  },
  {
    "paragraph_index": 99,
    "raw_text": "Later that term, Minerva visited the Hog's Head Inn during a Hogsmeade weekend trip and discovered that several second-year students, the same friend group she had summoned to her office near the end of the previous year, had snuck out of the school without permission and visited the village despite the fact that they were not old enough to partake in said trips.[48] The Headmistress listened to their explanation, but didn't believe their claim that Gorski was at the inn, as they had no proof. She then put them all in detention, which involved polishing statues in the castle.[49]"
  },
  {
    "paragraph_index": 100,
    "raw_text": "Shortly afterwards, however, McGonagall received word from the Ministry of Magic that they had been following Gorski's moves for months, and that Ministry agents would arrive before long to secure the castle. The Headmistress rushed to find him in his classroom, only to find that he was already incapacitated and surrounded by the very students who had tried to warn her about him in the first place. McGonagall was able to discern that Gorski was being controlled by the Imperius Curse, and, knowing the wizard responsible was running lose somewhere in the castle, ordered the students to return to their dormitories and leave the Dark wizard in question to the teachers and Ministry officials.[49]"
  },
  {
    "paragraph_index": 101,
    "raw_text": "During the same school year, Hogwarts was represented in the eighty-seventh Wizarding Schools Potions Championship.[50]"
  },
  {
    "paragraph_index": 102,
    "raw_text": "During Christmas later that term, Minerva was approached by Daniel Page, who explained that Ivy, whose memories had since been mostly restored, was not feeling the holiday spirit, as she was missing her sister too much, and that he had come up with the idea that Ivy might feel more connected to Winifred if she had a present for her and vanished it, hopefully to wherever Winifred was. The Headmistress, though aware that this was not how Vanishing Spells worked, could still appreciate it as a symbolic gesture and retrieved one memory from each of Ivy's friends about when they first met Ivy, which was then gift-wrapped and handed to her so that it could be 'sent to Winifred'.[30]"
  },
  {
    "paragraph_index": 103,
    "raw_text": "After Teddy Lupin was appointed the new Head Boy before his seventh and last year at the school,[47] over the next few years, the young James and Albus Potter, as well as Scorpius Malfoy arrived at Hogwarts and were sorted into their Houses. James Potter and Scorpius Malfoy were as expected sorted into Gryffindor[47] and Slytherin respectively, however, Albus Potter was also sorted into Slytherin to everyone's surprise.[51]"
  },
  {
    "paragraph_index": 104,
    "raw_text": "By 14 December 2018,[52] the world wizarding community had been dealt a devastating blow following the sudden outbreak of a chaotic piece of magic that caused numerous unpredictable traces of magical activity to suddenly appear all over the Muggle world, thus threatening with the potential exposure of the magical world. During the Ministry's investigation into the cause of the Calamity, whereupon generally agreed by his former co-workers that Grim Fawley had both the means, motives and opportunity to bring about said catastrophe, Minerva provided the Calamity Management Team with a copy of Grim's school record and informed them about the tragic fate of his parents, as well as noting what an outstanding student he had been, and gave no indication that she believed in Grim's guilt.[53]"
  },
  {
    "paragraph_index": 105,
    "raw_text": "After the International Confederation of Wizards and the Ministry of Magic in London partnered to create an International Task Force whose sole purpose would be to investigate and contain the situation, several former members of the Order of the Phoenix, including Arthur Weasley, Aberforth Dumbledore, Hestia Jones and Minerva herself, got personally involved to help the agents of the then recently founded Statute of Secrecy Task Force for the task at hand.[54]"
  },
  {
    "paragraph_index": 106,
    "raw_text": "At one point, Minerva was called in as a guest lecturer to talk about the peculiarities of fighting Curiosities, during which aspiring Magizoologists in attendance learned a lot and were able to use said knowledge to improve their defensive spellwork.[55] At a later date, she also invited a Calamity Investigator working for the task force to Hogwarts in order to show them the original architect's blueprints for the castle to help them better understand how the school had changed over the years since its initial construction and the transformative powers of magic.[56] Along with her former students Harry Potter and Ginevra Weasley, Minerva later held a panel at the Ministry where the three spoke about having parts of their lives turned into Foundables by the Calamity, with the emotional evening being attended by the same Calamity Investigator.[57]"
  },
  {
    "paragraph_index": 107,
    "raw_text": "Before long, Minerva would also assume a part-time role in the Calamity Management Team herself, where she was put in charge of overseeing those of the Calamity Investigators wishing to pursue a career as Professors, whom she warned of the difficulties they would have to face along the way, as well as the fact that they might be called upon to do things they never thought possible. She invited at least one such person to join the teaching staff at Hogwarts in time for the new term in order to get some experience educating young witches and wizards, and to learn practical skills that would help them to better tackle the Calamity.[58]"
  },
  {
    "paragraph_index": 108,
    "raw_text": "Upon the arrival of a Calamity Investigator to Hogwarts Castle to take up a teaching position, Professor McGonagall welcomed the individual by giving them copies of the letters that were once exchanged between Albus Dumbledore and Adalbert Waffling to help improve their skills in addressing the Calamity, specifically in fighting Impaired Foes.[59] Along with teaching them the Deterioration Hex for the purpose of weakening their foes,[60] she also showed them how to draw on the strength of others when in combat,[61] how to systematically work with academic research to improve their attention to detail,[62] and how to augment the effects of the exceptionally powerful Protection Charm they had previously been taught by Filius Flitwick by adjusting their stance.[63] During this time, she would also lecture them on how to better connect with their teammates, which helped them get better results with their Proficiency Charm.[64]"
  },
  {
    "paragraph_index": 109,
    "raw_text": "Determined to run the school as normally as they possibly could under the circumstances, despite the rising tensions surrounding the Calamity, and even though Hogwarts was hit with a massive Pixie infestation and required all of the professors to spend time finding and removing nests of nettlesome Pixies from the premises,[65] the Inter-House Quidditch Cup was held as planned, and at some point after the tryouts of the Gryffindor Quidditch team, Professor McGonagall announced to an gathering of students in the Great Hall that Rose Granger-Weasley had made the it as their new Chaser.[64]"
  },
  {
    "paragraph_index": 110,
    "raw_text": "Despite the best efforts of everyone involved, however, it eventually became glaringly obvious that the security measures that had been put in place to ensure the safety of the school's residents were wholly insufficient to stop the Calamity from claiming victims from within the castle itself. At some point, students from all the four houses was snatched and dislocated in the Muggle world, a number of items and special artefacts from Hogwarts such as portraits became Foundables as well, along with several staff members, including Minerva herself.[66]"
  },
  {
    "paragraph_index": 111,
    "raw_text": "In the summer leading up to the new school year, the Ministry of Magic hosted a panel of luminaries that had all had pieces of their lives turned into Foundables by the Calamity to share their experiences. Minerva, having accepted the invitation to partake as a panel speaker, joined Harry Potter and Ginny Weasley in talking open and honestly about what they had gone through, which resulted in an enlightening and emotional evening from which the agents of the SOS Task Force was later known to have benefited greatly from.[67]"
  },
  {
    "paragraph_index": 112,
    "raw_text": "Shortly before the beginning of the 2019–2020 school year, Minerva was informed that a highly talented student in Slytherin House had decided to transfer to Beauxbatons Academy of Magic to distance herself from the surges of chaotic magical activity that was running rampant in Britain, as she felt the Calamity had singled out her House. Minerva tried to convince her to stay, was ultimately unsuccessful.[68]"
  },
  {
    "paragraph_index": 113,
    "raw_text": "The Headmistress took no small amount of pride in the fact that more than seventy-four percent of the volunteers that had taken time off their busy schedules to assist the Ministry — by quill and parchment — with the job of tracking, sorting, cataloguing, collating, and archiving returned Foundables for the Ministry were current and former members of Hufflepuff House.[68]"
  },
  {
    "paragraph_index": 114,
    "raw_text": "Around the same time, Minerva also received owls from no less than three students in Ravenclaw House asking if they could receive their lesson plans early as not to fall behind in their studies, an exchange she noted that it was not uncommon for her to have with students of that house at the beginning of each term.[68]"
  },
  {
    "paragraph_index": 115,
    "raw_text": "When the Hogwarts Express was whisked away by The Calamity just shortly prior to its scheduled departure on 1 September, however, she quickly solicited the assistance of a highly reputable member of the SOS Task Force that Hermione Granger had recommended, hoping said individual could returned the train in time for the new school year. In the meantime, however,  due to the ongoing surge, a number of Foundables materialised on the school grounds, including werewolves and fire-breathing chickens, expressing the concern that lest the Calamity was dealt with, she would have to spend the whole term keeping first-year Gryffindors — and — Rubeus Hagrid away from them."
  },
  {
    "paragraph_index": 116,
    "raw_text": "The Calamity Investigator was eventually successful in returning the Hogwarts Express in time for the start of the term, much to the relief of Minerva; who pointed out that the time-honoured tradition of riding the train to school was as much part of the \"Hogwarts experience\" as the Sorting Ceremony. She was also relieved to hear of the safe return of the trolley witch, who had been turned into a Foundable and at some point afterwards retrieved by the aforementioned Task Force member, saying that the Hogwarts Express would not be the same without her and her sweets, noting that she could remember her working at the train even back when Minerva herself was a student, during which she was \"partial\" to her Pumpkin Pasties.[69]"
  },
  {
    "paragraph_index": 117,
    "raw_text": "That was not to say that her troubles was over, however, as the Calamity hit the school itself next, spiriting off with the Sorting Hat, a Thestrals from Hogwart's herd, one of their carriages, a boat, a Winged Boar Statue and even the sign directing people between Hogwarts Castle and Hogsmeade Village; all of which the same diligent individual was able to retrieve and return to their allotted places, much to the delight of the denizens of Hogwarts Castle. In the aftermath of the incident, the Headmistress noted that in light of the fact that the school had suffered no lasting damage from this latest surge, (not counting the students' new favourite excuse for not finishing their schoolwork in time; 'the Calamity stole my homework!'), and that she would be writing to Minister Granger and inform her about the admirable service that the Calamity Investigators involved in putting down the new outbreak had done to the old school.[68]"
  },
  {
    "paragraph_index": 118,
    "raw_text": "On 13 February 2020, the Hogwarts Headmistress was dismayed to learn that not only had the seemingly quasi-sentient predicament that was wreaking havoc on magical communities everywhere hit her school once more, but that this time, it gave the impression of having taken a particular interest in her personally; as it had snatched away several items of a significantly more private sort than the ones that had been claimed by the Calamity so far. Mindful of the exemplary job that the Statute of Secrecy Task Force had done in ensuring that the new term could begin as planned as six months earlier, however,  Minerva had to qualms about reaching out to them again. Along on this endeavour was also former student and then Head of the task force, Constance Pickering, whose comments and constant questions about the various objects that they retrieved Minerva would eventually find to be irkesome in the long run.[70]"
  },
  {
    "paragraph_index": 119,
    "raw_text": "The first possession to be returned to her self-playing harp, at which point Minerva showed signs of mild exasperation when she had to explain to Miss Pickering that the self-playing instrument had, as the name suggests, been bewitched to play itself. The next items on the list was the memory of a hornbill that she once owned, which she had used as a teaching aid during her career as a Transfiguration professor, and remembered it fondly as \"a good bird\", although she had not viewed it as a pet, as she was more partial to cats.[70]"
  },
  {
    "paragraph_index": 120,
    "raw_text": "Other items on the list included a school crest, her Order of Merlin, First Class, which she had framed and kept in her office, and an old photo of Dougal McGregor, about whom she refused to comment when Pickering asked about the man's identity, saying only that he was \"a man [she] once knew\" and that that was all she was prepared to say on the matter.[70]  By 3 March, all of the items had been successfully retrieved, and though grateful for their help, Minerva still lightly admonished Miss Pickering for prying into her personal life, reminding her that she did not have the right to the answer of every inquiry she could think of just because she asked.[70]"
  },
  {
    "paragraph_index": 121,
    "raw_text": "In spite of the fact that the security of the castle had been breached more than once as a result of the Calamity, and, having taken into account the prevailing theory that if enough people focused on something, it could affect how said phenomenon behaved, the decision to permit the annual and always much anticipated Inter-House Quidditch League to go on as planned was not one Minerva made lightly. Having concluded, however, that the collective disappointment at its cancellation would be more likely to trigger a new surge with Hogwarts at the heart of it than to allow the student body their yearly competition, the new season was held as normal."
  },
  {
    "paragraph_index": 122,
    "raw_text": "It was later noted that the Gryffindor Quidditch team had, despite some injuries on the part of the players, a fine showing that season, as had the Slytherin team, which the Headmistress herself judged to have been deserving recognition for their successes. Having proceeded without incidents for most of its duration, it was only as the final matches of the contest that the Calamity was drawn back to the Scottish Highlands and whisked away with among other things the Hogwarts Quidditch Cup."
  },
  {
    "paragraph_index": 123,
    "raw_text": "Upon learning this, Professor McGonagall alerted the Ministry of Magic, which sent an agent from the Statute of Secrecy Task Force to recover the all. One of the Foundables in question was an old Nimbus 2000, prompting a Chaser on the Gryffindor Quidditch team to grow concerned that her broom, which of the same model, might vanish and be weakened if the same happened to hers, to which her headmistress assured her that the broom in question was almost certainly the echo of the one that once belonged to another, famous student that played on their team years earlier."
  },
  {
    "paragraph_index": 124,
    "raw_text": "When the Gryffindor house ghost, Sir Nicholas de Mimsy-Porpington, was spirited away by the Calamity along with the cup and turned him into a Foundable, Minerva was delighted to see his safe return, stating that she had meant to ask his opinion on the Calamity, seen as how he, being somewhat separated from his original self, just like the Foundables were, perhaps had some interesting insights into the Calamity they had not considered.[71]"
  },
  {
    "paragraph_index": 125,
    "raw_text": "As though the Calamity was not bad enough; conceding with the ongoing catastrophe was also the discovery that various dark and dangerous magical creatures that had once allied themselves with the Dark Lord had began to behave rather conspicuously. McGonagall was present at the Extraordinary General Meeting called at the Ministry of Magic by Minister Hermione Granger in the afternoon[72] of 1 September 2020, where Harry Potter, now the Head of the Department of Magical Law Enforcement, talked about the movements and increased activity of Voldemort's former allies and cautioned vigilance regarding Dark Magic. Minerva also reported that when the staff returned to the school from the summer holidays, they had discovered that someone had taken Boomslang skin and lacewing flies from the Potions stores during the summer break, the ingredients for Polyjuice Potion.[73]"
  },
  {
    "paragraph_index": 126,
    "raw_text": "When Albus Potter and Scorpius Malfoy did not arrive at Hogwarts with the Hogwarts Express on 1 September 2020, McGonagall sent owls to their parents,[74] and later met with Harry Potter, Ginny Potter and Draco Malfoy, along with Minister for Magic Hermione Granger and her husband Ron Weasley, to find them. She suggested that they take Professor Longbottom with them to look for the two boys, as his expertise in Herbology could prove useful in the forest.[75]"
  },
  {
    "paragraph_index": 127,
    "raw_text": "Unbeknownst to the other involved parties, however, by the time the missing students was finally found, they had meddled in time and made changes to past events in the timeline. McGonagall, however, was still Headmistress of Hogwarts in spite of their interference, and tried to advise Harry on interfering in Albus and Scorpius's friendship, but he insisted on keeping them separated and even went so far as to threaten to come down on the school with the full force of the Ministry unless she complied, and insisted that the Headmistress use the Marauder's Map to track their movements to keeping them apart, and McGonagall reluctantly agreed.[31]"
  },
  {
    "paragraph_index": 128,
    "raw_text": "Having half-heartedly carried out Harry's instruction and used the map a few times, and once purposefully ignored the two because they were under the Invisibility Cloak and she felt justified in pretending she could not truly know they were together lest she saw them.[76]"
  },
  {
    "paragraph_index": 129,
    "raw_text": "Shortly after, she received another visit from Harry, Ginny and Draco. Upon seeing them, McGonagall turned to Harry and informed him that come what may, she wanted no further part in ruining friendships, to which he apologised for the way he had spoken to her, and asked that she used the map to find Albus and Scorpius so that he can apologise to him too, having finally realised that he had been dangerously isolating his son by refusing to let him be with the only friend he had. Inclined to grant his request, McGonagall used the map to discover that they were in the girls' bathroom on the second floor.[77] McGonagall and the parents tried to find them, but Moaning Myrtle revealed that they had gone beyond their reach by using a Time-Turner to go back in time in order to save Cedric Diggory from death at the hands of Peter Pettigrew, much to McGonagall's shock.[78]"
  },
  {
    "paragraph_index": 130,
    "raw_text": "Albus and Scorpius then drastically changed the timeline again, which Scorpius had to fix himself due to Albus being un-born. After they reunited, McGonagall and others found them on the edge of the Great Lake,[79] and brought them to her office. After they confessed what they had done, McGonagall admonished not only the two students for their serious lack of judgement, but their parents as well for holding onto a Time-Turner that was supposed to be destroyed; reminding them that as noble as they had been in wanting to help Amos Diggory prevent the loss of his son, their meddling had returned them to the darkest times of the wizarding war, and to never forget that the current, peaceful world they lived in had been created in part exactly because of the sacrifices made by those that had laid down their lives to fight for it. As punishment for their recklessness, she put them both in detention for the reminder of the year, placed on them both a blanket ban on all future Hogsmeade trips and cancelled Christmas before telling them to find the Time-Turner that Scorpius had found to be missing upon emerging from the lake when they had returned in the original timeline.[80]"
  },
  {
    "paragraph_index": 131,
    "raw_text": "Not too long afterwards, however, McGonagall received another message from Harry Potter late one evening, and joined him at the Slytherin common room. When they found the two friends had left the dormitory and missing once again, she took with her fellow student Craig Bowker Junior to \"turn the school upside down\" to find them again.[81]"
  },
  {
    "paragraph_index": 132,
    "raw_text": "Later, Craig was found dead at Hogwarts, which prompted a second Extraordinary General Meeting at the Ministry. McGonagall was present when Hermione announced that their investigation revealed Voldemort had a daughter. When Headmistress McGonagall inquired as to why the girl had not been taken into custody, Hermione admitted that she had \"hidden herself in time\" through the use of the very time-turner that Scorpius had sworn he had lost. While McGonagall was shocked at and criticised their failure to destroy said object, the meeting ended with a personal victory for Harry, Ron, Hermione, Ginny and Draco when they all took the floor together and publicly united ranks in order to save their children.[11]"
  },
  {
    "paragraph_index": 133,
    "raw_text": "In late November the same year, the Ministry's internal Calamity Management Team discovered the existence of a secret society known as The Unforgivable, as well as evidence that suggested that it had not only been manipulating the Calamity from the start. This was a feat that they had so far only thought that Grim Fawley (who caused it) and Harry Potter (who helped spearhead the efforts to contain and understand it) was capable of, but also believed to have been behind the disappearances of the London Five.[82]"
  },
  {
    "paragraph_index": 134,
    "raw_text": "Headmistress McGonagall, along with the rest of the Statute of Secrecy Task Force, subsequently received a letter about this from Constance Pickering, informing them about their suspicions about the cabal of said and instructed them all to report any anomalities they saw in the Calamity's behaviour.[83]"
  },
  {
    "paragraph_index": 135,
    "raw_text": "Although the very start of the following school term began as uneventfully as one could hope under the circumstances, only three months passed before the school had to send word to Constance Pickering to inform her that a fifth surge had centred itself around Hogwarts. The surge, though its effects were notably less dire than they could, and indeed had been previously, nevertheless warranted remedying, as it had whisked away with a number of the painted likeness and departed souls of some of Hogwarts' finest; more specifically, the portraits of the four Founders and the resident House ghosts.[84]"
  },
  {
    "paragraph_index": 136,
    "raw_text": "After the Statute of Secrecy Task Force successfully recovered that which had been lost to the first wave of the surge, the Headmistress came across the ghost of Hufflepuff House, who explained how he had just conversed with Grim Fawley, who had asked him to \"mind the portraits\". Having scoured the castle without finding any signs of him in the castle, nor any other intruder for that matter, Minerva, upon seeing that the Fat Friar remained adamant that the exchange had indeed taken place, nevertheless decided to increase patrols around the castle before she went to the Ministry of Magic to notify the rest of the Calamity Management Team.[84]"
  },
  {
    "paragraph_index": 137,
    "raw_text": "Upon arriving at their underground headquarters in London, Minerva found the Minister for Magic in the middle of overseeing the efforts that went into stamping out the ongoing surge. Hermione, who had previously discovered that the he had found a way to influence the Calamity to the extent that he could actually modify its behaviour and guide the focus of the the surges,[85] theorised that Grim Fawley had created the surge and attached a false memory to the Fat Friar's Foundable as a way of trying to tell them something important, as he had communicated with them this way before. With this in mind, the Headmistress returned to Hogwarts, but not before assuring her that she would be telling Sir Cadogan and the other portraits around the school to keep an out for anything that was out the ordinary.[84]"
  },
  {
    "paragraph_index": 138,
    "raw_text": "Although two weeks would pass before the second wave of the surge came to pass, Headmistress McGonagall was still obliged to pay another visit to the Ministry when, on 22 December, the spectral knight of Gryffindor House were found in the Grand Staircase. Having reportedly been instructed by Grim Fawley to stand guard \"until he's been found\", suggesting that Fawley were trying to tell them that someone was hidden either in or behind one of the portraits there. Hermione, who had never heard of such a thing happening before, questioned as to whether it was even possible for that to be the case, to which Minerva dryly remarked that if a lifetime of service to the ancient school had taught her anything at all, it was that anything was possible at Hogwarts.[84]"
  },
  {
    "paragraph_index": 139,
    "raw_text": "Sometime later, Headmistress McGonagall was made aware that her erstwhile student had reached out to one of school's resident ghosts once more when a curious student in Ravenclaw House had spotted The Grey Lady canvassing the Grand Staircase and, when they asked what she had been up to, been told that she was \"helping Grim search\" before she left the area. Upon learning this, Minerva tried to track down to make some further inquiries, only to discover that she had apparently gone missing as well. Minerva would later visit the Ministry to inform her colleagues on the new development. Later, the Ministry discovered a cryptic note written in Grim's own handwriting, explaining that the person Grim wanted them find were \"waiting for them where the Prince of Enchanters was enthroned\".[84]"
  },
  {
    "paragraph_index": 140,
    "raw_text": "By the time they had solved the riddle, however, Minerva had already sent an urgent owl to inform them all that Sir Nicholas had found two individuals trapped within the portrait of  Merlin: The first was the Grey Lady, which explained her sudden disappearance. The second one, however, was incredibly enough none other than Kit Gerrard, a former reporter for the Daily Prophet and one of the missing London Five.  Following this, the Headmistress gave a number of Curse-Breakers permission to enter school grounds, who were eventually able to free them both, the latter of which were transported the latter to St Mungo's Hospital for Magical Maladies and Injuries.[86]"
  },
  {
    "paragraph_index": 141,
    "raw_text": "In late March of 2021, Minerva was once again contacted by Harry Potter; this time for the purpose of asking the Headmistress for permission to station a party of Aurors at Hogwarts Castle for extra security. Having been locked in something of a cold war with The Unforgivable since they first learned of their activities and actively sought to wrestle away from them their control of The Calamity, the new Head of Department had successfully intercepted their incoming surge and redirected it towards his secondhand memories of theMarauders, the reprecussions of which had been what had appeared to be a veiled threat that the cabal planned to go after their children as means of coercing them into ceasing their efforts to twhart them.[87]"
  },
  {
    "paragraph_index": 142,
    "raw_text": "Upon learning this, Minerva readily agreed to have the Dark wizard catchers help protect the school and put the staff on high alert. Each of their children was personally assigned an Auror to guard them, and Minerva would henceforth send report back to the Ministry on a regular basis to inform them on the situation. At one point, Minerva's owl had been delayed by bad weather. Afraid that this might mean that something was amiss, the Headmistress was startled when the recipient of her letters came bursting into her office, wand at the ready. Having assured him that everything had been quiet, thus allowing Harry to rest easy and return to the Ministry of Magic to continue his work with the Statute of Secrecy Task Force.[87]"
  },
  {
    "paragraph_index": 143,
    "raw_text": "On 2 April, however, the Calamity Management Team was horrified to learn that their threat of teaching Harry \"a lesson they don't cover at Hogwarts\" had been deliberately misleading; and that while the Ministry had been preoccupied securing the school, members of the cabal had gone to Diagon Alley and, with the help of Polyjuice Potion to assume the identities of Barnabas Cuffe and Hermione, tried to get the jump on Ron and Ginny at work. And whilst the latter had been admitted to St Mungo's to recuperate from her injuries, she had noticed that something was off and successfully driven away her assailant, Ron, on the other hand, had been caught off guard and abducted.[87]"
  },
  {
    "paragraph_index": 144,
    "raw_text": "Devastated to learn about their father's disappearance, Rose and Hugo were both wracked with worry after they heard what had happened, and Minerva, in addition to having done what she could to help them through the trying time ahead of them, also organised another search of the castle's portraits in the unlikely event that Ron would turn up in one of them, to no avail.[88]"
  },
  {
    "paragraph_index": 145,
    "raw_text": "Much to the relief of everyone involved, however, he was finally returned to them after The Unforgivable proposed to give them Ron in exchange for the complete control of The Calamity, and even though the Ministry's effort to use the trade to infiltrate the organisation went awry, both the Ministry and denizens of Hogwarts alike was delighted to learn that he had been found, although Hugo and Rose was left having to cope with the fact that their own father had no recollection of who they were, having been completely Obliviated, and Minerva did her outmost to offer her support.[88]"
  },
  {
    "paragraph_index": 146,
    "raw_text": "Although Minerva played no significant part in the continued struggle against The Unforgivable by the Calamity Management Team, the repercussions of this was still felt by its denizens by the fact of how some of the subsequent surges of the magical disturbance in question was carved from Harry Potter and Hermione Granger's memories of their time as students, as they had found that the manner in which they directed it was crucial to restoring Ron's recollection."
  },
  {
    "paragraph_index": 147,
    "raw_text": "By 31 December 2021, however, the cabal had been defeated, its infiltrators at the Ministry of Magic identified and apprehended, Ron's memory completely restored, and Grim Fawley had been found and reunited with his wife, and the Calamity was slowly fading away, allowing life at Hogwarts to finally return to normal.[89]"
  }
]