[
  {
    "paragraph_index": 0,
    "raw_text": "Draco Lucius Malfoy was born on 5 June 1980, to Lucius and Narcissa Malfoy (née Black),[12] who were both born into old, wealthy pure-blood families. Both the Malfoys and the Blacks had traditionally been in Slytherin House for centuries and strongly disapproved of any relatives who did not follow in this tradition, such as Sirius Black.[13] His mother sang him a secretive lullaby which had been passed down to the Black family.[14]"
  },
  {
    "paragraph_index": 1,
    "raw_text": "Draco was raised in an atmosphere of regret that Lord Voldemort had not succeeded in taking command of the wizarding community, although he was prudently reminded that such sentiments ought not to be expressed outside the small circle of the family and their close friends 'or Daddy might get into trouble'. The Malfoys were very proud of their Pure-blood and social status; until 1996, they were able to maintain a respectable public image while being allied with Lord Voldemort. Lucius was a Death Eater who avoided imprisonment in Azkaban following the First Wizarding War by claiming that he had been under the Imperius Curse, while Narcissa merely agreed with the ideology of pure-blood supremacy."
  },
  {
    "paragraph_index": 2,
    "raw_text": "The Malfoys spoiled their son, giving him the best of everything as far as material possessions go. The only two hand-me-down things Draco ever received were the old family prejudice against Muggles, Muggle-borns, half-breeds, and blood traitors — in short, prejudice against anyone who was not a pure-blood wizardkind or anyone who supports these types of people — and the Malfoy family's vast collection of powerful dark artifacts harking back to the family history."
  },
  {
    "paragraph_index": 3,
    "raw_text": "In his childhood, Draco associated mainly with the pure-blood children of his father's ex-Death Eater cronies and therefore arrived at Hogwarts with a small gang of friends already made, including Theodore Nott and Vincent Crabbe.[1] He visited the school himself when Lucius came to inspect, and his father entrusted Jacob's sibling and Merula Snyde to be his chaperones, a decision which did not rub off well with any of the three. Lucius had requested the two in particular, as Jacob's sibling was ostensibly the best student in their year whilst Merula was the daughter of two of Lucius's former Death Eater colleagues and thus considered the 'right' type of person for Draco to associate with. Draco did not endear himself to either student, however, particularly with his snobbish and disdainful attitude towards them and open displays of prejudice.[15]"
  },
  {
    "paragraph_index": 4,
    "raw_text": "During the visit, Draco stole his father's wand, as he was too young to have his own and wanted to perform magic after seeing Merula perform the Jelly-Legs Curse on Jacob's sibling. Lucius initially blamed the theft on their House-elf Dobby, as the perpetrator knew he kept his wand inside his walking stick, which wasn't common knowledge. Jacob's sibling investigated and returned the wand to Lucius.[16]"
  },
  {
    "paragraph_index": 5,
    "raw_text": "Whilst Lucius was at the Three Broomsticks Inn negotiating a supply of Butterbeer for Malfoy Manor, he brought Draco along, who wanted to go to Honeydukes. When Jacob's sibling attempted to ask Lucius about his wife, Narcissa, they were made the chaperone of Draco again. Draco convinced Jacob's sibling to take him to Honeydukes, with the promise that he would tell Jacob's sibling anything they wanted to know about his mother. Draco eventually ended up telling Jacob's sibling about the Black family lullaby which his mother would sing to him every night, which turned out to be the key to unlocking Narcissa's lock on the Black sisters' keepsake box.[17]"
  },
  {
    "paragraph_index": 6,
    "raw_text": "When it was nearing the time for Draco to attend school, his father wanted him to attend Durmstrang Institute, a school in Northern Europe that taught the Dark Arts and did not admit Muggle-borns. Additionally, he believed that the son of a member of the Hogwarts Board of Governors not attending Hogwarts would be a great scandal and could potentially force Dumbledore to retire. However, Draco's mother did not like the idea of him going to school far away, though ultimately convinced Lucius to make it Draco's choice where he went to school. Lucius attempted to influence his son's decision by bringing him on a surprise inspection of Hogwarts during the 1986–1987 school year, during which he vocally derided the state of the school and Slytherin House in particular to his son and attempted to bribe Draco's chaperone, Jacob's sibling, into influencing Draco's decision. During this visit, Draco got caught up in the investigations into a conspiracy against Slytherin, and helped bring the conspirators to justice. For this, Professor Snape thanked him in front of the whole hall, which made Draco certain he wanted to attend Hogwarts, much to his father's derision. He also revealed that Narcissa had promised him a second birthday cake if he picked Hogwarts. Thus they sent him to Hogwarts.[3][16][18]"
  },
  {
    "paragraph_index": 7,
    "raw_text": "When Draco went to Diagon Alley to shop for school supplies in 1991, he met Harry Potter in Madam Malkin's Robes for All Occasions without knowing who he was. He made a rather intolerant speech about Muggle-borns and Rubeus Hagrid but otherwise acted in quite a friendly manner towards Harry Potter.[19]"
  },
  {
    "paragraph_index": 8,
    "raw_text": "While on the Hogwarts Express for the very first time, Draco Malfoy offered his friendship to Harry Potter, as his father believed that Harry was a Dark wizard, and Draco wished to impress him and relay some interesting news home. However, Harry didn't like the attitude Draco expressed towards Ron Weasley, with whom Harry had already made friends, and also found that Draco reminded him of his cousin Dudley with his disdainful attitude. Thus, he turned him down, creating animosity that lasted through the rest of their schooling.[19]"
  },
  {
    "paragraph_index": 9,
    "raw_text": "Once at Hogwarts, Draco was Sorted into Slytherin House, like many other members of his family. He rapidly formed friendships with fellow Slytherins while remaining hostile toward Harry to the point of challenging him to a duel after Harry beat him to Neville Longbottom's Remembrall during their first Flying lesson. This was, in fact, an attempt to get Harry into trouble for being out after curfew. He resented the attention Harry received because of his fame and his prodigious flying ability, which led to Harry being permitted to join his house's Quidditch team at a younger age than most.[19]"
  },
  {
    "paragraph_index": 10,
    "raw_text": "Later in the year, Draco discovered Harry's plan to smuggle Hagrid's pet dragon Norbert out of the castle and informed Professor McGonagall of it but was put in detention as well for being out past curfew. For his detention, Draco had to assist Hagrid, Harry, and Hermione, who had been caught shortly after smuggling Norbert out, as well as Neville Longbottom, who had tried to warn them about Draco, in finding a wounded unicorn. This was a task he greatly resented because he found it to be 'servants' work'. His protest was shot down by Hagrid who told Draco to either do his detention or get expelled. He and Harry witnessed Voldemort, inhabiting the body of Quirinus Quirrell, drinking the blood of a unicorn and ran away in fear leaving Harry behind.[19]"
  },
  {
    "paragraph_index": 11,
    "raw_text": "At the end of the school year, Draco was initially overjoyed that Slytherin was on course to win the House Cup again but was very dejected to see Gryffindor win the cup once Albus Dumbledore awarded Harry, Ron, Hermione, and Neville additional house points for their brave actions.[19]"
  },
  {
    "paragraph_index": 12,
    "raw_text": "Before the start of his second year, Draco Malfoy was present at Flourish and Blotts on the day Harry, the Grangers and the Weasleys were shopping for Gilderoy Lockhart's new Hogwarts textbooks. After Harry was given a free copy of books by Lockhart personally, Draco afterwards approached him to insult him, and after Ginevra Weasley defended him, he mocked her as his girlfriend (unintentionally predicting the future). Draco's father Lucius Malfoy, who met Harry for the first time, was also present and also encountered Arthur Weasley, who he insulted for associating with Muggles, such as the Grangers. Arthur then attacked Lucius in an angry rage, prompting them all to leave the shop.[13]"
  },
  {
    "paragraph_index": 13,
    "raw_text": "In his second year at Hogwarts, Draco attained the position of Seeker on the Slytherin Quidditch team. His father bought the entire team new Nimbus 2001s because of this, though Hermione Granger openly speculated that this was, in fact, what got Draco on the team at all. Draco responded angrily to this accusation and called Hermione a 'filthy little Mudblood', causing the Gryffindor Quidditch team to lash out at him; Ron tried to curse him to vomit slugs, but the spell backfired due to his broken wand, which Draco and his team found very amusing.[13]"
  },
  {
    "paragraph_index": 14,
    "raw_text": "Ironically, Draco was the reason why Slytherin lost to Gryffindor that year in Quidditch because he was unaware that the Golden Snitch was hovering inches above his own left ear--too busy insulting Harry Potter to notice. Harry took advantage of the lapse in concentration, allowing Gryffindor to win the match and Draco to be reprimanded by the team captain Marcus Flint for his stupidity, which was witnessed by George Weasley.[13]"
  },
  {
    "paragraph_index": 15,
    "raw_text": "During a meeting of the short-lived Duelling Club that year, Draco duelled Harry Potter. He conjured a snake after being encouraged by Professor Snape and was disappointed when Harry thwarted the attack by speaking to the serpent in Parseltongue. This led many students to suspect that Harry was the Heir of Slytherin, who had opened the Chamber of Secrets and released a 'monster'. This caused Draco to be upset that any one would actually think that 'saint Potter, the Mudbloods' friend' could be the heir of Slytherin, which was something that he thought was completely ridiculous.[13]"
  },
  {
    "paragraph_index": 16,
    "raw_text": "Harry, Ron, and Hermione suspected that Draco might be the Heir, given his bigoted views on Muggle-borns and his family's tradition of being Sorted into Slytherin House. Hermione brewed Polyjuice Potion in the girls' third floor bathroom so that Harry and Ron were able to disguise themselves as Gregory Goyle and Vincent Crabbe respectively and enter the Slytherin common room. There, Draco unwittingly revealed through conversation that he was not the heir, nor did he know who it was. He did tell them that the Chamber had been opened fifty years ago and that he wished he could help the true heir.[13]"
  },
  {
    "paragraph_index": 17,
    "raw_text": "It was, in fact, Draco's own father who had schemed to get the Chamber of Secrets opened by planting an old diary of Tom Riddle's on first-year student Ginny Weasley, though his true target in this plot was her father Arthur. It does not appear that Draco was aware of this, as Lucius's instructions to his son that year were to 'keep his head down'. The diary was a Horcrux, containing a piece of Voldemort's soul, and it was destroyed when Harry stabbed it with a Basilisk fang while in the chamber itself.[13]  When Professor Sprout and Madam Pomfrey were applauded for bringing everyone who was petrified back to their normal ways, Draco did not clap for them, but instead gave them an evil snobbish look.[13]"
  },
  {
    "paragraph_index": 18,
    "raw_text": "Draco started off his third year by mocking Harry's reaction to the Dementors that were near Hogwarts that year searching for escaped Azkaban prisoner Sirius Black despite being terrified of them himself. He also hinted at Black's crimes regarding Harry and his late parents, which Harry was unaware of for some time, and told him that if someone had betrayed and got his parents killed  — as it was believed Black had done to the Potters — he would seek revenge.[20]"
  },
  {
    "paragraph_index": 19,
    "raw_text": "In a Care of Magical Creatures lesson, Draco unintentionally provoked the Hippogriff Buckbeak and was injured, though he exaggerated how badly he was hurt for attention and in an attempt to use the incident against Rubeus Hagrid to get him fired.[20]"
  },
  {
    "paragraph_index": 20,
    "raw_text": "During the Quidditch match against Ravenclaw, Draco, Vincent Crabbe, Gregory Goyle, and Marcus Flint attempted to undermine Harry's performance by posing as Dementors — Draco standing on Goyle's shoulders — but they were all knocked over by Harry's first successful automatic Patronus Charm, clearly unaware that it was the effect the Dementors had on Harry that he had a problem with rather than the Dementors themselves. Their attempt to sabotage Harry's performance ended up costing Slytherin House 50 points, receiving detention from Professor McGonagall, as well as getting reprimanded off-screen by Professor Dumbledore.[20]"
  },
  {
    "paragraph_index": 21,
    "raw_text": "When Draco mocked Hagrid for how upset he became over the case, Hermione slapped Draco in anger. Lucius tried to get the creature executed, and although he was successful in obtaining this sentence, Buckbeak was saved through the efforts of Harry and Hermione with the help of a time-turner and given to Black when his innocence was proven to Harry, Ron and Hermione. This outcome angered both Draco and his father.[20]"
  },
  {
    "paragraph_index": 22,
    "raw_text": "In 1994, Draco attended the 1994 Quidditch World Cup with his parents. They sat in the Minister for Magic Cornelius Fudge's luxury box as guests of the Minister, due to Lucius's large donation. He was seated directly behind the trio and the Weasleys. He taunted Harry Potter, Ron Weasley, and Hermione Granger when a group of Death Eaters began terrorising the campers after the game, mocking the Muggles they were tormenting and implying that they would do the same to Hermione because of her Muggle-born status. Harry asked if his father (Lucius Malfoy) was participating in the riot and he responded with 'if they were, I wouldn't be likely to tell you', as the answer was yes. Once on the train to Hogwarts, Draco proceeded to mock the trio about their lack of knowledge regarding the upcoming school event.[3]"
  },
  {
    "paragraph_index": 23,
    "raw_text": "During his fourth year, Hogwarts hosted the Triwizard Tournament, and, much to Draco's dismay and jealousy, Harry was chosen as a champion despite being too young. Draco supported Cedric Diggory, passing out badges that could be made to read Potter Stinks and taunting Harry regularly, such as commenting that he was betting Harry wouldn't last more than a few minutes with the dragons. He was proven wrong when Harry tied with Viktor Krum for first place and succeeded in capturing his golden egg the fastest.[3]"
  },
  {
    "paragraph_index": 24,
    "raw_text": "He was also the informer and impetus behind Rita Skeeter writing slanderous, sensationalist articles about Harry, Hagrid and Hermione for the Daily Prophet, due to him knowing that she was an Animagus; this assault on Harry's credibility would set the stage for widespread disbelief of Harry's announcement that Lord Voldemort had returned at the end of the school year. Some of the articles that he was partly for was one about Harry and Hermione titled Harry Potter's Secret Heartache.[3]"
  },
  {
    "paragraph_index": 25,
    "raw_text": "When Draco tried to cast a spell at Harry early in the year behind his back, the Defence Against the Dark Arts professor Bartemius Crouch Junior (disguised as Alastor Moody using Polyjuice Potion) transformed Draco into a ferret and bounced him around the room as punishment. Although Professor McGonagall stopped it, Draco was very embarrassed and other students were highly amused; Ron dubbed him 'the Amazing Bouncing Ferret'. Throughout the year, students would tease Draco by telling him that Professor Moody was behind him, causing him to flinch or shudder. Even Hagrid noted that he had heard that Draco had made a good ferret, making Draco not know what to say. At Christmas time, Draco attended the Yule Ball with Pansy Parkinson.[3]"
  },
  {
    "paragraph_index": 26,
    "raw_text": "At the end of the year, Draco mocked Harry about his choice to side against Voldemort and also ridiculed Cedric Diggory's death. Before he could finish, however, he was hit by several curses from Harry, Hermione, Ron, and Fred and George Weasley.[3]"
  },
  {
    "paragraph_index": 27,
    "raw_text": "In 1995, Draco became a Slytherin Prefect along with Pansy Parkinson. He was sure to mock Harry Potter for not receiving the same honour, as Gryffindor's prefects were Hermione Granger and Ron Weasley. He also wrote the lyrics to the demeaning song Weasley is Our King, which mocked Ron's Quidditch abilities as Gryffindor Keeper. It was the invention of this song, as well as insulting Molly and Arthur Weasley and the late Lily Potter to Harry, Fred, and George's faces that prompted Harry and George to get into a fight with Draco. They violently assaulted him, which resulted in the pair (as well as George's twin brother Fred) being banned from all further Quidditch matches, although their bans were later lifted after Dolores Umbridge's sacking from Hogwarts and her being put on suspension for her actions.[21]"
  },
  {
    "paragraph_index": 28,
    "raw_text": "Later that year, he joined Umbridge's Inquisitorial Squad and clearly enjoyed the power this gave him over other students. He held this power over Harry and his friends especially. All of the Squad members were Slytherins, as Umbridge was biased and favoured students of her former house. Draco caught Harry running out of the last meeting of Dumbledore's Army, receiving fifty house points for Slytherin from Umbridge.[21]"
  },
  {
    "paragraph_index": 29,
    "raw_text": "Later, he was among the Inquisitorial Squad members who caught Harry and his friends in their attempt to discover the whereabouts of Sirius Black, whom Harry had seen being tortured in a vision, planted by Lord Voldemort. Harry, Ron, Hermione, Ginny Weasley, Neville Longbottom, and Luna Lovegood were all brought to Umbridge's office, guarded by the Inquisitorial Squad. Before Umbridge could carry through on her threat to use the Cruciatus Curse to make Harry talk, Hermione told Umbridge that they were trying to contact Albus Dumbledore about a 'weapon' that he planned to use against the Ministry of Magic. Draco had an expression of 'eagerness and greed' at this news that convinced Umbridge not to allow him or any other Squad member to accompany her as she took Harry and Hermione into the Forbidden Forest in search of the alleged weapon.[21]"
  },
  {
    "paragraph_index": 30,
    "raw_text": "After Umbridge left, the remaining D.A. (Dumbledore's Army) members used a litany of Stunning Spells and Disarming Charms to escape the office; Draco was hit by Ginny's Bat-Bogey Hex. It was soon revealed that Hermione had been lying about a weapon; Umbridge was carried off by centaurs and the six D.A. members flew to the Ministry, where the Battle of the Department of Mysteries ensued.[21]"
  },
  {
    "paragraph_index": 31,
    "raw_text": "Draco's father was seen participating in the battle as a Death Eater and was imprisoned in Azkaban for his crimes. Draco was very upset by this and mainly blamed Harry, swearing vengeance and attempting to attack him at the end of the school year with the help of Vincent Crabbe and Gregory Goyle. However, other D.A. members came to Harry's defence, resulting in Draco, Crabbe, and Goyle ending up looking like ugly slug-like things after being hit by a number of hexes by all D.A. Members at the same time.[21]"
  },
  {
    "paragraph_index": 32,
    "raw_text": "By late 1996, Draco joined the Death Eaters, having replaced his incarcerated father. He bragged about having been given a mission to his fellow Slytherin students on his way to school on the Hogwarts Express. However, as the year dragged on, Draco became increasingly afraid that he would fail in his seemingly impossible task — to kill Albus Dumbledore. It is implied that Draco was expected to fail and that Voldemort assigned him the task with the intention of punishing Lucius Malfoy for his failure at the Department of Mysteries."
  },
  {
    "paragraph_index": 33,
    "raw_text": "The safety of his family rested on Draco's success with his mission. When Harry overheard some parts of Draco's conversation with his fellow Slytherins about the mission, Draco used a Full Body-Bind Curse to paralyse Harry and stomped hard on his face, crushing his nose, in revenge for imprisoning his father, Lucius, causing Harry to hate Draco more than ever, while disregarding what Harry heard as not important enough to condemn him.[22]"
  },
  {
    "paragraph_index": 34,
    "raw_text": "Draco planned to repair a Vanishing Cabinet that Peeves had destroyed four years previously, in order to smuggle Death Eaters into Hogwarts to assist him in killing Dumbledore. In his previous year at Hogwarts a fellow Slytherin, Graham Montague, had been forced into it by the Weasley twins and later managed to apparate out as a last resort to free himself from the limbo-like space into which he had vanished. Montague told Draco that during his time trapped in limbo, he could hear the sounds entering the cabinet from the school, as well as the sounds entering the cabinet's twin in Borgin and Burkes. Draco realised from this that if the broken one was repaired, the cabinets could act as a passageway into the school.[22]"
  },
  {
    "paragraph_index": 35,
    "raw_text": "During the summer break between his fifth and sixth year, Draco questioned Borgin, the owner of Borgin and Burkes, on repairing the cabinet and ordered him to keep the other one safe. As a proof of his allegiance to Lord Voldemort, Draco showed Borgin the Dark Mark now branded on his arm whilst threatening to set Fenrir Greyback to attack the shop-owner, should he disobey his commands. This meeting was also overheard by Harry, Hermione, and Ron, but while Harry started to suspect Draco of Death Eater activities, Ron and Hermione dismissed such possibilities, and believed Draco was merely bluffing, a choice that they would much later regret.[22]"
  },
  {
    "paragraph_index": 36,
    "raw_text": "In preparation for such a dangerous mission, Draco trained and improved his own skills, and became capable of blocking jinxes nonverbally. He also became accomplished at Occlumency through the training of his maternal aunt Bellatrix Lestrange, and was able to perform the very difficult Protean Charm,[22] though he could not yet produce a corporeal Patronus.[23]"
  },
  {
    "paragraph_index": 37,
    "raw_text": "In focus for his mission of fixing the Vanishing Cabinet, Draco experienced many visible changes in his life. He seemed to have lost interest in Quidditch, and allowed (and possibly paid) Harper to take over instead. He was also becoming more neglectful in his school-work, as he missed two Transfiguration homework assignments and received detention on the day of the Hogsmeade weekend trip, as well as not attending to his prefect duties, which he would usually happily abuse as he did in the previous year. Another change was that he no longer trusted Snape and was willing to speak ill towards him point-blank, no respect."
  },
  {
    "paragraph_index": 38,
    "raw_text": "Socially, Draco forced Crabbe and Goyle to assume the forms of other people with Polyjuice Potion, to help him keep watch outside the Room of Requirement, while refusing to tell them anything, and seemingly to distance himself from them. Draco also spent less time mocking Harry and his friends, despite the many opportunities. Even his physical appearance showed the stress, with greying skin, weight loss and bags under his eyes. Most of this frustrated Harry, who was unable to discover exactly what Draco was up to despite his persistence and effort.[22]"
  },
  {
    "paragraph_index": 39,
    "raw_text": "Twice during the school year he feared he would be unable to repair the cabinet, and resorted to desperate assassination attempts, such as trying to smuggle in a cursed necklace and trying to send Dumbledore poisoned mead. Both these attempts failed and resulted in innocent people getting injured, though since they both survived Dumbledore was not forced to apprehend Draco. The stress began to affect Draco adversely, and he confessed his fears to Myrtle Warren, one of the school's ghosts. On one such occasion, Harry stumbled on him. Draco reacted by starting to cast the Cruciatus Curse, but Harry sliced his skin open with his wand right before he could complete the incantation. Draco was hospitalised and Harry was given detention by Snape for every Saturday until the end of term.[22]"
  },
  {
    "paragraph_index": 40,
    "raw_text": "Eventually, through copious amounts of work Draco managed to repair the Vanishing Cabinet and used it to let at least six Death Eaters into the castle: Corban Yaxley, Alecto Carrow, Amycus Carrow, Gibbon, Thorfinn Rowle, and the vicious werewolf Fenrir Greyback. Proceeding to the top of the Astronomy Tower, Draco was able to corner a significantly weaker Dumbledore, disarming the latter the same instant he had, unknown to Draco, bound Harry Potter with a Full Body-Bind Curse.[22] It was also at the moment when he disarmed Dumbledore that he unknowingly gained the allegiance of the Elder Wand, one of the three Deathly Hallows.[24]"
  },
  {
    "paragraph_index": 41,
    "raw_text": "However, when Draco was finally given the opportunity to kill Dumbledore, who had just expressed his willingness to protect Draco and his family were they to 'come over to the right side', he could not bring himself to commit murder; considering that they spent the few minutes of alone time to discuss how Draco smuggled his accomplices into the castle, Dumbledore concluded that Draco would find committing murder impossible. As predicted, Draco ultimately was unable to do it, instead lowering his wand. Snape, who had made an Unbreakable Vow with Narcissa to step in if Draco failed in his task, used the Killing Curse on the Headmaster. Snape then promptly led Draco out of the school grounds, presumably to safety, but really to get to a safe distance to disapparate to Lord Voldemort.[22]"
  },
  {
    "paragraph_index": 42,
    "raw_text": "After the Battle of the Astronomy Tower, Draco could no longer return to Hogwarts, as he was an accomplice, however reluctantly, in the revered Albus Dumbledore's murder, mainly by being the one who let Death Eaters penetrate the castle's walls. The official criminal status placed on him, alongside his fear of the Dark Lord's wrath, led him to seek refuge, along with his family, with Voldemort, in the hopes of satisfying his orders to prevent any more negative highlights.[22]"
  },
  {
    "paragraph_index": 43,
    "raw_text": "His abrupt departure from the school left Vincent Crabbe and Gregory Goyle surprisingly lonely, despite the two being hulking boys, as Harry described during Dumbledore's funeral.[22]"
  },
  {
    "paragraph_index": 44,
    "raw_text": "Draco reluctantly participated in Death Eater activities before the beginning of the 1997–1998 school year. Due to Draco's helpful role in Dumbledore's death, Voldemort liberated Lucius from Azkaban. He witnessed the murder of Charity Burbage and tortured Thorfinn Rowle on Lord Voldemort's orders. Judging by later remarks made by Vincent Crabbe, it seems that the Malfoys had lost much of their influence in the Death Eater circles. This is due to Voldemort no longer holding Lucius in high esteem and shifting his favour to Draco's maternal aunt Bellatrix Lestrange and Hogwarts teacher Severus Snape."
  },
  {
    "paragraph_index": 45,
    "raw_text": "When Thorfinn Rowle and Antonin Dolohov failed to capture Harry, Voldemort forced Draco to torture them via the Cruciatus Curse as punishment, with the threat of Voldemort's wrath if Draco failed to comply. Harry, who saw this scene via his mental link with Voldemort, was disgusted at what the Dark Lord was forcing the young Death Eater to commit.[24]"
  },
  {
    "paragraph_index": 46,
    "raw_text": "Draco attended his seventh year of Hogwarts that year. During the Easter holidays, Draco was seen at home in Malfoy Manor. He was called upon by his parents and aunt Bellatrix Lestrange to confirm the identities of Harry, Ron and Hermione, who were caught by a group of Snatchers led by Fenrir Greyback, but Draco showed great hesitation in doing so. When Hermione lied to Bellatrix under torture about Godric Gryffindor's Sword, Draco was sent to fetch the goblin, Griphook, from the dungeons to get confirmation of the story, which he did by lying saying it was a fake, but the truth was it was the true sword. Later in the evening, the prisoners managed to escape, and Draco's wand was taken by Harry. Afterwards, Draco and his family were detained to the Manor by Lord Voldemort. Narcissa would lend Draco her wand; it was powerful, yet it didn't 'understand' him, as he had not won its loyalty.[24]"
  },
  {
    "paragraph_index": 47,
    "raw_text": "Later that same year, during the Battle of Hogwarts, Draco, along with Crabbe and Goyle, chose to remain in the school as their fellow Slytherins evacuated in order to bring Harry Potter to Lord Voldemort. Given Lucius's previous remarks alluding to 'forgiveness', it is likely that Draco was doing this in an attempt to redeem his family in Voldemort's eyes. He, Crabbe and Goyle followed the Trio into the Room of Requirement where he would attempt to capture Harry and retrieve the item Harry was trying to locate. However, he no longer exercised the same degree of control over his friends, particularly Crabbe, that he once had.[24]"
  },
  {
    "paragraph_index": 48,
    "raw_text": "Despite Draco telling his friends that Harry was to be brought back alive, Crabbe attempted to kill him by conjuring Fiendfyre. Since Crabbe was unable to control the curse, the Room of Requirement quickly filled with fire. Draco went out of his way to try to save both of his friends, but he only managed to get Goyle, who had been stunned by Hermione during the fight, onto Ron and Hermione's broom before he let Harry fly them out. Crabbe was killed in the fire, leaving Draco very upset.[24]"
  },
  {
    "paragraph_index": 49,
    "raw_text": "Harry, Hermione, and Ron later spotted Draco pleading with a Death Eater that he was on his side. Harry stunned the Death Eater and Ron punched Draco and called him a 'two-faced bastard', as this was the second time they saved his life that night.[24]"
  },
  {
    "paragraph_index": 50,
    "raw_text": "Although Draco was unaware of this, his act in disarming Dumbledore before his death and mastering the Elder Wand ultimately resulted in the Dark Lord's final defeat at the hands of Harry. This is due to the fact that Voldemort was unable to fully understand the Elder Wand's power and Harry disarming Draco of his wand resulted in him mastering the Elder Wand himself.[24]"
  },
  {
    "paragraph_index": 51,
    "raw_text": "After Voldemort's defeat, Draco and his parents sat in the Great Hall, looking uncertain of their place during the victory celebrations.[24]"
  },
  {
    "paragraph_index": 52,
    "raw_text": "The events of Draco's teenage years forever changed his life. He had the beliefs in which he had grown up challenged in the most frightening way, had experienced terror and despair, witnessed his parents suffering for their allegiance, and had witnessed the crumbling of all that his family had believed in."
  },
  {
    "paragraph_index": 53,
    "raw_text": "Draco and his family avoided imprisonment in Azkaban due to their last-minute switch in allegiance. Lucius found his son as affectionate as ever but refusing to follow the old pure-blood line.[1]"
  },
  {
    "paragraph_index": 54,
    "raw_text": "Draco eventually married Astoria Greengrass, the younger sister of fellow Slytherin classmate Daphne Greengrass,[25] who had gone through a similar, though less violent and frightening, conversion from pure-blood ideals to a more accepting and tolerant way of life. This was something of a disappointment for Lucius and Narcissa, who had higher hopes of someone whose family was included in the 'Sacred Twenty-Eight'.[1]"
  },
  {
    "paragraph_index": 55,
    "raw_text": "The two had a son together, named Scorpius Malfoy, who was raised by his mother not to believe that Muggles and Muggle-borns were scum; as such, family gatherings were fraught with tension.[1] Draco raised Scorpius to be a much kinder and more accepting Malfoy than he was in his youth.[1]"
  },
  {
    "paragraph_index": 56,
    "raw_text": "On 1 September 2017 while sending his son off for his first year at Hogwarts, Draco greeted Harry, Ron, Hermione, and Ginny at King's Cross Station with a curt nod. The relationship between Harry and Draco was much better than it had been when they were students together, but they were still not considered to be anything at all near friends."
  },
  {
    "paragraph_index": 57,
    "raw_text": "Independently wealthy without any need to work, Draco inhabited Malfoy Manor with his wife and son. His hobbies — which included keeping the family's old collection of Dark artefacts (which he did not use and kept in glass cases) and studying alchemical manuscripts — were indications of his dual nature, and hint at a desire for something more than wealth.[1]"
  },
  {
    "paragraph_index": 58,
    "raw_text": "In an alternate timeline unintentionally created by Scorpius and his friend Albus Potter, Draco also teamed up with his former enemies and time-travelled back to fight against Delphini at St Jerome's Church in order to stop her from preventing Lord Voldemort's death."
  }
]