[
  {
    "paragraph_index": 0,
    "raw_text": "Ronald Bilius Weasley was born 1 March 1980, to Arthur and Molly Weasley (née Prewett),[11] at the height of the First Wizarding War. During this war his maternal uncles Fabian and Gideon Prewett, both members of the Order of the Phoenix, were murdered while fighting a group of four Death Eaters led by Antonin Dolohov.[5] While he was still a toddler, the war ended for a time after Lord Voldemort's first defeat at the hands of Ron's classmate-to-be Harry Potter on the 31 October 1981."
  },
  {
    "paragraph_index": 1,
    "raw_text": "Ron and his five older brothers — Bill, Charlie, Percy, Fred and George — as well as his younger sister, Ginny, grew up in The Burrow on the outskirts of Ottery St Catchpole in Devon, England. Like all his siblings, he was home educated in reading, writing and simple mathematics by his mother. The Weasley family was not wealthy at all, compared to other wizarding families.[31] Many other pure-blood families, particularly the Malfoys, disdained them for their \"blood traitor\" beliefs and lack of wealth. They tried their best to make up for this with their love.[32]"
  },
  {
    "paragraph_index": 2,
    "raw_text": "The Weasley siblings, especially Fred and George, were fond of teasing and playing pranks on each other, and Ron was a particular target for Fred and George. They once Transfigured Ron's teddy bear into a giant spider, sparking his arachnophobia. On another occasion, the twins nearly got him to make an Unbreakable Vow, which finally made their father truly furious (and Fred would later state that his left buttock has \"never been the same since\" after the row that ensued). They also once got him to eat an Acid Pop which burnt a hole through his tongue."
  },
  {
    "paragraph_index": 3,
    "raw_text": "When Ron was younger, he had a pet rat named Scabbers, whom he had inherited from Percy. This rat was actually Peter Pettigrew, an informant and Voldemort's servant who betrayed Harry's parents. Ron was very fond of Scabbers, but wasn't sad to let him go when he found out the truth about his old rat.[31][33] Ron had a fairly happy childhood, which Harry envied, having been brought up by his spiteful relatives, the Dursley family. To compensate for their impoverishment, Ron's mother indulged him in three delicious meals daily. This became so habitual that missing a meal in later life would irritate Ron."
  },
  {
    "paragraph_index": 4,
    "raw_text": "Ron began to attend Hogwarts School of Witchcraft and Wizardry in 1991 at the customary age of eleven. He was Sorted into Gryffindor House, like every other Weasley. On his first trip on the Hogwarts Express, Ron met and became friends with the famous wizard Harry Potter. Harry let him share his carriage on the Hogwarts Express and purchased a large amount of wizarding snacks from the Hogwarts Express food trolley to share with him. Later on, Harry would stand up for Ron against Slytherin bully Draco Malfoy and Ron would elect to be his second for a midnight duel.[11]"
  },
  {
    "paragraph_index": 5,
    "raw_text": "Ron and Harry first met Hermione Granger on the train but Ron did not particularly take to her. Ron, especially, was annoyed by what he saw as Hermione showing off her knowledge of magic, such as when she corrected him on the pronunciation of the incantation Wingardium Leviosa.[11]"
  },
  {
    "paragraph_index": 6,
    "raw_text": "Prior to the Hallowe'en feast, Ron angrily declared that Hermione was a know-it-all and did not have any friends. Hermione overheard his outburst and went running to the girl's bathroom in tears. That evening, during the Hallowe'en feast, it was announced that a mountain troll was loose in the school. Ron and Harry came to Hermione's rescue after hearing that she was in trouble, with Ron successfully using the Levitation Charm to levitate the troll's club and drop it on its head, knocking it out. She, in return, lied to protect them from Professor McGonagall. The three then became very close friends.[11]"
  },
  {
    "paragraph_index": 7,
    "raw_text": "During their first year, the three of them learnt that the Philosopher's Stone was being hidden in Hogwarts and sought to protect it from being stolen by Severus Snape, whom the young wizards believed to be working for Lord Voldemort. Ron's talent in Wizard's Chess allowed them to pass one of the obstacles protecting the stone, which was a life-sized game. Ron sacrificed himself as a game piece so Harry could place the enemy king in checkmate, allowing Harry and Hermione to move on."
  },
  {
    "paragraph_index": 8,
    "raw_text": "Ultimately, it was discovered that Professor Quirrell was trying to steal the stone for Voldemort. Harry succeeded in defeating him and protecting the Philosopher's Stone, and Ron was awarded fifty House points by Albus Dumbledore for \"the best played game of chess that Hogwarts has seen these many years\", allowing Gryffindor to win the House Cup for the first time in seven years.[11]"
  },
  {
    "paragraph_index": 9,
    "raw_text": "Having not heard from Harry Potter during the whole summer of 1992, Ron, Fred and George Weasley, in a planned scheme to rescue him from 4 Privet Drive, drove Arthur Weasley's flying Ford Anglia to the Muggle town of Little Whinging and tore the bars from Harry's bedroom window using the car's horsepower. Ron and the twins helped Harry get his things in the car, and they left for the Weasley House. Upon landing Ron and his brothers were ratted out by Molly Weasley for having taken such a risky course of action."
  },
  {
    "paragraph_index": 10,
    "raw_text": "At the start of that year's school term, Ron and Harry missed the Hogwarts Express due to the tricks of Dobby the house-elf and were forced to use the Ford Anglia to travel to Hogwarts. At the end of their journey, the car failed, causing the boys to crash-land into the Whomping Willow. They were nearly killed when the tree shook, and the car jettisoned them and took off into the Forbidden Forest, where it remained.[32]"
  },
  {
    "paragraph_index": 11,
    "raw_text": "Ron's wand was damaged in the crash, causing him problems for the entire school year. It backfired when Ron attempted to curse Draco Malfoy in payback for calling Hermione a \"Mudblood\" with the Slug-vomiting Charm, resulting with him vomiting slugs and slime."
  },
  {
    "paragraph_index": 12,
    "raw_text": "Malfoy's disdain towards Muggle-borns led Ron, Harry, and Hermione to suspect that he was the Heir of Slytherin who opened the Chamber of Secrets that year, unleashing a \"monster\" that began to attack Muggle-born students.[32]"
  },
  {
    "paragraph_index": 13,
    "raw_text": "To investigate this theory, Hermione brewed a Polyjuice Potion which greatly surprised Ron in that she was so overtly breaking the rules. When the time came to use the potion, Ron was made to impersonate Vincent Crabbe, and Harry impersonated Gregory Goyle, while Hermione's transformation was unsuccessful because she mistook hair from Millicent Bulstrode's cat for her own."
  },
  {
    "paragraph_index": 14,
    "raw_text": "Ron and Harry interrogated Malfoy in the Slytherin Common Room, during which Malfoy proceeded to insult both Dumbledore and Harry. He also made a callous comment about Hermione, hoping that she would be the Muggle-born victim that dies during the attacks. \"But I know one thing: last time the Chamber of Secrets was opened, a Mudblood died. So I bet it’s only a matter of time before one of them’s killed this time… I hope it’s Granger\".[34] This comment upset both Ron and Harry, but they were able to maintain their cover and eventually realised that Malfoy was not the Heir of Slytherin.[32] In fact, Malfoy had no idea who was behind the attacks."
  },
  {
    "paragraph_index": 15,
    "raw_text": "Ron and Harry were both greatly upset when Hermione became another victim of the \"monster\", ending up petrified in the Hospital Wing, though she left her friends a clue that led them to deduce that the monster was a basilisk. Ron showed incredible bravery during the course of their investigation by venturing into the Forbidden Forest to an Acromantula den led by Aragog, in spite of his extreme fear of spiders."
  },
  {
    "paragraph_index": 16,
    "raw_text": "Harry and Ron learned Rubeus Hagrid had nothing to do with opening the chamber, but when Aragog tried to make a meal of them, they narrowly escaped thanks to the magic that had engulfed the Flying Ford Anglia.[32] After escaping the forest Ron was furious with Hagrid for endangering their lives."
  },
  {
    "paragraph_index": 17,
    "raw_text": "When he and Harry learned that Ginny (Ron's younger sister) was dying in the Chamber of Secrets, they raced to save her, planning to give their information to Professor Gilderoy Lockhart. When the pair discovered that the professor was attempting to flee, they drew their wands on him and forced him to join them as they ventured into the Chamber of Secrets."
  },
  {
    "paragraph_index": 18,
    "raw_text": "Shortly after Ron, Harry and Lockhart entered the Chamber, Lockhart attempted to wipe their memories in order to get out of the Chamber and take credit for their efforts in a bid for fame. Unfortunately for him, he used Ron's damaged wand, and the spell backfired, causing permanent amnesia in Lockhart. Ron was left behind to tend to Lockhart, as Harry delved deeper into the Chamber, saving Ginny and defeating Salazar Slytherin's basilisk, avenging all its petrified victims.[32]"
  },
  {
    "paragraph_index": 19,
    "raw_text": "Afterwards, Ron was honoured with a Special Award for Services to the School, as well as earning two hundred House points for Gryffindor for his work concerning re-sealing the Chamber of Secrets.[32]"
  },
  {
    "paragraph_index": 20,
    "raw_text": "In the summer following Ron's second year at Hogwarts, the Weasleys won the Daily Prophet Grand Prize Galleon Draw. Ron and his family used the money to travel to Egypt to visit Ron's eldest brother, Bill. News of their lucky break made the Daily Prophet, and Ron sent that newspaper clipping and a Sneakoscope to Harry for his thirteenth birthday. They met on the last day of the summer, when Ron and his family visited Diagon Alley with Harry and Hermione and took up rooms in the Leaky Cauldron in preparation for catching the Hogwarts Express. Ron's parents also purchased him a new wand to replace the broken one he had lost the previous year.[4]"
  },
  {
    "paragraph_index": 21,
    "raw_text": "During their stay at the Leaky Cauldron, Ron shared a room with his brother Percy. Unfortunately, this led to a fight. Percy believed that Ron had taken his Head Boy badge, which had actually been stolen by Weasley twins Fred and George. Harry found the twins hiding, enchanting the badge to say \"Big Head Boy\". Later, Ron was also accused of smudging a picture of Percy's girlfriend, Penelope Clearwater with tea (Penelope thus hid herself outside the frame so nobody could see her splotched nose).[4]"
  },
  {
    "paragraph_index": 22,
    "raw_text": "Also that summer, Sirius Black, the most famous prisoner in Azkaban, escaped, and in light of this incident, security was tightened at Hogwarts which Ron and his friends noticed when the Hogwarts Express was stopped and searched by Dementors. Once at the school, Dumbledore announced that Dementors would be stationed around the school gates to prevent Black from entering Hogwarts. This was done under the assumption that Harry was being targeted by Black.[4]"
  },
  {
    "paragraph_index": 23,
    "raw_text": "Upon starting the term, the third-years began taking new lessons. Ron and Harry had chosen Divination and Care of Magical Creatures, while Hermione decided to take every possible class offered and began to exhibit strange behaviour that neither Ron nor Harry could figure out. The pair quickly decided that Divination was not a class they really liked and that the professor, Sybill Trelawney, was a fraud."
  },
  {
    "paragraph_index": 24,
    "raw_text": "Ron's first Care of Magical Creatures was a disaster. Hagrid, the new Care of Magical Creatures professor, had planned what he thought to be a spectacular class on hippogriffs, when a hippogriff named Buckbeak attacked Draco Malfoy after Malfoy had insulted the rare creature, causing Malfoy to promise revenge. Also during that week, Ron had his first Defence Against the Dark Arts class with the new professor, Remus Lupin, and in short order Ron thought that Lupin was an excellent professor.[4]"
  },
  {
    "paragraph_index": 25,
    "raw_text": "On Hallowe'en, Ron and Hermione went on their first Hogsmeade trip. Harry, however, could not join them as his uncle Vernon had not signed his Hogsmeade permission slip. Meanwhile, Ron and Hermione visited every building in Hogsmeade and brought back loads of sweets from Honeydukes for Harry. They were discussing blood-flavored lollipops and Cockroach Clusters."
  },
  {
    "paragraph_index": 26,
    "raw_text": "Harry used the Marauder's Map to sneak into Hogsmeade. He then met Ron and Hermione in Honeydukes. They visited the Three Broomsticks, a pub run by Madam Rosmerta. When Cornelius Fudge, Minerva McGonagall, Filius Flitwick, and Rubeus Hagrid arrived, Harry hide underneath their table to avoid being seen. Harry used a tunnel to sneak into Hogsmeade village."
  },
  {
    "paragraph_index": 27,
    "raw_text": "While sneaking back into the school, he overheard a disturbing conversation that had a severe impact on his mental state.[35] Sirius Black was his parents' best friend, and was his godfather and legal guardian. Black was the Potters' Secret Keeper and he allegedly divulged the Potters' secret whereabouts to Lord Voldemort and murdered their friend Peter Pettigrew, as well as twelve Muggle bystanders. Peter left a finger to prove that he had been killed with the twelve Muggles.[35] That evening, Sirius Black sneaked into Hogwarts, and the students were forced to spend the night in the Dining Hall.[4]"
  },
  {
    "paragraph_index": 28,
    "raw_text": "Just before Christmas, Rubeus Hagrid received a complaint from the Committee for the Disposal of Dangerous Creatures about Buckbeak the hippogriff. When he shared this incident with Ron, Harry, and Hermione, the trio promised to do everything in their power to help defend Buckbeak."
  },
  {
    "paragraph_index": 29,
    "raw_text": "Ron and Harry put the defence of Buckbeak on the back-burner when on Christmas Day, Harry received a Firebolt broomstick from a mysterious sender. When Hermione, afraid for Harry's safety, turned the Firebolt in, Ron stopped talking to Hermione. The Firebolt incident only added to the rough tension between the two, as Hermione's new pet Crookshanks had been continually trying to attack Ron's rat, Scabbers. A few weeks later, when the two were on the verge of making up, Scabbers disappeared and Ron blamed Crookshanks, threatening the friendship between them.[4]"
  },
  {
    "paragraph_index": 30,
    "raw_text": "In the meantime, Black was yet to be found, and the night following the Gryffindor vs Ravenclaw Quidditch match, he sneaked into Gryffindor tower. Hearing the sound of ripping bed curtains, Ron awoke with a start to see Sirius Black standing over him holding a knife. He screamed, and Black fled.[4]"
  },
  {
    "paragraph_index": 31,
    "raw_text": "When Ron had woken up the entire Gryffindor House they all gathered in the Gryffindor Common Room to discuss the events. Professor Minerva McGonagall, the Head of House, was called. Ron explained his story and theorised that Black must have gone for the wrong bed and was aiming for Harry Potter. McGonagall asked Sir Cadogan about it and he told her that he had let Black enter after Black gave him the correct passcode.[36]"
  },
  {
    "paragraph_index": 32,
    "raw_text": "Another search of the castle took place, but Black escaped capture again. The Fat Lady resumed her duty of guarding Gryffindor Tower on the condition her portrait be guarded. Neville was placed in detention and stripped of his visitation rights to Hogsmeade for the rest of the school year and the other Gryffindors were forbidden to tell him the password to the tower, forcing him to wait outside for someone to let him in while the security trolls guarding the Fat Lady leered unpleasantly at him. But none of that compared to the Howler his grandmother sent him during breakfast, which shouted at him that he had brought shame to the family.[37]"
  },
  {
    "paragraph_index": 33,
    "raw_text": "This incident made Ron famous among the other students, but he came back down to Earth when Hagrid scolded him and Harry about their treatment of Hermione, who Hagrid told them was in over her head with all of her classes and the work she was doing for Buckbeak. Shocked, the pair patched things up with her a few days later, when they received a letter from Hagrid saying that Buckbeak had been sentenced to execution.[4]"
  },
  {
    "paragraph_index": 34,
    "raw_text": "With exams coming up, the trio set about studying and attempting to help Hagrid with Buckbeak's appeal. The appeal took place on the last day of their exams. Hearing that Buckbeak had lost, and was to be executed, Ron, Harry and Hermione went to visit Hagrid in the evening just before the execution. They offered to help set the record straight, but Hagrid told them that they would be in big trouble if they were seen. Helping the sobbing Hagrid make tea, Hermione found Scabbers hiding inside a milk jar. Soon they were hurried out the back of the hut, all the while they continued to lobby for a chance to set the record straight. When they heard what sounded like the killing, Ron, Harry and Hermione set off for Hogwarts in a slight state of shock.[4]"
  },
  {
    "paragraph_index": 35,
    "raw_text": "Before they made it back there, Scabbers began to squirm in Ron's hands and escaped. Not wanting to lose his rat again, Ron chased after Scabbers with Harry and Hermione behind him. He caught up to Scabbers, but not before they were in the shadow of the Whomping Willow tree. He looked up to see a large black dog bearing down upon him. The dog dived at Ron and gripping Ron's arm in its mouth, it dragged him into the Whomping Willow. To try and stop the dog from pulling him further, Ron tied his feet around a tree branch, but the dog's grip was so powerful his leg snapped. When the dog reached the Shrieking Shack, it let go of Ron and revealed itself to be Sirius Black.[4]"
  },
  {
    "paragraph_index": 36,
    "raw_text": "Sirius ambushed Harry and Hermione, disarming them when they entered the room where Ron was being held hostage. Upon seeing him, Harry attacked Black with Hermione and the seriously injured Ron helping in any way they could, but Harry could not bring himself to finish the job when he had Black in his power, and he was disarmed by Professor Lupin. Relieved at the sight of Lupin, Ron became worried when Lupin and Black greeted each other like brothers and demanded that Ron turn over his rat, Scabbers. Sirius and Lupin then told them about their own years spent at Hogwarts and how a wizard named Peter Pettigrew betrayed Harry's parents to Voldemort then framed Sirius and transformed into a rat to go into hiding."
  },
  {
    "paragraph_index": 37,
    "raw_text": "Still not fully convinced, Ron reluctantly handed over Scabbers when Lupin promised that if he was actually a rat, no harm would come to him. Scabbers was revealed to be Pettigrew, whom Sirius had recognised due to a missing toe. (Pettigrew has cut off one of his own fingers before transforming). A tearful Pettigrew confessed to the betrayal and begged for mercy from his former friends.[4]"
  },
  {
    "paragraph_index": 38,
    "raw_text": "When it was decided that Pettigrew should be turned over to the Dementors, Lupin splinted Ron's leg, and the assembled company left for Hogwarts. Along the way, the full moon broke out, and Lupin began to transform into a werewolf. In the skirmish, Pettigrew stole Lupin's wand, stunned Ron, and escaped into the moonlight. Hours later in the Hospital Wing, Ron was recovering both from his broken leg and Pettigrew's attack. As he was unable to walk, Ron did not join Harry and Hermione on their rescue mission to save Sirius from the Dementor's Kiss and Buckbeak from execution with Hermione's Time-Turner, though they would explain everything to him after they were successful in their task.[4]"
  },
  {
    "paragraph_index": 39,
    "raw_text": "Ron understood why Hermione did not immediately mention the Time-Turner. Ron was slightly dismayed but, now knowing the reason for her strange behaviour and timetable earlier on, he was nevertheless relieved that Sirius and Buckbeak were both safe and free."
  },
  {
    "paragraph_index": 40,
    "raw_text": "As a replacement for his lost pet, Sirius sent Ron a tiny owl. Ron, to the surprise of both Harry and Hermione, allowed Crookshanks to sniff the owl. Crookshanks gave his approval, thus confirming that it was in fact just an owl. Ginny immediately named it Pigwidgeon because she thought the name was \"sweet\"; annoyed and disgusted at this, Ron tried to choose another name, but it was too late, so he settled for using the nickname \"Pig\".[4]"
  },
  {
    "paragraph_index": 41,
    "raw_text": "In the summer of 1994, Ron invited Harry and Hermione to accompany the Weasleys to the Quidditch World Cup, which was being held in Britain for the first time in decades. While Hermione joined the Weasleys at The Burrow, Harry had to be picked up from the Dursleys. Arthur Weasley arranged to pick up Harry via Floo Network, not knowing that the Dursleys' fireplace was blocked, so when Ron, Arthur, Fred and George tried to fetch Harry they ended up stuck in the chimney. Part of the Dursleys' house was destroyed before Harry returned to the Weasley's house.[31]"
  },
  {
    "paragraph_index": 42,
    "raw_text": "The following day, Harry, Hermione, and all the Weasleys except Molly Weasley left for the Quidditch World Cup, where they set up camp and met many of their friends from Hogwarts or the Ministry. They had prime seats for the match, thanks to Mr Weasley, who had helped Ludo Bagman, Head of the Department of Magical Games and Sports, out of a messy problem. During the match Ron watched Viktor Krum, the Bulgarian Seeker, play an excellent match and catch the Snitch. Even though Krum caught the Snitch the Irish National Quidditch Team still won the match.[31]"
  },
  {
    "paragraph_index": 43,
    "raw_text": "That night, while the Irish supporters were still awake celebrating their victory, trouble began. Some Death Eaters who had managed to avoid imprisonment in Azkaban, attacked the camp where Ron and his friends and family were staying. Mr Weasley ordered Ron, Harry, Hermione, Fred, George, and Ginny to get to safety, while he and the older Weasley children set off to help the Ministry of Magic. Fred and George were responsible for Ginny's safety, which left the trio to themselves.[31]"
  },
  {
    "paragraph_index": 44,
    "raw_text": "Running off into the woods, Ron, Hermione, and Harry quickly lost Fred, George and Ginny, but they did find Draco Malfoy. Malfoy meanly suggested that Hermione, being a Muggle-Born, could easily be targeted by the Death Eaters, causing Ron to insist that she and Harry join him in going deeper into the woods. Soon they reached a patch of woods giving off a silver glow, where the trio found a few Veela witches surrounded by admirers. Ron was entranced and stated that he would create a broom that would fly to space. They had reached an empty clearing when they heard an unknown person cast the Dark Mark.[31]"
  },
  {
    "paragraph_index": 45,
    "raw_text": "On 1 September, Ron and his friends departed for Hogwarts aboard the Hogwarts Express. That evening at the Start-of-Term Feast, Dumbledore announced that Hogwarts would host the Triwizard Tournament. Ron found himself caught up in dreams of being a Triwizard Champion, but he was snapped back to reality by his fourth year classes. In Care of Magical Creatures, Hagrid had his students tending to Blast-Ended Skrewts, and in Defence Against the Dark Arts, Ron was impressed by the new professor, \"Mad-Eye\" Moody, when he taught the class about the three Unforgivable Curses."
  },
  {
    "paragraph_index": 46,
    "raw_text": "It was announced that the students from the Durmstrang Institute and Beauxbatons Academy of Magic would be arriving at Hogwarts on 30 October. Ron was dumbstruck when he saw Viktor Krum among the Durmstrang students, not realising how young his hero was. He was disappointed when Krum sat among the Slytherin students.[31]"
  },
  {
    "paragraph_index": 47,
    "raw_text": "Having discussed the possibility of somehow outsmarting the Goblet of Fire and the Age Line that Dumbledore had cast around it, Ron was surprised to find that Harry's name had come out of the Goblet of Fire. Jealous of the fact that Harry always seemed to receive all the attention, Ron refused to accept that Harry didn't put his name in the cup. He even went as far as to accuse Harry of cheating his way into the tournament. After the argument, he and Harry stopped talking to each other, and Ron began hanging out with other Gryffindors like Dean Thomas and Seamus Finnigan. He did start to miss Harry after his jealousy burnt out and was unable to understand why Harry didn't want to hang out or talk to him anymore to the point where when Rita Skeeter released an article about Harry he just assumed Harry was enjoying the attention he was getting.[31]"
  },
  {
    "paragraph_index": 48,
    "raw_text": "When Ron heard Harry talking to someone one night, he went down to see who it was since Harry didn't tell him about such a thing, only to be met with hostility from a very embittered Harry. When Harry accused Ron of trying to spy on him and when he told him who he talked to was none of Ron's business, Ron was deeply offended to the point where he tried to get Harry to tell him whom he was talking to by accusing him of practising for an interview. This only made Harry throw one of Draco Malfoy's \"Potter Stinks\" badges at him and tell him he could wear that during the First Task of the Triwizard Tournament. This made Ron finally realise that the reason Harry had started avoiding him was because Harry felt betrayed by him to the point where he had lost Harry's trust and respect and Harry no longer saw him as a friend, a realisation that deeply hurt Ron.[31]"
  },
  {
    "paragraph_index": 49,
    "raw_text": "Ron and Harry did not talk to each other again until after the First Task. After seeing just how much danger was involved in the task, Ron realised Harry would never have put his own name into the Goblet of Fire, and the two became best friends once again.[31]"
  },
  {
    "paragraph_index": 50,
    "raw_text": "Soon after the First Task, Professor McGonagall told Ron and the other Gryffindor boys about the traditional Yule Ball, held during the Triwizard Tournament. While all students above fourth year scampered around trying to find dates, Ron and Harry found it hard to ask girls to the ball. Struck by the beauty and charm of Fleur Delacour, the Triwizard Champion from Beauxbatons Academy and a part-Veela witch, Ron asked her to attend the ball with him, but fled in embarrassment without waiting for an answer. He also offended Hermione by not asking her, and then by suggesting that she did not have a date and thus could accompany him."
  },
  {
    "paragraph_index": 51,
    "raw_text": "Harry was eventually able to get them both dates with twins Parvati and Padma Patil. Ron's evening was a fiasco of the first sort. His \"traditional\" dress robes embarrassed him and his date, Padma Patil, and when Ron saw Hermione with Viktor Krum, he became intensely jealous. This led to a blazing argument between them during the end of the ball, with Ron making comments about Krum being too old for her and Hermione accusing him of ruining everything. Though their friendship did not suffer, it was clear that both had developed feelings for each other.[31]"
  },
  {
    "paragraph_index": 52,
    "raw_text": "During the Yule Ball, Ron had overheard Hagrid telling the Beaubaxtons Headmistress Olympe Maxime that he was half-giant. This information was also overheard by Daily Prophet Reporter Rita Skeeter, who wrote an article telling the wizarding world of Hagrid's heritage. This drove Hagrid to stop teaching for a time until Ron, Harry, and Hermione told him that they he was still their friend, no matter what.[31]"
  },
  {
    "paragraph_index": 53,
    "raw_text": "On 24 February, Ron was put into an enchanted sleep and tied up at the bottom of the Black Lake, to be \"rescued\" by Harry as part of the second task of the Triwizard Tournament. When he found out that Harry had stayed behind to save Fleur's sister Gabrielle Delacour as well, Ron jokingly took him to task, but was impressed when Harry was given extra points for \"outstanding moral fibre\"."
  },
  {
    "paragraph_index": 54,
    "raw_text": "Fleur thanked Ron and Harry in turn for helping save Gabrielle, kissing both of them on the cheek. Ron gained much attention from the other students due to his being taken hostage for the task. He proceeded to exaggerate the events of what happened until Hermione called him on it.[31]"
  },
  {
    "paragraph_index": 55,
    "raw_text": "Early in the spring, Ron joined Harry and Hermione in visiting Sirius Black, who had taken to hiding in Hogsmeade. There, they discussed the disappearances of Ministry officials Barty Crouch Snr and Bertha Jorkins. In the weeks leading up to the final tournament task, Ron and Hermione helped Harry prepare by researching and trying out different jinxes and other helpful spells for the task. Ron and Hermione watched Harry together from the sidelines.[31]"
  },
  {
    "paragraph_index": 56,
    "raw_text": "They were shocked when Harry returned with Cedric Diggory's dead body. Ron was relieved to see Harry when he was brought to the infirmary by Professor Dumbledore, eagerly wanted to question Harry about Diggory, but he was told off by Molly Weasley who, along with his brother Bill Weasley, had come to watch Harry. Ron was furious with the Minister for Magic, Cornelius Fudge, when he refused to believe Harry and Dumbledore, and calmed Molly when she was shocked by Black's appearance in the room. Ron did not go against Harry's story when he finally heard it, sticking by his best friend.[31]"
  },
  {
    "paragraph_index": 57,
    "raw_text": "After Voldemort rose to power and the Second Wizarding War began, Dumbledore reformed the Order of the Phoenix. In the summer of 1995, the Order moved into their headquarters at 12 Grimmauld Place with the Weasley schoolchildren and Hermione Granger, where they helped Molly Weasley clean the old house and remained watchful for information about Harry. In August, Harry arrived at the headquarters after a Dementor attack on his cousin. Ron felt sorry that he had to keep Harry oblivious to the Order's plan and soon learnt that Harry's anger had been growing due to his isolation from his friends and his persecution by the media.[5]"
  },
  {
    "paragraph_index": 58,
    "raw_text": "Ron, Harry and Hermione stayed at Grimmauld Place throughout August. In late August, Ron and Hermione were made a Gryffindor prefect, for which Molly and Arthur gave Ron a new Cleansweep Eleven. Bound by their prefect duties, Ron and Hermione were separated from Harry on the Hogwarts Express and could only join Harry in his compartment for the last part of the journey. When they arrived, Ron expressed concern that Hagrid was not at the welcoming feast and was suspicious of the new Defence Against the Dark Arts professor, Dolores Umbridge.[5]"
  },
  {
    "paragraph_index": 59,
    "raw_text": "At school, Ron was one of the many students who expressed frustration with Professor Umbridge's refusal to teach the class practical defensive magic. He also won the position of Keeper on the Gryffindor Quidditch team but was described by the team captain as \"needing improvement\". Ron's Quidditch practice caused him to fall behind in his schoolwork, to Hermione's chagrin. Soon, Ron's brother Percy Weasley sent him a letter advising him not to remain friends with Harry, whom he accused of being mad for supporting Dumbledore.[5] Ron was outraged by the letter's contents, tearing it into eight pieces and throwing it into the Gryffindor common room's fireplace, angrily declaring his brother to be \"the world's biggest git\"."
  },
  {
    "paragraph_index": 60,
    "raw_text": "Late in September, one evening when Harry returned from detention with Professor Umbridge, Ron, somewhat reluctantly, joined Hermione in convincing that Harry teach his fellow students defence against the dark arts. Harry initially disagreed, but after a few days he decided to give it a go. Around this time, Professor Umbridge was appointed the first Hogwarts High Inquisitor, giving her the power to randomly create new school rules and inspect teachers' lessons.[5]"
  },
  {
    "paragraph_index": 61,
    "raw_text": "Late in October, students had their first visit to Hogsmeade. There, Harry, Ron, and Hermione met with several students who were interested in learning proper defence. Ron defended Harry against Zacharias Smith when questions rose, and was among the first to sign the recruitment parchment. On the way home from Hogsmeade, Ron became upset when he learned from Hermione that his sister Ginny was dating Ravenclaw student Michael Corner. The following morning, Ron awoke to find that suddenly, by order of Professor Umbridge, all student groups had been disbanded including the House Quidditch teams, but he was mollified when Harry said they would continue with their secret group, which Ginny named \"Dumbledore's Army\" during their first meeting, mocking the Ministry of Magic's fears of student uprisings.[5]"
  },
  {
    "paragraph_index": 62,
    "raw_text": "In the weeks following the first Dumbledore's Army meeting, Quidditch season arrived. Ron had nervous issues prior to the first match against Slytherin. They had made badges saying \"Weasley is our king\", which Harry decided could not mean anything good. In an attempt to distract Ron from the Slytherins, Hermione kissed him on the cheek for luck, effectively stunning Ron. Ron's play was abysmal, and it was not helped by the Slytherins' new song also entitled, \"Weasley is Our King\". Following the game Ron wanted to resign, but learned he could not, as Harry Potter, Fred, and George Weasley had been banned from Quidditch for life."
  },
  {
    "paragraph_index": 63,
    "raw_text": "That evening Hagrid returned from his unknown disappearance. Although initially resistant he regaled the trio with his tales of the giants, though he refused to give them any hint about his gruesome injuries from Golgomath's tribe. Ultimately Hagrid's mission was a failure.[5]"
  },
  {
    "paragraph_index": 64,
    "raw_text": "Following Hagrid's return, he took up his post as Care of Magical Creatures professor. In Hagrid's first lesson, Ron learned about Thestrals, magical creatures that could only be seen by wizards and witches who had witnessed death.[5]"
  },
  {
    "paragraph_index": 65,
    "raw_text": "Frequent Dumbledore's Army meetings, O.W.L. homework, and his prefect duties took up most of Ron's time as the holidays approached. Following the last meeting of the term, Ron was amazed at Harry's \"romantic\" tale, earning him a stern talking to from Hermione who suggested that Ron had \"the emotional range of a teaspoon\". That night, Harry witnessed Ron's father, Arthur Weasley, being attacked by Lord Voldemort's snake, Nagini. When Harry's story was confirmed by Dumbledore and McGonagall, Ron, his siblings, and Harry were immediately sent to the Order's Headquarters, so they could look in on their father's convalescence, and there they spent the Christmas holidays, joined by Hermione the next day.[5]"
  },
  {
    "paragraph_index": 66,
    "raw_text": "During their first trip to St Mungo's Hospital, Ron overheard \"Mad Eye\" Moody thinking that Harry had been possessed by Voldemort. Ron was worried when Harry became quiet after the visit and wanted to talk to Harry about it. He got his chance after Hermione arrived and convinced Harry to come downstairs. Ron, Hermione, and Ginny told Harry how worried they had been and managed to confess that he was not being possessed. They had an enjoyable holiday, but on their second visit to the hospital, Ron learned the truth about the torture of Neville Longbottom's parents.[5]"
  },
  {
    "paragraph_index": 67,
    "raw_text": "Throughout the term, Ron continued to learn defensive and offensive magic from Harry. He also stayed on the Gryffindor Quidditch team, despite his very poor performances. Due to Quidditch, he missed the Valentine's Day visit to Hogsmeade. Though, he was impressed that Harry went public and hopeful that people might believe Harry when The Quibbler came out. Soon, Umbridge managed to sack Professor Trelawney, but her ability to name a replacement was pre-empted when Dumbledore arranged to have Firenze the Centaur teach the subject. Umbridge was affronted by this new staffing appointment.[5]"
  },
  {
    "paragraph_index": 68,
    "raw_text": "Soon after Trelawney's sacking, Marietta Edgecombe, a friend of Ravenclaw Student Cho Chang's who only reluctantly joined Dumbledore's Army, told Umbridge about the group, but was unable to give up any pertinent information once she saw a jinx activate on her face. Ron was able to escape when Umbridge, raided the Dumbledore's Army headquarters, but he was incensed when Professor Dumbledore was forced out of the school. He was also wary when his brothers Fred and George Weasley said they were going to do their part for Professor Dumbledore. After Fred and George's secret escape from Hogwarts, Ron was certain that his mother would blame him, but he was saved from this fate when Harry revealed that it was he who financed Weasleys' Wizard Wheezes.[5]"
  },
  {
    "paragraph_index": 69,
    "raw_text": "Ron played in the final Quidditch match of the season, though Harry and Hermione did not watch, as Hagrid finally revealed the source of his injuries to them. Ron played better, and Gryffindor won the Quidditch Cup. Ron was unable to settle to his studies the following day, but Harry and Hermione brought him down with Hagrid's secret injuries.[5]"
  },
  {
    "paragraph_index": 70,
    "raw_text": "Shortly thereafter, their Ordinary Wizarding Level exams were upon them. Ron managed to do very well, but he made a few mistakes. During their final exam, Harry dozed off and had another vision. This time, he saw Sirius being tortured by Voldemort in the Ministry. When Harry told Ron and Hermione of this they were wary, and Hermione suggested that Harry try to contact Sirius first. Ron ran off to distract Umbridge, but the plan failed, and Ron and his friends were rounded up and taken to Umbridge's office. There, Ron, Ginny, Neville, and Luna Lovegood managed to fight off Umbridge and her Slytherin Guards and escape to find Harry and Hermione outside the forest."
  },
  {
    "paragraph_index": 71,
    "raw_text": "Ron insisted that he join Harry in rescuing Sirius, but also insisted that the rest remain behind, but realised when many Thestrals appeared. When Harry led them into the Department of Mysteries, Ron stuck with him into the deepest recesses of the Department. There, the six Dumbledore's Army members were ambushed by twelve Death Eaters, led by wizarding aristocrat Lucius Malfoy, and Ron helped defend the prophecy Harry took from the Hall of Prophecy, but his fight was soon over when a Death Eater used a spell to wipe his brains. Ron was so confused that he summoned a tentacled-brain from a vat in the Brain Room and was attacked by it, but soon recovered later on. Ron was devastated by Sirius's death, but made sure that it was not discussed around Harry."
  },
  {
    "paragraph_index": 72,
    "raw_text": "During the summer following the battle, Ron learned he had received seven O.W.L.s, only failing Divination and History of Magic. Ron explained he did not mind, as he, like Harry, didn't like those subjects very much, anyway. Also during that summer, Ron learned that his brother Bill was engaged to Fleur Delacour. While this annoyed his mother, sister, and later Hermione, Ron took to defending Fleur and if she surprised him, he would still take on that dumbstruck look. His soft spot for Fleur particularly annoyed Hermione, who was finding it harder to keep her feelings for him under wraps."
  },
  {
    "paragraph_index": 73,
    "raw_text": "When Ron and Hermione learned that Harry was, in fact, the \"Chosen One\", Ron remained at Harry's side.[7] Ron, Hermione, Harry, Ginny, Molly, and Arthur also visited the twins shop Weasleys' Wizard Wheezes. Ron was impressed with the shop and the twins' flair for business. He attempted to take some products but was told to put them back after he revealed he had no currency. The trio also followed Draco Malfoy and learned that he wanted something repaired and that he put something else on hold."
  },
  {
    "paragraph_index": 74,
    "raw_text": "Ron would suffer much personal turmoil in his sixth year. Harry was named Gryffindor team captain. Ron was nervous about Quidditch try-outs but beat out Cormac McLaggen in saves, partly because Hermione cast a Confundus Charm on McLaggen in retaliation for him insulting Ron and Ginny. He was also envious when Harry and Hermione were invited to the Slug Club, while the new Potions professor Horace Slughorn ignored him, and when attention was paid to him, Slughorn usually got his name wrong."
  },
  {
    "paragraph_index": 75,
    "raw_text": "During this time, Ron showed brief flashes of jealousy about Harry and Hermione's closeness. He would take exception whenever Hermione complimented Harry on something Ron thought was equally due to him. Ron was temporarily mollified about this when Hermione asked if he would like to attend the club's Christmas party with her, and he agreed but thought it was only as friends.[7]"
  },
  {
    "paragraph_index": 76,
    "raw_text": "Ron was also worried over his sister's increasing involvement with boys, and after stumbling upon her kissing Dean Thomas, he blew up at her. In retaliation, Ginny belittled him for his complete inexperience with the opposite gender, declaring that Harry and Hermione had also snogged people. The siblings treated each other coldly afterwards, and Ron was so bothered by this — and by the revelation that Hermione had kissed Viktor Krum almost two years earlier — that he became touchy and his temper became volatile, and he even began to perform poorly in Quidditch training. In the last training session before the match against Slytherin, he snapped at his teammate, newcomer Demelza Robins, and Harry was forced to intervene, threatening to kick him out of the team if he kept acting like this."
  },
  {
    "paragraph_index": 77,
    "raw_text": "He also began to treat Hermione with a cold indifference, which confused her. He even offered to resign from the team. To boost his confidence, Harry pretended to pour the Felix Felicis into Ron's Pumpkin juice at breakfast. Harry even allowed Hermione to see the vial, so she would object to the cheating. This convinced Ron that he had an edge in the game, which caused him to play excellently. However, when after the match Harry revealed it was a trick, Ron rounded on Hermione and accused her of having no faith in his abilities.[7]"
  },
  {
    "paragraph_index": 78,
    "raw_text": "Shortly thereafter, Ron began his exhibitionist relationship with Lavender Brown. Hermione, incredibly angry and hurt by Ron's vindictive actions, conjured a flock of canaries to attack him; the birds scratched Ron badly. Although he did not report this, he spent a long time ranting about her violent and hypocritical act, and he and Hermione stopped talking to each other after that. When Hermione attended the Slug Club's Christmas party, she had originally wanted to attend with Ron but went with his hated rival, Cormac McLaggen, while Ron snogged Lavender in public and made fun of Hermione's behaviour in Transfiguration class, reducing her to tears.[7]"
  },
  {
    "paragraph_index": 79,
    "raw_text": "By Christmas break, however, Ron was becoming disenchanted with his relationship with Lavender, who had become increasingly possessive, annoyed him with the nickname \"Won-Won\", and gave him a gift of a necklace that said \"My Sweetheart\". Hermione did not come to The Burrow for the holidays as she usually did, and Ron made an attempt to speak to her after returning to school, but she ignored him.[7]"
  },
  {
    "paragraph_index": 80,
    "raw_text": "On 1 March 1997, Ron ate chocolate that he believed to be one of the presents for his 17th birthday but was, in fact, a gift from Romilda Vane to Harry spiked with a love potion. He found the box on the floor after Harry had chucked it out of his trunk, and thought it was a part of his pile of presents by the foot of his bed. Upon ingesting the chocolate, Ron became maddened with an obsessive need to see and be with Romilda. Harry, thinking fast, proceeded to take Ron to Slughorn's office to get an antidote. When in Slughorn's office, while Harry attempted to get Slughorn in a good mood hoping to get the true memory from him, Ron was nearly killed by poisoned mead intended for Albus Dumbledore. Harry managed to save Ron with a bezoar. The bezoar was one Slughorn had in his kit taken from a previous potions lesson. If it wasn't for Harry's timely actions and quick thinking, Ron would have died.[38]"
  },
  {
    "paragraph_index": 81,
    "raw_text": "A panic-stricken Hermione arrived at the Hospital Wing, forgetting her anger with him. Ron said Hermione's name in his sleep upon hearing her speak for the first time all day, and the two quietly reconciled after his near-death experience. Ron also took to feigning sleep whenever Lavender tried to visit him. He remained in the hospital the following week and was not able to play Keeper on Saturday 8 March for the Gryffindor vs Hufflepuff Quidditch match.[39]"
  },
  {
    "paragraph_index": 82,
    "raw_text": "On Monday 10 March Ron and Harry, who suffered a cracked skull from a mishit Bludger during the match, were able to leave the hospital wing, although Ron did not tell Lavender this.[40] His subsequent avoidance of Lavender and simultaneous spending more time with Hermione made Lavender suspicious; after she spotted him and Hermione leaving the boys' dormitories, seemingly alone (Harry was with them, but under his Cloak of Invisibility), Lavender ended the relationship, much to Ron's relief."
  },
  {
    "paragraph_index": 83,
    "raw_text": "Ron also had the idea of using Felix Felicis to retrieve Slughorn's true memory, while he and Hermione were preparing for their Apparition test. A little later, Ron was suitably impressed when Harry told him and Hermione how he managed to obtain the Horcrux memory from Professor Slughorn. A few weeks later, when Harry used Sectumsempra on Draco Malfoy, Ron lent his potions book to Harry so Professor Snape would not confiscate the Half-Blood Prince's book.[7] Ron did not endorse what Harry did to Malfoy, but he did not consider it that bad. He took this stance because Malfoy healed okay and did not sustain any lasting damage. Ron also understood why Harry wanted the Half-Blood Prince's book back."
  },
  {
    "paragraph_index": 84,
    "raw_text": "On the night of the Battle of the Astronomy Tower, Ron took Felix Felicis on Harry's instructions, along with Hermione and Ginny. Those three were joined by Neville Longbottom and Luna Lovegood, whom Hermione had summoned using the D.A. coins. While Hermione and Luna monitored Professor Snape's office, Ron and the others watched the Room of Requirement. Ron fought in the battle and survived without any major injuries, thanks to the Felix Felicis."
  },
  {
    "paragraph_index": 85,
    "raw_text": "He was shaken by his oldest brother Bill's scarring at the hands of the vicious werewolf Fenrir Greyback. Shortly afterwards, Ron attended the funeral of Albus Dumbledore, where he comforted a sobbing Hermione. He and Hermione informed Harry of their intention to accompany him on a quest to locate and destroy the Horcruxes of Lord Voldemort, forgoing their seventh year of school.[7]"
  },
  {
    "paragraph_index": 86,
    "raw_text": "During the summer of 1997, Ron began planning ahead for his mission with Harry and Hermione. With the help of his father and Fred and George Weasley, Ron transfigured the family ghoul to resemble himself sick with spattergroit, which would serve as his alibi for not attending his seventh year of Hogwarts while travelling with his friends.[10] Mrs Weasley was unware of this plan, as she was in denial about the trio's plans to drop out of Hogwarts."
  },
  {
    "paragraph_index": 87,
    "raw_text": "In late July, he participated in the Order's operation to remove Harry from his childhood home, taking Polyjuice Potion to be one of the \"seven Potters.\" He flew with Nymphadora Tonks; they were pursued by at least three Death Eaters during the battle, including Bellatrix and Rodolphus Lestrange. Ron stunned one of the Death Eaters in the face while flying. Ron reassured Hermione by nuzzling her back slightly upon landing as she had been quite worried about him and he was saddened at the death of \"Mad-Eye\" Moody. He was also saddened by the death of Harry's beloved pet owl Hedwig, over which he comforted Harry. Ron became concerned when Harry had a vision of an imprisoned Garrick Ollivander being brutally tortured by Lord Voldemort in the cellar at Malfoy Manor.[10]"
  },
  {
    "paragraph_index": 88,
    "raw_text": "Once Ron, Harry, and Hermione were all convened at The Burrow, they made plans to leave, much to the displeasure of Ron's worried mother. During the preparations for Bill's wedding, Mrs Weasley set Ron, Harry, and Hermione to separate tasks to prevent them from planning. On Harry's seventeenth birthday, Ron gave Harry a copy of Twelve Fail-Safe Ways to Charm Witches. Later that evening, Minister for Magic Rufus Scrimgeour visited The Burrow to dispense the contents of Dumbledore's will. He questioned the trio, and Ron let slip that they had no idea why Dumbledore would bequeath anything to him. Ron received Dumbledore's Deluminator.[10]"
  },
  {
    "paragraph_index": 89,
    "raw_text": "The trio attended the wedding for which, all summer, they had been forced to prepare The Burrow; the marrying couple was Ron's older brother Bill to Fleur Delacour on 1 August. Ron was irked and jealous that Viktor Krum was a guest, especially since he immediately complimented Hermione, who Ron quickly asked to dance shortly afterwards. When Viktor Krum asked who he thought was Barny Weasley (though it was really Harry in disguise) about the pair, he was somewhat disappointed to learn that they were \"sort of\" together, but not officially a couple.[10]"
  },
  {
    "paragraph_index": 90,
    "raw_text": "The celebrations were interrupted with the news that the Ministry of Magic had fallen to Voldemort, and Hermione Disapparated herself, Ron, and Harry away from the danger to Tottenham Court Road. This was the starting point to the trio's adventure and search for the Horcruxes they needed to bring down Lord Voldemort. After they arrived at Luchino café they were ambushed by Death Eaters Antonin Dolohov and Thorfinn Rowle there and a skirmish broke out. After stunning and wiping the memories of the Death Eaters, the trio took refuge in Harry's inherited house 12 Grimmauld Place left to him by Sirius Black.[10]"
  },
  {
    "paragraph_index": 91,
    "raw_text": "There, the trio learned from Kreacher that Regulus Black had stolen the Horcrux Voldemort had made of Slytherin's Locket in 1979, and that it had been stolen from 12 Grimmauld Place by Mundungus Fletcher. Under interrogation, he informed them that the locket was now in the possession of Dolores Umbridge.[10]"
  },
  {
    "paragraph_index": 92,
    "raw_text": "While they were waiting for Kreacher to fetch Mundungus, they were visited by Remus Lupin. He informed the trio about the goings on in the wider wizarding world. He told them that Harry was now the most wanted wizard in Britain and that Muggle-born witches and wizards were being rounded up. Ron immediately said that he would vouch for Hermione.[10]"
  },
  {
    "paragraph_index": 93,
    "raw_text": "They formulated a plan to infiltrate the Ministry, involving the use of Polyjuice Potion to assume the forms of Ministry employees Reginald Cattermole, Albert Runcorn and Mafalda Hopkirk. Ron, disguised as Reginald Cattermole, quickly found himself forced to separate from his friends, as Death Eater and new head of the Department of Magical Law Enforcement, Yaxley, demanded that \"Cattermole\" fix the rain in his office.[10]"
  },
  {
    "paragraph_index": 94,
    "raw_text": "Ron was in over his head, but may have found a solution to the problem after asking Arthur, who had no idea of Ron's true identity, for help. The trio reunited after Harry and Hermione stole the locket from Umbridge and freed some Muggle-born witches and wizards being held by the Muggle-Born Registration Commission, and then escaped, but were forced to abandon Grimmauld Place as a hideout. Ron splinched himself during their escape into the countryside and was weakened by his injury. After receiving some treatment from Hermione, Ron fretted over the fate of the Cattermoles.[10]"
  },
  {
    "paragraph_index": 95,
    "raw_text": "Afterward, weeks passed with no further progress. This, as well as the locket's negative influence, caused great tension and animosity amongst the group of friends. When he wore the locket, Ron was sullen and suspicious, lashing out at his friends and continuously complaining. Ron abruptly abandoned his friends one evening after getting into a violent and aggressive fight with Harry over the additional task of locating Godric Gryffindor's Sword in order to destroy the locket. He accused Harry of having no plan and of not being very concerned about Ginny, whom they had learned was punished back at Hogwarts."
  },
  {
    "paragraph_index": 96,
    "raw_text": "In response, Harry screamed at Ron to go. When Ron asked if Hermione was going with him and she told him that she was staying, he accused her of choosing Harry over him, and left, despite Hermione screaming and crying for him to come back.[10]"
  },
  {
    "paragraph_index": 97,
    "raw_text": "As soon as he was outside the influence of the Horcrux, Ron came to his senses and tried to return. However, he had a run-in with Snatchers first, who interrogated him. Ron claimed to be Stan Shunpike and then took an opportunity to escape. He apparated numerous times to try to find Harry and Hermione, splinching fingernails off at one point, but could not find them. He then went to stay with Bill and Fleur at their new home, Shell Cottage. Soon after Christmas, Ron used the Deluminator Dumbledore bequeathed him to locate his friends.[10]"
  },
  {
    "paragraph_index": 98,
    "raw_text": "Ron made his way to the Forest of Dean, where he arrived just in time to rescue Harry from drowning in a semi-frozen pond. When Ron attempted to use Godric Gryffindor's Sword to destroy the locket, horrible incorporeal images of Harry and Hermione came forth which cruelly mocked Ron about his many insecurities, including his fears that Hermione would choose Harry over him. This brought Ron to the point of tears. However, Ron, in far more rage than before, successfully stabbed the Horcrux with Godric Gryffindor's Sword.[10]"
  },
  {
    "paragraph_index": 99,
    "raw_text": "Afterwards, Harry took Ron aside to assuage his fears about Harry and Hermione. Saving Harry's life earned Ron Harry's forgiveness, but Hermione — who was unaware of what the Horcrux had done — was still furious with him for his abandonment for some time and attacked him mercilessly upon sight until Harry cast a Shield Charm to stop her.[10]"
  },
  {
    "paragraph_index": 100,
    "raw_text": "Upon his return, Ron was happy to the point of giddiness, because he thought that they had an ally out there somewhere. He sought to hide this happiness when around Hermione in an act of contrition. When Hermione proposed a trip to the Lovegood's house to investigate a recurring symbol, Ron wholeheartedly agreed. Harry privately accused Ron of only agreeing to get back on Hermione's good side, a fact that he did not deny stating, \"All's fair in love and war, and this is a bit of both.\"[10]"
  },
  {
    "paragraph_index": 101,
    "raw_text": "The trio learned of the existence of the Deathly Hallows from Xenophilius Lovegood. Xenophilius, worried for his daughter Luna, who was being held hostage by Death Eaters, tried to capture the trio. They narrowly escaped, Hermione engineering it in a way that preserved Ron's alibi of being sick at home. While Harry obsessed over the Hallows, Ron and Hermione thought they should focus on finding the Horcruxes, as Dumbledore had instructed them. During Harry's period of listless obsession, Ron's leadership qualities began to show. He suggested that they search many wizarding settlements for clues if only to be in motion and actively searching.[10]"
  },
  {
    "paragraph_index": 102,
    "raw_text": "During the Easter holidays of 1998, the trio was captured by a gang of Snatchers led by Fenrir Greyback after Harry accidentally broke the Taboo on Voldemort's name. Hermione hit Harry in the face with a Stinging Hex in order to disguise him. Harry, Hermione, and Ron quickly lied and gave fake names; Harry being Vernon Dudley, Hermione being Penelope Clearwater, and Ron being Stan Shunpike. Ron was beaten (his mouth extremely bloody) and was then forced to use another name, Barny Weasley. This was due to the Snatchers already knowing who Stan Shunpike was. The Snatchers also found Godric Gryffindor's sword in their tent, there was no explaining that.[10]"
  },
  {
    "paragraph_index": 103,
    "raw_text": "They were then brought to Malfoy Manor, where Lucius Malfoy attempted to get his son to identify Harry. Draco said that he did not know whether it was Harry or not, but immediately recognised Ron and Hermione. The trio then meet with Bellatrix Lestrange, whom separated them. Ron tried to persuade Bellatrix to take him for questioning instead of Hermione. She responded that she would interrogate him next if Hermione died during questioning, as \"blood-traitor was next to mud-blood in her book\". Ron was forced into the dungeon with Harry, Dean Thomas, and the goblin Griphook. In the dungeon they found Luna and Mr Ollivander, whom were captured in 1996.[10]"
  },
  {
    "paragraph_index": 104,
    "raw_text": "Hermione was kept upstairs and tortured by Bellatrix, her screams reducing Ron to tears. The group was saved by Dobby, who was sent by Aberforth Dumbledore. He freed Harry and Ron to run upstairs to save Hermione, who managed to lie under torture about where they had obtained Gryffindor's Sword. Ron disarmed Bellatrix after she avoided a chandelier dropped by Dobby, and pulled Hermione from the wreckage of the fallen chandelier, Disapparating them both to Bill and Fleur's home Shell Cottage. They stayed there with Luna, Fleur, Bill, Mr Ollivander, and Griphook. He attended the burial of Dobby, where he humbly gave him his shoes and socks.[10]"
  },
  {
    "paragraph_index": 105,
    "raw_text": "At the cottage Hermione recovered and she, Ron, and Harry planned to break into Gringotts Wizarding Bank in order to take Hufflepuff's Cup, and a Horcrux, within the Lestrange Vault. Griphook the goblin agreed to help them in exchange for Gryffindor's Sword. Ron, knowing that the sword was needed to destroy Horcruxes was reluctant to let Harry part with it. Harry suggested that they delay handing the sword over until the Horcruxes were destroyed. As the planning went forward, Ron, along with Harry and Hermione, found Griphook to be increasingly distasteful.[10]"
  },
  {
    "paragraph_index": 106,
    "raw_text": "On the morning of 1 May 1998, they broke into Gringotts with Hermione disguised as Bellatrix Lestrange, Ron as a fictional foreign wizard named \"Dragomir Despard\", and Harry under his Invisibility Cloak with Griphook. As they were headed down into the vaults, the Gringotts defences (the Thief's Downfall in particular) were set against them, and Ron's disguise melted away. Once in the vault, it was discovered that all the treasure had Geminio and Flagrante curses put on them. Although they were betrayed by Griphook, the trio obtained Helga Hufflepuff's cup and escaped the wizarding bank on the back of a dragon.[10]"
  },
  {
    "paragraph_index": 107,
    "raw_text": "After getting off the dragon escaping from the wizarding bank, Ron saw Harry having one of his visions. He was told that Lord Voldemort finally knew that they were hunting Horcruxes and that the final one was at Hogwarts. Harry, Ron, and Hermione apparated under the invisibility cloak to Hogsmeade looking for a way into Hogwarts. They were soon cornered by Death Eaters set to watch the town. Ron drew his wand ready to fight them, but Harry suggested that advantage lay in stealth and that attacking would give away their position. Once the Death Eaters ordered Dementors to search the town for the trio, Harry was forced to perform the Patronus Charm. After Harry's Patronus chased away the Dementors the trio found refuge in the Hog's Head.[10]"
  },
  {
    "paragraph_index": 108,
    "raw_text": "A heated discussion with the proprietor followed, who turned out to be Aberforth Dumbledore. The discussion revolved around Harry's mission and the seeming defeat of the Order of the Phoenix. After this they were lead into Hogwarts by a badly beaten Neville Longbottom, whom in Harry's absence became the de facto leader of the D.A. They arrived in the Room of Requirement and found that the reformed Dumbledore's Army was hiding out there. Harry whom had developed trust issues, did not like the idea of allowing the other DA members to help. Ron persuaded Harry to let the others do so anyway.[10]"
  },
  {
    "paragraph_index": 109,
    "raw_text": "While Harry searched for Ravenclaw's Diadem, Ron and Hermione entered the Chamber of Secrets to retrieve basilisk fangs. Ron mimicked the Parseltongue he had heard Harry use to open Salazar Slytherin's locket and succeeded in gaining entrance to the Chamber. Hermione used the fangs to destroy the Horcrux of Hufflepuff's Cup, and they then reunited with Harry. When Ron expressed desire to evacuate the house-elves from the Kitchens, Hermione, who had always been concerned for creatures so often mistreated by society, was so touched that she ran, nuzzled and kissed him, much to Ron's delight. However, their kiss was interrupted by Harry, who pointed out that there was a war going on and that they could carry on later, to which Ron pointed out there might not be later.[10]"
  },
  {
    "paragraph_index": 110,
    "raw_text": "Harry, Ron, and Hermione entered the Room of Requirement to find Ravenclaw's diadem, but were ambushed by Malfoy, Crabbe, and Goyle. When Crabbe unleashed a cursed fire, the trio escaped by means of broomsticks; Harry saved Draco, and Ron and Hermione saved Goyle. They then witnessed the death of Ron's brother Fred in combat, which devastated Ron, who wanted revenge. Hermione managed to calm him by reminding him that they would have to fight on their way to finding Nagini, Voldemort's final Horcrux. The trio made their way to the Shrieking Shack, and witnessed the snake kill Severus Snape on Voldemort's orders. While dying, Severus Snape's memories leaked out of him, which Harry collected into a glass phial to latter view in the headmaster's office.[10]"
  },
  {
    "paragraph_index": 111,
    "raw_text": "During the pause in the Battle of Hogwarts, Ron went to the Great Hall, where Bill comforted him over Fred's death and Hermione comforted Ginny. Harry went up to Dumbledore's office and emptied Snape's memories into the Pensieve. He entered the Pensieve and finally learned the truth of it all. After emerging from the Pensieve, he made use of the distraction to slip out and confront Voldemort. Following his alleged death, the battle resumed, and Ron and Neville Longbottom brought Fenrir Greyback down together. Ron witnessed Harry defeat Lord Voldemort once and for all, and survived the battle without serious injury.[10]"
  },
  {
    "paragraph_index": 112,
    "raw_text": "Ron never received a seventh year of education at Hogwarts. Instead of completing his education, he moved on to become an Auror (along with Harry) at the Ministry of Magic, where he helped track down and capture those of Lord Voldemort's supporters that had gone into hiding, or else feigned innocence or ignorance whilst having actually cooperated and willingly supported his regime.[30] Two years after he started at the Auror Office, he left to help his brother George at Weasleys' Wizard Wheezes in Diagon Alley, although he retained strong ties in the Ministry, and their work revolutionised both the Auror department and the institution at large, and along with Hermione, the trio helped \"make a new world\" for the wizarding community.[41]"
  },
  {
    "paragraph_index": 113,
    "raw_text": "His decision to step down was questioned by Rita Skeeter, who thought that Ron was tired of standing in Harry's shadow, and wrote in her gossip column that Ron was likely mentally ill (this must, of course, be taken with more than a small pinch of salt due to Rita's habit of writing scathing lies in articles), having said himself that the Horcrux hunt had \"took its toll\" on him.[27]"
  },
  {
    "paragraph_index": 114,
    "raw_text": "During the trial of Dolores Umbridge shortly after the war, Umbridge managed to escape and ally with some Death Eaters (Corban Yaxley, the Carrows, and Walden Macnair). Together, they planned a plot involving Time-Turners to bring back the dictatorship that had existed in the British Ministry of Magic from 1997–1998. They were stopped, however, by Ron Weasley, Hermione Granger and Harry Potter.[42]"
  },
  {
    "paragraph_index": 115,
    "raw_text": "Sometime between 1998 and 2006, Ron married Hermione, and later the couple had two children: Rose and Hugo. Ron was also the godfather and uncle of Harry and Ginny's oldest son. At some point, Ron, Harry, and Hermione were all featured on Chocolate Frog Cards for their accomplishments, which Ron considered his \"finest hour\".[43]"
  },
  {
    "paragraph_index": 116,
    "raw_text": "Ron himself noted that he and Hermione were quite young when they were married and that he became rather drunk afterward, having very little memory of the night after the ceremony.[44]"
  },
  {
    "paragraph_index": 117,
    "raw_text": "On 31 October 2009, Ron came back to Hogwarts to bring his Deluminator to Headmistress McGonagall so she could take another look at it. On the way there, he travelled past London and used the Deluminator to collect the lights of half a street. When he arrived, he happened to be attracted to Nicholas de Mimsy-Porpington's Deathday Party, where he talked to an unidentified student and showed them the Deluminator. When Peeves caused the lights in the party hall to go out, Ron encouraged the student to use the Deluminator to restore the lights.[45]"
  },
  {
    "paragraph_index": 118,
    "raw_text": "Seeing the ghosts at the party also inspired Ron to develop with George a banquet platter that looked and smelled bad (which might be appealing to ghosts) but tasted fresh when taken off of the plates. Several days later, he met the unidentified student again at Weasleys' Wizard Wheezes, and they talked about the ghosts as well as the unfinished banquet platter.[46]"
  },
  {
    "paragraph_index": 119,
    "raw_text": "During the 2010–2011 school year, Ron came back again to his alma mater to join the defence force against Dementors and other Dark creatures when they attempted to attack the castle. He was seen putting up and reinforcing the spherical shield around the castle with students and staff, and he also participated in the big battle that ended the attacks. He discussed with Harry, Hermione and the staff about the cause of the attacks afterwards, and when Harry said he had an idea, Ron guessed that he meant the Death Eaters, though it was not what Harry had in mind.[47]"
  },
  {
    "paragraph_index": 120,
    "raw_text": "Ron was looking after Weasleys' Wizard Wheezes one day when the unidentified student visited again, and he introduced several products to them such as the Wildfire Whiz-bangs, trick wands and Skiving Snackboxes and told stories about them. For the last one, he showed them the Canary Cream, and they both ate it and briefly turned into canaries. The student asked if there were other flavours of it, and Ron took it to be a good advice to develop more flavours to mix into other food or tempt others into eating, joking that he would eat a drumstick-flavoured biscuit at once.[48]"
  },
  {
    "paragraph_index": 121,
    "raw_text": "Another time, Ron and George followed the student into Zonko's Joke Shop while debating about whether old joke products could still become a big sale. The student recognised them, and Ron argued that products like Dungbombs were classics for a reason, and if Zonko's was able to sell them well, so could they. George demanded evidence from him, and the student suggested they learn from their customers about their preferences. The brothers then started a fight that involved different kinds of pranks to determine what people liked more.[49] After George invited Harry with selling the products, Ron became upset and invited Hermione, who was unable to decline.[50] At the end, George asked Ron to summarise the results of the questionnaires, but neither of them kept record. Ron wondered how they could know the winner, and felt it would be better if Fred was there, who he believed was more thoughtful and quick to action, though George reckoned both of them were better at those than Ron. They reminisced about Fred, and were joined by the student's friends.[51]"
  },
  {
    "paragraph_index": 122,
    "raw_text": "Ron, Hermione and their children Rose and Hugo all attended the final of the 427th Quidditch World Cup in the Patagonian Desert in July 2014, alongside Harry, Ginny, James, Albus, Teddy Lupin, Neville, Hannah, Luna, Rolf, Bill, Fleur, Victoire, and potentially others.[27] Ron also became close with Harry's children, one of whom, James, was his godson. Lily Luna Potter and Ron's son were close in age and good friends, as were Ron's daughter and Albus Severus Potter."
  },
  {
    "paragraph_index": 123,
    "raw_text": "In August of 2017, Ron, having settled into a rotund middle age, obtained a Muggle driving licence. He also admitted putting a Confundus Charm on the Muggle driving inspector because he had forgotten to use his wing mirror properly, excusing this mistake because casting a Supersensory Charm would be more effective. That year, he and Hermione sent their daughter off for her first year at Hogwarts, and Ron encouraged Rose to be Sorted into Gryffindor House and to beat Scorpius Malfoy in marks. He hugged Hugo gently.[52]"
  },
  {
    "paragraph_index": 124,
    "raw_text": "As the train faded away, Ron remembered his time at Hogwarts and how he would love to be going back. At a gathering with Hermione, Harry and Ginny, they talked about the meeting and Ron attempted to cheer everyone up by making jokes which led them them telling him to stop. Before the start of the new school year, Ron and Hermione told Rose to try and befriend Albus again since they have drifted apart since starting Hogwarts.[52]"
  },
  {
    "paragraph_index": 125,
    "raw_text": "A while later, Ron attended a meeting at the Ministry of Magic. Hermione was worried about how Harry was having nightmares and his scar was hurting again. Ron got into an argument with Draco Malfoy."
  },
  {
    "paragraph_index": 126,
    "raw_text": "When Albus and Scorpius meddled with time, they changed Ron's life. In one alternate reality, Ron helped Harry and Ginny find Albus. Ron never married Hermione and instead married Padma Patil. In another alternate reality where Voldemort won, Ron was in hiding with Hermione as a member of what remained of Dumbledore's Army. They were visited by Severus Snape and Scorpius who told them about the original timeline where they won. Ron agreed to help correct time by time-travelling to the moments where Albus and Scorpius changed time and use a Shield Charm to stop them."
  },
  {
    "paragraph_index": 127,
    "raw_text": "However, when they stopped them the first time, they returned to a present that hadn't changed much. They were attacked by Dementors and Ron and Hermione sacrifice their souls after professing their love for each other to give Scorpius time to escape. Their sacrifice, combined with Snape's a short time later, allowed Scorpius to return to the Second Task and set things right completely."
  },
  {
    "paragraph_index": 128,
    "raw_text": "When the original timeline was restored, Ron was asked to attend a meeting with Professor McGonagall to talk about what happened. He turned up late having somehow ended up in the kitchens instead. Ron, Hermione, Harry, Ginny and Draco were very forgiving of Albus and Scorpius so McGonagall reminded them of the great dangers of what they had done."
  },
  {
    "paragraph_index": 129,
    "raw_text": "Albus and Scorpius were kidnapped by Delphi and made to time-travel to 31 October, 1981. Ron went with Hermione, Harry, Ginny, and Draco to the past to save them and stop Delphi. However, under Ginny's prodding, they realised that Delphi did not to want to kill baby Harry, but rather to stop Voldemort from doing so in the hope he would live and his reign would continue. Delphi thought she could make her father stronger as he would know love when he met her, which its lacking was what had originally led to his downfall. Ron helped Harry duel Delphi and they apprehended her. Ron then returned to the present where Delphi was sent to Azkaban."
  },
  {
    "paragraph_index": 130,
    "raw_text": "During the Calamity, Ron would assist the members of the Statute of Secrecy Task Force who pursued a Professor profession when he ran into them in the Leaky Cauldron by debating on defensive footwork during duelling, causing them to gain increased resilience. Constance Pickering also talked Ron into hosting an informal lesson on evading enemy attacks for Task Force members who pursued an Auror profession, highlighting the advantages of supplementing defensive spells with evasive manoeuvres, such as side-steps and rolls.[53]"
  },
  {
    "paragraph_index": 131,
    "raw_text": "Ron later visited a pub with a Calamity Investigator working for the Task Force. The bartender, pleased that the Calamity Investigator had brought a \"celebrity\" into his pub, pulled them aside and gave them a secret phrase they could use to order off-the-menu pints and other items. Ron later oversaw a Wizard's Chess tournament attended by the same Calamity Investigator. Ron's commentary at the event was described as \"boisterous and colourful,\" allowing the Calamity Investigator to learn how to better focus on strategy despite considerable distraction.[53]"
  },
  {
    "paragraph_index": 132,
    "raw_text": "In the spring of 2021, The Unforgivable threatened Harry and Hermione after the two began wrenching control of Calamity surges away from the cabal. The two feared that their children would be targeted, but Harry insisted on continuing to fight against the Unforgivable. Harry redirected a Calamity surge and controlled it using memories of the Marauders. By April, Ginny had been attacked and Ronald had been abducted.[54]"
  }
]